{
  "title": "Cómo clasificar operaciones de criptomonedas según la AEAT",
  "excerpt": "Aprende cómo clasificar correctamente tus operaciones de criptomonedas según los criterios de la AEAT y evita errores en tu declaración fiscal.",
  "content": "Clasificar correctamente las operaciones de criptomonedas es uno de los pasos más importantes del proceso fiscal. De ello depende si una transacción genera una **ganancia patrimonial**, un **rendimiento** o una simple transferencia interna sin impacto fiscal.\n\nUna clasificación incorrecta puede alterar el resultado de tu declaración y generar **discrepancias con la AEAT**. Por eso, es esencial aplicar los criterios fiscales adecuados a cada tipo de operación, basados en su naturaleza y en la normativa vigente.\n\n---\n\n## Por qué la clasificación fiscal es esencial\n\nLa **clasificación fiscal** determina cómo tributa cada operación y en qué apartado de tu declaración debe incluirse. No es lo mismo una venta de Bitcoin (ganancia patrimonial) que los intereses obtenidos por staking (rendimiento del capital mobiliario).\n\n### Impacto en tu declaración\n\nCada tipo de operación tiene:\n\n- **Diferentes tipos impositivos**: Las ganancias patrimoniales tributan en la base del ahorro (19%-28%), mientras que otros rendimientos pueden tener tratamiento distinto\n- **Diferentes modelos fiscales**: Algunos deben declararse en el Modelo 100, otros requieren información adicional\n- **Diferentes criterios de cálculo**: FIFO para ganancias patrimoniales, valoración de mercado para rendimientos\n\nUna clasificación incorrecta puede llevar a:\n\n- Calcular mal la base imponible\n- Aplicar tipos impositivos incorrectos\n- Omitir operaciones que sí deben declararse\n- Incluir movimientos que no tienen impacto fiscal\n\n---\n\n## Tipos de operaciones que reconoce la AEAT\n\nLa **Agencia Tributaria** distingue principalmente tres categorías de operaciones en el ámbito de las criptomonedas:\n\n### 1. Operaciones patrimoniales\n\n**Definición:** Compraventas, intercambios o permutas de criptomonedas que generan ganancias o pérdidas patrimoniales.\n\n**Ejemplos:**\n\n- Venta de Bitcoin por euros\n- Intercambio de Ethereum por otra criptomoneda (swap)\n- Uso de criptomonedas para comprar bienes o servicios\n- Conversión de tokens en exchanges descentralizados\n\n**Tributación:**\n\n- Se aplica el método **FIFO** para calcular el coste de adquisición\n- Las ganancias tributan en la **base del ahorro** (19%-28%)\n- Las pérdidas pueden compensarse con otras ganancias patrimoniales\n\n### 2. Rendimientos del capital mobiliario\n\n**Definición:** Ingresos obtenidos por staking, préstamos o recompensas de protocolos descentralizados.\n\n**Ejemplos:**\n\n- Intereses por staking de ETH, ADA, DOT, etc.\n- Recompensas por yield farming o provisión de liquidez\n- Rendimientos por lending (préstamos de criptomonedas)\n- Airdrops recibidos como recompensa o incentivo\n\n**Tributación:**\n\n- Se valoran al **precio de mercado** en el momento de recibirlos\n- Tributan como **rendimientos del capital mobiliario**\n- Se declaran anualmente, aunque no se hayan convertido a euros\n\n### 3. Otras operaciones no sujetas\n\n**Definición:** Movimientos internos entre wallets o transferencias entre tus propias cuentas, que no tienen efectos fiscales siempre que se puedan justificar adecuadamente.\n\n**Ejemplos:**\n\n- Transferencia de Bitcoin de Binance a tu hardware wallet\n- Movimiento de Ethereum de MetaMask a Ledger\n- Consolidación de fondos en una sola wallet\n- Depósitos y retiros en exchanges\n\n**Importante:**\n\n> **Estas operaciones NO generan hecho imponible**, pero deben estar correctamente documentadas para evitar confusiones con la AEAT. Es crucial poder demostrar que son movimientos internos y no ventas o intercambios.\n\n---\n\n## Cómo determinar la naturaleza fiscal de cada transacción\n\nPara clasificar correctamente cada operación, la AEAT exige analizar el **propósito económico y el resultado** de la transacción.\n\n### Preguntas clave para clasificar una operación:\n\n1. **¿Cambia la titularidad del activo?**\n   - Sí → Probablemente es una operación patrimonial\n   - No → Puede ser un movimiento interno\n\n2. **¿Se genera un rendimiento o ingreso?**\n   - Sí → Puede ser rendimiento del capital mobiliario\n   - No → Analizar si es permuta o transferencia\n\n3. **¿Hay un intercambio económico?**\n   - Sí → Es una permuta sujeta a tributación\n   - No → Puede ser un movimiento sin impacto fiscal\n\n4. **¿Se puede demostrar que es un movimiento interno?**\n   - Sí (mismas direcciones, control exclusivo) → No sujeto\n   - No → Debe tratarse como operación patrimonial\n\n### Ejemplo práctico de clasificación\n\n**Operación:** Mueves 1 ETH de Coinbase a Uniswap y lo intercambias por 2000 USDC\n\n**Análisis:**\n\n1. **Primera parte** (Coinbase → Uniswap):\n   - Es un **movimiento interno**: Solo mueves fondos entre plataformas que controlas\n   - **No tiene impacto fiscal**\n\n2. **Segunda parte** (ETH → USDC en Uniswap):\n   - Es un **swap/permuta**: Cambias un activo por otro\n   - **Genera ganancia o pérdida patrimonial**\n   - Se calcula la diferencia entre el valor de venta del ETH y su coste de adquisición\n\nPor ejemplo, un **intercambio de tokens en un DEX** es una permuta sujeta a tributación, mientras que **mover fondos entre wallets personales** no lo es.\n\n### Información necesaria para clasificar correctamente\n\nLa clave está en disponer de **información completa**:\n\n- ✅ **Fechas exactas** de cada transacción\n- ✅ **Precios de mercado** en el momento de la operación\n- ✅ **Direcciones de origen y destino** (para identificar movimientos internos)\n- ✅ **Finalidad de cada operación** (compra, venta, swap, staking, etc.)\n- ✅ **Hash de transacción** para trazabilidad en blockchain\n- ✅ **Exchange o protocolo** donde se realizó\n\nSolo así se puede garantizar la **trazabilidad y coherencia** del informe fiscal.\n\n---\n\n## Errores comunes en la clasificación fiscal de criptomonedas\n\n### Error #1: No considerar los swaps como permutas\n\nUno de los errores más frecuentes es tratar los **swaps entre criptomonedas** como simples conversiones sin implicaciones fiscales, cuando en realidad son **permutas sujetas a tributación**.\n\n**Correcto:** Cada swap genera una ganancia o pérdida que debe calcularse con FIFO.\n\n### Error #2: No declarar rendimientos de staking\n\nOtro error habitual es no declarar los rendimientos de staking o airdrops, considerándolos **'no realizados'** hasta que se vendan.\n\n**Correcto:** Los rendimientos de staking deben declararse anualmente al precio de mercado del momento en que se reciben.\n\n### Error #3: Confundir movimientos internos con ventas\n\nTambién es común clasificar incorrectamente los movimientos entre wallets o mezclarlos con operaciones reales de compraventa.\n\n**Correcto:** Los movimientos entre tus propias wallets NO generan hecho imponible si puedes demostrar que controlas ambas direcciones.\n\n### Error #4: No aplicar FIFO correctamente\n\nMuchos inversores calculan las ganancias patrimoniales sin aplicar correctamente el método FIFO, lo que puede resultar en cálculos incorrectos.\n\n**Correcto:** Las primeras criptomonedas que compraste son las primeras que se consideran vendidas.\n\nEstos errores pueden generar **inconsistencias y alertas** en la revisión de la AEAT.\n\n---\n\n## Cómo garantiza Cleriontax una clasificación precisa\n\nEn **Cleriontax** analizamos cada transacción con un enfoque técnico y fiscal. Combinamos **automatización avanzada con revisión manual** para identificar el tipo exacto de operación y su impacto tributario.\n\n### Nuestro proceso de clasificación\n\n1. **Importación de datos** desde exchanges, wallets y blockchain\n2. **Análisis automático inicial** de cada transacción\n3. **Identificación del tipo de operación**:\n   - Compra/venta\n   - Swap/permuta\n   - Staking/lending\n   - Movimiento interno\n   - Airdrop/recompensa\n4. **Detección de movimientos internos** mediante análisis de direcciones\n5. **Cálculo de precios de mercado** históricos\n6. **Revisión manual por asesores fiscales** especializados\n7. **Validación de coherencia** entre diferentes fuentes\n8. **Generación del informe fiscal** clasificado y verificado\n\nNuestro sistema detecta:\n\n- ✅ Movimientos internos entre tus wallets\n- ✅ Intercambios entre tokens (swaps)\n- ✅ Operaciones DeFi complejas\n- ✅ Rendimientos pasivos (staking, farming)\n- ✅ Airdrops y recompensas\n- ✅ Comisiones de transacción (gas fees)\n\nAplicando los **criterios establecidos por la AEAT**, aseguramos que cada informe fiscal sea completo, coherente y fiscalmente correcto.\n\n---\n\n## Conclusión: rigor y trazabilidad en cada operación\n\nLa **clasificación fiscal de las operaciones crypto** requiere precisión y conocimiento especializado. Cada error puede traducirse en sanciones o ajustes por parte de Hacienda, por lo que es fundamental trabajar con informes verificados y metodologías consistentes.\n\nLos puntos clave son:\n\n- **Identificar correctamente** el tipo de operación (patrimonial, rendimiento, o movimiento interno)\n- **Aplicar los criterios fiscales** adecuados según la normativa de la AEAT\n- **Mantener trazabilidad completa** de todas las transacciones\n- **Documentar adecuadamente** los movimientos internos\n- **Calcular correctamente** las ganancias patrimoniales con FIFO\n\nEn **Cleriontax** transformamos miles de movimientos en datos estructurados y auditables, garantizando que cada operación esté correctamente clasificada y lista para declarar con total seguridad.\n\n---\n\n## Cleriontax: expertos en clasificación fiscal de criptomonedas\n\nNo dejes la clasificación de tus operaciones crypto al azar. Nuestro equipo de expertos garantiza que cada transacción se clasifique correctamente según los criterios de la AEAT.\n\n**[Solicita tu informe fiscal →](/es/contacto)**\n\nContacta con nuestro equipo y obtén una valoración inicial sin compromiso. Te explicaremos exactamente cómo clasificamos tus operaciones y por qué nuestros informes son los más precisos del mercado.\n\n---\n\n**Descargo de responsabilidad:** Este artículo tiene finalidad informativa y educativa exclusivamente. No constituye asesoramiento fiscal personalizado ni recomendación de inversión. La normativa fiscal está sujeta a cambios y cada situación personal es única. Consulta siempre con un asesor fiscal profesional colegiado para tu caso específico.\n\n---\n\n*Última actualización: Octubre 2025*\n\n*Publicado por: Equipo Cleriontax - Expertos en Fiscalidad de Criptomonedas y Análisis de Datos*"
}
