{
  "title": "Cómo declarar tus criptomonedas en la renta 2025 paso a paso",
  "excerpt": "Guía completa para declarar criptomonedas en la renta 2025 según la normativa de la AEAT. Aprende qué declarar, cómo hacerlo y cómo evitar errores comunes.",
  "content": "Cada año, la **Agencia Tributaria** refuerza el control sobre los activos digitales y exige una mayor transparencia a los inversores. Declarar tus criptomonedas no solo es una obligación legal, sino también una garantía de seguridad patrimonial y fiscal.\n\nLa **AEAT** dispone de información proporcionada por exchanges nacionales e internacionales, lo que significa que las operaciones realizadas en plataformas centralizadas o descentralizadas pueden ser detectadas fácilmente. Por tanto, no declarar tus criptos puede conllevar **sanciones, recargos o incluso inspecciones fiscales**.\n\n---\n\n## Por qué es importante declarar tus criptomonedas\n\nDeclarar correctamente tus criptomonedas no solo te protege de sanciones, sino que también te permite:\n\n- **Optimizar tu situación fiscal** y pagar exactamente lo que corresponde según la ley\n- **Evitar sanciones económicas** que pueden llegar hasta el 150% de las cantidades no declaradas\n- **Prevenir inspecciones fiscales** y procedimientos sancionadores de la AEAT\n- **Garantizar seguridad patrimonial** con documentación fiscal completa y trazable\n\n> **Importante:** La AEAT dispone de información proporcionada por exchanges nacionales e internacionales. Las operaciones en plataformas centralizadas y descentralizadas pueden ser detectadas fácilmente.\n\n---\n\n## Cuándo debes declarar tus criptomonedas\n\nLas criptomonedas se declaran cuando existe una **ganancia o pérdida patrimonial** derivada de:\n\n- **Venta de criptomonedas** por euros u otra moneda fiat\n- **Intercambio entre criptomonedas** (por ejemplo, BTC por ETH)\n- **Uso de criptomonedas** para comprar bienes o servicios\n- **Rendimientos obtenidos** por staking, farming, airdrops o préstamos de activos digitales\n\n### ¿Y si solo mantengo mis criptomonedas sin vender?\n\nIncluso si mantienes tus criptomonedas sin vender (estrategia **HODL**), debes informar sobre su valor y custodio en determinados modelos informativos, especialmente si superas ciertos umbrales establecidos por la normativa española.\n\n**Modelos informativos a tener en cuenta:**\n\n- **Modelo 720:** Si el valor de tus holdings en exchanges extranjeros supera los 50.000 euros a 31 de diciembre\n- **Modelo 721:** Obligatorio para proveedores de servicios de custodia (no para inversores particulares)\n\n---\n\n## Cómo calcular las ganancias o pérdidas\n\nLa **AEAT** exige utilizar el método **FIFO** (First In, First Out) para determinar qué unidades de criptomonedas se venden primero. Este método implica que las primeras criptomonedas que compraste son las primeras que se consideran vendidas.\n\n### El método FIFO paso a paso\n\n**Ejemplo práctico:**\n\nImagina que realizas las siguientes operaciones con Bitcoin:\n\n**Compras:**\n\n- Enero 2024: 0.5 BTC a 40.000 € (coste: 20.000 €)\n- Marzo 2024: 0.3 BTC a 50.000 € (coste: 15.000 €)\n\n**Venta:**\n\n- Junio 2024: 0.6 BTC a 60.000 € (ingreso: 36.000 €)\n\n**Aplicando FIFO:**\n\n1. Primero se venden los 0.5 BTC de enero:\n   - Ingreso: 0.5 × 60.000 = 30.000 €\n   - Coste: 20.000 €\n   - Ganancia: 10.000 €\n\n2. Luego se venden 0.1 BTC de marzo:\n   - Ingreso: 0.1 × 60.000 = 6.000 €\n   - Coste: 0.1 × 50.000 = 5.000 €\n   - Ganancia: 1.000 €\n\n**Ganancia patrimonial total: 11.000 €**\n\n### Por qué el cálculo FIFO es complejo\n\nCalcular correctamente las ganancias y pérdidas es uno de los pasos más complejos, ya que requiere:\n\n- Analizar el historial completo de transacciones desde el momento de adquisición\n- Conciliar movimientos entre diferentes wallets y exchanges\n- Rastrear operaciones en múltiples blockchains\n- Aplicar tipos de cambio históricos para cada transacción\n\nEn **Cleriontax** automatizamos este proceso y validamos cada transacción para garantizar informes precisos y trazables.\n\n---\n\n## Modelos fiscales que debes presentar\n\n### Modelo 100: Declaración de la Renta (IRPF)\n\nEl **modelo principal** donde se incluyen las ganancias o pérdidas patrimoniales derivadas de operaciones con criptomonedas.\n\n**Qué incluir en el Modelo 100:**\n\n- Ganancias y pérdidas patrimoniales por venta o intercambio de criptomonedas\n- Rendimientos del capital mobiliario por staking, lending y otras fuentes pasivas\n- Rendimientos del trabajo si recibes criptomonedas como salario\n\n### Modelo 721: Bienes y derechos en el extranjero\n\nObligatorio para **proveedores de servicios** de custodia de criptomonedas, exchanges españoles y plataformas que faciliten operaciones con criptoactivos.\n\n**Importante:** Los inversores particulares **NO deben presentar** el Modelo 721.\n\n### Modelo 714: Impuesto sobre el Patrimonio\n\nPuede ser necesario presentarlo dependiendo del **tipo de activo, residencia fiscal y volumen de operaciones**.\n\n> **Recomendación:** Identificar correctamente qué modelos se aplican a tu situación es clave para evitar errores y sanciones. Contar con asesoramiento especializado en fiscalidad crypto es fundamental.\n\n---\n\n## Errores más comunes al declarar criptomonedas\n\nEntre los errores más habituales se encuentran:\n\n### 1. No incluir los intercambios entre criptomonedas\n\nMuchos inversores creen que solo deben declarar cuando convierten criptomonedas a euros. **Error:** Los intercambios entre criptomonedas (por ejemplo, BTC por ETH) también generan ganancias o pérdidas patrimoniales que deben declararse.\n\n### 2. Confundir movimientos internos con ventas\n\nTransferir criptomonedas de un wallet a otro que tú controlas **NO genera** ningún hecho imponible. Sin embargo, es común confundir estas transferencias con ventas.\n\n**Ejemplos que NO tributan:**\n\n- Transferir Bitcoin de Binance a tu hardware wallet Ledger\n- Mover Ethereum de MetaMask a Trezor\n- Consolidar fondos de varios wallets en uno solo\n\n### 3. Usar informes automáticos con errores de cálculo\n\nAlgunos exchanges ofrecen informes fiscales automáticos que pueden contener errores en:\n\n- Aplicación incorrecta del método FIFO\n- Tipos de cambio históricos inexactos\n- Transacciones duplicadas o faltantes\n- Clasificación incorrecta de operaciones\n\n### 4. No declarar rendimientos de staking o lending\n\nLos rendimientos pasivos obtenidos por staking, lending o farming deben declararse como **rendimientos del capital mobiliario**, no como ganancias patrimoniales.\n\n> **Solución:** En Cleriontax revisamos y depuramos todos los datos antes de elaborar el informe fiscal final, aplicando criterios fiscales actualizados y verificando que las operaciones cumplen con las normas de la AEAT.\n\n---\n\n## Escalas de tributación para 2025\n\nLas ganancias patrimoniales de criptomonedas tributan en la **Base del Ahorro** con los siguientes tipos:\n\n| Base imponible | Tipo aplicable |\n|---|---|\n| Hasta 6.000 € | 19% |\n| De 6.000 € a 50.000 € | 21% |\n| De 50.000 € a 200.000 € | 23% |\n| De 200.000 € a 300.000 € | 27% |\n| Más de 300.000 € | 28% |\n\n**Ejemplo de cálculo:**\n\nSi has obtenido una ganancia patrimonial de 15.000 € por la venta de criptomonedas:\n\n- Primeros 6.000 € al 19% = 1.140 €\n- Siguientes 9.000 € al 21% = 1.890 €\n- **Total a pagar: 3.030 €**\n\n---\n\n## Plazos y fechas importantes para 2025\n\n**Modelo 100 (IRPF):**\n\n- Del **11 de abril al 30 de junio de 2025**\n- Domiciliación bancaria: hasta el 25 de junio\n\n**Modelo 720 (Bienes en el extranjero):**\n\n- Del **1 de enero al 31 de marzo de 2025**\n- Solo si superas 50.000 € en exchanges extranjeros a 31 de diciembre de 2024\n\n> **Recordatorio:** Presentar fuera de plazo conlleva recargos del 5% al 20% según el retraso, más intereses de demora.\n\n---\n\n## Conclusión: orden, trazabilidad y seguridad fiscal\n\nLa clave para declarar correctamente tus criptomonedas es disponer de:\n\n- **Datos organizados:** Historial completo de todas tus transacciones en todos los exchanges y wallets\n- **Criterios fiscales claros:** Aplicación correcta del método FIFO y clasificación adecuada de operaciones\n- **Trazabilidad completa:** Conciliación de movimientos entre plataformas y blockchains\n- **Asesoramiento especializado:** Expertos en fiscalidad crypto que conozcan la normativa actualizada de la AEAT\n\nLa fiscalidad crypto evoluciona constantemente, y contar con un equipo especializado marca la diferencia entre un informe seguro y un riesgo innecesario.\n\n---\n\n## Cleriontax: expertos en fiscalidad de criptomonedas\n\nEn **Cleriontax** te ayudamos a transformar el caos de datos de tus wallets y exchanges en un **informe fiscal exacto, verificado y listo para presentar** ante la AEAT.\n\n**Nuestro proceso automatizado:**\n\n- Importación automática desde más de 50 exchanges y wallets\n- Conciliación y limpieza de datos con algoritmos propios\n- Aplicación correcta del método FIFO para cada operación\n- Clasificación precisa de ganancias patrimoniales vs. rendimientos\n- Generación de informes listos para incluir en tu declaración\n- Revisión por asesores fiscales colegiados especializados en crypto\n\n**[Solicita tu informe fiscal →](/contacto)**\n\nContacta con nuestro equipo y obtén una valoración inicial sin compromiso. Te explicaremos exactamente qué necesitas hacer y cómo podemos ayudarte a declarar tus criptomonedas correctamente.\n\n---\n\n**Descargo de responsabilidad:** Este artículo tiene finalidad informativa y educativa exclusivamente. No constituye asesoramiento fiscal personalizado ni recomendación de inversión. La normativa fiscal está sujeta a cambios y cada situación personal es única. Consulta siempre con un asesor fiscal profesional colegiado para tu caso específico.\n\n---\n\n*Última actualización: Octubre 2025*\n\n*Publicado por: Equipo Cleriontax - Expertos en Fiscalidad de Criptomonedas y Análisis de Datos*"
}
