{
  "title": "Cómo Exportar Historial de Binance Correctamente: Guía Completa para Declaración Fiscal 2025",
  "excerpt": "Guía paso a paso para exportar correctamente todos tus datos de Binance en formato CSV. Aprende a obtener tu historial de transacciones, trades, staking, earn y conversiones para preparar tu declaración de la renta y cumplir con la AEAT.",
  "content": "**Binance** es el exchange de criptomonedas más utilizado del mundo, con millones de usuarios en España que operan diariamente con Bitcoin, Ethereum, stablecoins y cientos de altcoins.\n\nPero cuando llega el momento de preparar la **declaración de la renta** o responder a un requerimiento de la AEAT, muchos usuarios se enfrentan a un problema crítico: ¿cómo exportar correctamente todo el historial de operaciones de Binance para fines fiscales?\n\nExportar tus datos de Binance de forma incorrecta o incompleta puede resultar en:\n\n- Declaraciones fiscales erróneas que deriven en sanciones\n- Imposibilidad de justificar operaciones ante Hacienda\n- Pérdida de información sobre ganancias y pérdidas\n- Cálculos incorrectos del método FIFO\n- Falta de trazabilidad de tu actividad crypto\n\nEn esta **guía completa y actualizada para 2025**, te enseñaremos paso a paso cómo exportar correctamente todos tus datos de Binance, qué archivos necesitas, cómo interpretarlos y cómo organizarlos para tu declaración fiscal.\n\n---\n\n## Por qué es crucial exportar correctamente tu historial de Binance\n\nLa **Agencia Tributaria española (AEAT)** tiene acceso a información sobre tus operaciones con criptomonedas a través de diversos mecanismos: requerimientos a exchanges, información bancaria, cruces de datos internacionales y análisis blockchain.\n\n### Obligaciones fiscales con criptomonedas en España\n\nComo usuario de Binance en España, debes cumplir con varias obligaciones fiscales fundamentales. En primer lugar, cada vez que vendes, intercambias o conviertes criptomonedas, generas una ganancia o pérdida patrimonial que debe declararse en el [modelo 100 mediante la aplicación del método FIFO](/blog/como-declarar-criptomonedas-renta-2025). Esta tributación se produce en la base del ahorro con tipos que oscilan entre el 19% y el 28%, y requiere que conozcas con exactitud el precio de compra y venta de cada operación.\n\nSi el saldo total de tus criptomonedas en Binance supera los 50.000€ a 31 de diciembre, estás obligado a presentar el [modelo 721 de declaración de criptomonedas en el extranjero](/blog/modelo-721-criptomonedas). Las sanciones por no presentar este modelo pueden alcanzar desde 1.500€ hasta el 150% del valor no declarado, y debe presentarse en marzo del año siguiente.\n\nAdemás, los ingresos generados por staking, savings y lending deben declararse como rendimientos del capital mobiliario en el año fiscal en que se reciben. La AEAT puede solicitar justificación detallada de cualquier operación, por lo que los datos deben ser coherentes, estar completos y mantener una [trazabilidad absoluta de todas las transacciones](/blog/clasificar-operaciones-criptomonedas).\n\n### Consecuencias de no tener el historial completo\n\nSin un historial correcto y completo de Binance, te enfrentas a múltiples problemas fiscales. No podrás calcular correctamente tus ganancias o pérdidas patrimoniales ni aplicar el método FIFO obligatorio en España. Tampoco podrás justificar el origen de tus criptomonedas ante un requerimiento de Hacienda.\n\nEl riesgo más grave es que la AEAT considere que el 100% de tus ventas constituyen ganancia patrimonial, lo que puede resultar en liquidaciones tributarias excesivas, recargos por presentación fuera de plazo y sanciones significativas.\n\n> **Dato importante:** Si no puedes demostrar el precio de compra de tus criptomonedas, la AEAT puede considerar que el coste de adquisición es 0€, tributando el 100% del valor de venta.\n\n---\n\n## Tipos de datos que necesitas exportar de Binance\n\nBinance genera múltiples tipos de operaciones, cada una con implicaciones fiscales diferentes. Para una declaración fiscal completa, necesitas exportar todos los tipos de datos que hayan sido relevantes en tu actividad.\n\n### 1. Historial de transacciones (Transaction History)\n\nEste archivo incluye todos los depósitos y retiros tanto en fiat como en criptomonedas, las distribuciones y airdrops que hayas recibido, las recompensas de programas promocionales y todas las comisiones que hayas pagado en tus operaciones.\n\n**Por qué lo necesitas:**\n\n- Trazabilidad completa de entrada y salida de fondos\n- Justificación del origen de tus criptomonedas\n- Identificación de airdrops y recompensas (rendimientos fiscales)\n\n### 2. Historial de trades (Trade History)\n\nEl historial de trades spot incluye todas tus órdenes de compra-venta en pares como BTC/USDT, ETH/EUR y similares. Registra las órdenes limit, market y stop-limit con sus respectivos precios de ejecución, cantidades negociadas, comisiones aplicadas y fechas exactas con marca temporal.\n\n**Por qué lo necesitas:**\n\n- Cálculo de ganancias y pérdidas patrimoniales\n- Aplicación correcta del método FIFO\n- Base documental para la declaración en modelo 100\n\n### 3. Historial de conversiones (Convert History)\n\nLas conversiones incluyen todos los intercambios instantáneos entre criptomonedas que hayas realizado, como convertir BTC a ETH directamente. También abarca las conversiones de dust, esas pequeñas cantidades residuales que Binance permite convertir a BNB.\n\nEs crucial entender que fiscalmente, cada conversión entre criptomonedas constituye una permuta que genera una ganancia o pérdida patrimonial que debe declararse. Esto incluye incluso las conversiones de dust, que aunque involucran cantidades pequeñas, siguen siendo eventos fiscales según la [normativa de clasificación de operaciones](/blog/clasificar-operaciones-criptomonedas).\n\n### 4. Historial de staking y Earn\n\nSi has participado en staking de criptomonedas como ETH 2.0, ADA o DOT, o has usado productos de Binance Savings y Lending, todas las recompensas recibidas constituyen rendimientos del capital mobiliario. Estos ingresos deben valorarse al precio de mercado del día de recepción y declararse en el ejercicio fiscal correspondiente.\n\n### 5. Historial de comisiones (Fee Details)\n\nLas comisiones que pagas en Binance son gastos deducibles que reducen la base imponible de tus ganancias patrimoniales. Esto incluye las trading fees de compra-venta, las withdrawal fees de retiro y las comisiones pagadas en BNB si tienes activado el descuento del 25%.\n\n### 6. Otros historiales relevantes\n\nSi has operado con futuros, opciones o margin trading, necesitarás también el historial completo de estas operaciones, ya que los beneficios de derivados tributan como ganancias patrimoniales. Las distribuciones por airdrops, hard forks y recompensas de programas de referidos también deben estar correctamente documentadas.\n\n---\n\n## Guía paso a paso: Cómo exportar tu historial completo de Binance\n\nAhora vamos a ver exactamente cómo exportar cada tipo de dato desde tu cuenta de Binance de forma sistemática y completa.\n\n### Requisitos previos\n\nAntes de comenzar el proceso de exportación, asegúrate de tener:\n\n- ✅ Acceso a tu cuenta de Binance (web o app)\n- ✅ Verificación de identidad completada (KYC)\n- ✅ Autenticación de dos factores (2FA) activada\n- ✅ Conexión estable a internet\n- ✅ Espacio de almacenamiento para múltiples archivos CSV\n\n### Paso 1: Exportar historial de transacciones (Transaction History)\n\n**Acceso desde la web:**\n\n1. Inicia sesión en www.binance.com\n2. Haz clic en tu icono de perfil (arriba a la derecha)\n3. Selecciona \"Wallet\" → \"Transaction History\"\n4. Configura los filtros:\n   - **Tipo:** Selecciona \"All\" (o filtra por Deposit, Withdrawal, etc.)\n   - **Coin:** Puedes seleccionar \"All\" o una criptomoneda específica\n   - **Fecha:** Selecciona el rango (máximo 3 meses por exportación)\n5. Haz clic en \"Export Transaction History\" (esquina superior derecha)\n6. Selecciona \"Generate\"\n7. Recibirás un email cuando el archivo CSV esté listo\n8. Descarga y guarda con nombre descriptivo (ej. `Binance_Transactions_2024_Q1.csv`)\n\n**Importante:** Si tu historial abarca más de 3 meses, debes hacer **múltiples exportaciones** dividiendo por trimestres o meses.\n\n### Paso 2: Exportar historial de trades (Trade History)\n\nPara exportar tu historial completo de operaciones spot:\n\n1. Ve a \"Orders\" → \"Spot Order\"\n2. Haz clic en la pestaña \"Trade History\"\n3. Configura los filtros:\n   - **Par de trading:** \"All\" o pares específicos (BTC/USDT, ETH/EUR, etc.)\n   - **Fecha:** Rango de fechas (máximo 3 meses)\n   - **Side:** All (Buy y Sell)\n4. Haz clic en \"Export Complete Trade History\"\n5. Selecciona \"Generate\"\n6. Espera el email de confirmación y descarga el CSV\n\n**Columnas importantes del archivo:**\n\n| Columna | Descripción | Ejemplo |\n|---------|-------------|----------|\n| **Date(UTC)** | Fecha y hora en UTC | 2024-03-15 14:32:10 |\n| **Pair** | Par de trading | BTCUSDT |\n| **Type** | Tipo de orden | LIMIT, MARKET |\n| **Side** | Compra o venta | BUY, SELL |\n| **Price** | Precio unitario | 55000.00 |\n| **Executed** | Cantidad ejecutada | 0.025 BTC |\n| **Amount** | Valor total | 1375.00 USDT |\n| **Fee** | Comisión pagada | 0.00125 BTC |\n| **Fee Coin** | Moneda de comisión | BTC, BNB |\n\n### Paso 3: Exportar historial de conversiones (Convert History)\n\nLas conversiones instantáneas se exportan desde un apartado diferente:\n\n1. Ve a \"Wallet\" → \"Spot Wallet\"\n2. Haz clic en \"Convert\"\n3. Accede a \"Convert History\"\n4. Selecciona el rango de fechas\n5. Haz clic en \"Export\" y descarga el CSV\n\n**No olvides exportar también el Dust Conversion:**\n\n1. Ve a \"Wallet\" → \"Spot Wallet\"\n2. Haz clic en \"Convert to BNB\" (icono de tres puntos)\n3. Accede al historial de dust conversion\n4. Exporta el historial\n\n> **Nota fiscal:** Cada dust conversion es una permuta fiscal que genera ganancia/pérdida patrimonial, aunque las cantidades sean pequeñas.\n\n### Paso 4: Exportar historial de Earn (Savings, Staking, Lending)\n\nPara exportar tus recompensas de productos Earn:\n\n1. Ve a \"Earn\" → \"Simple Earn\" (o \"Savings\" si es cuenta antigua)\n2. Haz clic en \"History\"\n3. Selecciona:\n   - **Tipo:** Interest (intereses recibidos)\n   - **Fecha:** Rango completo\n4. Exporta el historial en CSV\n\nPara Staking:\n\n1. Ve a \"Earn\" → \"Staking\"\n2. Accede a \"Staking History\"\n3. Filtra por Status: All, Asset: All\n4. Exporta el archivo\n\nRecuerda que cada recompensa recibida es un ingreso fiscal que debe valorarse al precio de mercado del día de recepción, tal como explicamos en nuestra [guía sobre fiscalidad DeFi](/blog/fiscalidad-defi-espana).\n\n### Paso 5: Verificar que no falten datos\n\nAntes de terminar, verifica:\n\n- ✅ Has exportado datos de todos los años en que has usado Binance\n- ✅ No hay \"huecos\" en las fechas (exportaciones consecutivas sin gaps)\n- ✅ Has exportado todos los tipos de operaciones que realizaste\n- ✅ Los archivos CSV se abren correctamente y contienen datos\n- ✅ El número de operaciones coincide con tu recuerdo aproximado\n\n---\n\n## Cómo interpretar los archivos CSV de Binance\n\nUna vez descargados los archivos, necesitas entender su estructura para procesarlos correctamente.\n\n### Conversión de fechas UTC a hora local española\n\nBinance exporta todas las fechas en **UTC (Coordinated Universal Time)**. Para España:\n\n- **Horario de invierno:** UTC + 1 hora\n- **Horario de verano:** UTC + 2 horas\n\nEsto es importante para determinar el año fiscal correcto de operaciones cercanas a fin de año.\n\n**Ejemplo:**\n- Operación en Binance: 2024-12-31 23:30:00 UTC\n- Hora en España (invierno): 2025-01-01 00:30:00\n- **Año fiscal:** 2025 (no 2024)\n\n### Identificación de operaciones fiscalmente relevantes\n\n**Eventos que generan ganancia/pérdida patrimonial:**\n- ✅ SELL (venta de crypto a fiat o stablecoin)\n- ✅ Swap/Convert (intercambio crypto-to-crypto)\n- ✅ Dust conversion (conversión a BNB)\n- ✅ Uso de crypto para pagar comisiones\n\n**Eventos que NO generan tributación inmediata:**\n- ❌ BUY (compra de crypto con fiat)\n- ❌ Deposit (depósito)\n- ❌ Transfer interno entre wallets de Binance\n\n**Eventos que generan rendimientos:**\n- ✅ Staking rewards\n- ✅ Savings interest\n- ✅ Airdrops\n- ✅ Referral rewards\n\nSi necesitas ayuda para [clasificar correctamente cada tipo de operación](/blog/clasificar-operaciones-criptomonedas), nuestra guía especializada te explica en detalle los criterios fiscales aplicables.\n\n### Problemas comunes con los archivos CSV de Binance\n\nAlgunos archivos usan formato `DD/MM/YYYY`, otros `YYYY-MM-DD`. Normaliza todas las fechas a un único formato antes de procesar usando Excel, Google Sheets o [herramientas fiscales especializadas](/blog/herramientas-rastrear-criptomonedas).\n\nBinance usa punto (`.`) como separador decimal, pero Excel en español usa coma (`,`). Al abrir el CSV, especifica el formato \"inglés (Estados Unidos)\" para los números.\n\nLas comisiones pueden pagarse en diferentes monedas (BTC, BNB, USDT). Cada comisión debe valorarse al precio de mercado del momento.\n\nLas órdenes grandes pueden ejecutarse en múltiples \"fills\" parciales. Cada fill aparece como una línea separada en el CSV. Para calcular el precio medio de adquisición, usa la media ponderada.\n\n**Ejemplo:**\n- Orden: Comprar 1 BTC a precio de mercado\n- Fill 1: 0.4 BTC a 54.900€\n- Fill 2: 0.6 BTC a 55.100€\n- **Precio medio:** (0.4×54.900 + 0.6×55.100) / 1 = 55.020€\n\n---\n\n## Errores críticos al exportar datos de Binance (y cómo evitarlos)\n\nEstos son los errores más comunes que cometen los usuarios al exportar su historial de Binance para fines fiscales.\n\n### Error 1: Exportar solo un año cuando has operado varios\n\nMuchos usuarios solo exportan datos del año fiscal actual, ignorando años anteriores. Esto es grave porque no podrás calcular correctamente el coste de adquisición si compraste criptomonedas en años previos. El método FIFO requiere el historial completo desde tu primera compra.\n\n**Solución:**\n- Exporta datos desde tu **primera operación en Binance** hasta hoy\n- Si llevas años usando Binance, divide las exportaciones por trimestres\n\n### Error 2: Olvidar exportar las conversiones (Convert)\n\nAlgunos usuarios solo exportan trades del mercado spot, olvidando completamente las conversiones instantáneas. Esto es particularmente grave porque cada conversión crypto-to-crypto es una permuta fiscal.\n\nSi has usado frecuentemente la función Convert, estas operaciones pueden representar entre el 30% y el 40% de tus eventos fiscales totales.\n\n**Solución:**\n- Exporta siempre Convert History además de Trade History\n- Incluye también dust conversions aunque involucren cantidades pequeñas\n\n### Error 3: No exportar staking y earn si has usado estos productos\n\nLos rendimientos de staking se consideran ingresos fiscales que deben declararse como rendimientos del capital mobiliario, tributando en la base general del IRPF. No declararlos constituye una omisión fiscal sancionable.\n\n**Solución:**\n- Si has usado Staking, Savings, Launchpool, Vault o Lending: exporta todos esos historiales\n- Valora cada recompensa recibida al precio de mercado del día\n\n### Error 4: No convertir los precios a euros\n\nHacienda requiere que todas las operaciones se declaren en **euros (EUR)**, utilizando el tipo de cambio del día y hora exactos de cada operación.\n\n**Solución:**\n- Para cada operación, busca el precio EUR de la criptomoneda en ese momento\n- Fuentes fiables: CoinMarketCap Historical Data, CoinGecko, Kraken\n- Herramientas como Koinly o CryptoTax hacen esto automáticamente\n\n### Error 5: No guardar evidencias de las exportaciones\n\nEn caso de inspección, necesitas demostrar que los datos son oficiales y provienen directamente de Binance.\n\n**Solución:**\n- Haz capturas de pantalla del proceso de exportación\n- Guarda los emails de confirmación que Binance envía\n- Anota la fecha de exportación en el nombre del archivo\n- Conserva los archivos originales sin modificar\n\n### Error 6: No verificar la coherencia de los datos exportados\n\nBinance puede tener ocasionalmente problemas técnicos que generen exportaciones incompletas, operaciones faltantes o registros duplicados.\n\n**Solución:**\n- Verifica que el número de operaciones coincida con tu actividad aproximada\n- Comprueba que no hay gaps de fechas entre exportaciones consecutivas\n- Suma los saldos finales y verifica que coincidan con tu wallet actual\n\n---\n\n## Cómo organizar y procesar los datos exportados\n\nUna vez que tienes todos los archivos CSV descargados, necesitas organizarlos sistemáticamente y procesarlos para convertirlos en información fiscal útil.\n\n### Estructura de carpetas recomendada\n\nOrganiza tus archivos en una estructura jerárquica clara:\n\n```\n📁 Binance_Fiscal_2024/\n├── 📁 1_Originales/\n│   ├── 📄 Binance_Transactions_2024_Q1.csv\n│   ├── 📄 Binance_Transactions_2024_Q2.csv\n│   ├── 📄 Binance_TradeHistory_2024_Q1.csv\n│   ├── 📄 Binance_ConvertHistory_2024.csv\n│   ├── 📄 Binance_StakingHistory_2024.csv\n│   └── ...\n├── 📁 2_Procesados/\n│   ├── 📄 Todas_Transacciones_Consolidadas.xlsx\n│   ├── 📄 Trades_con_EUR.xlsx\n│   └── ...\n├── 📁 3_Evidencias/\n│   ├── 📄 Captura_exportacion_1.png\n│   ├── 📄 Email_confirmacion_Binance.pdf\n│   └── ...\n└── 📁 4_Informe_Final/\n    └── 📄 Resumen_Fiscal_Binance_2024.xlsx\n```\n\n### Consolidación de múltiples archivos CSV\n\nSi has exportado múltiples archivos del mismo tipo (varios trimestres de Trade History), necesitas consolidarlos en un único archivo para facilitar el análisis.\n\n**Opción 1: Manualmente con Excel/Google Sheets**\n\n1. Abre todos los CSV de un mismo tipo\n2. Copia y pega las filas en una única hoja\n3. Elimina encabezados duplicados\n4. Ordena por fecha (más antigua primero)\n5. Verifica que no haya duplicados\n\n**Opción 2: Con herramientas de procesamiento**\n\n- **Python + Pandas:** Para usuarios técnicos\n- **Power Query (Excel):** Integración automática de múltiples CSV\n- **Google Sheets Apps Script:** Automatización de consolidación\n\n### Conversión a euros (EUR)\n\nPara cada operación, necesitas añadir columnas con valores en EUR:\n\n**Columnas a añadir:**\n- Precio_EUR: Precio unitario en euros\n- Valor_Total_EUR: Valor total de la operación en euros\n- Comision_EUR: Comisión pagada en euros\n\n**Fuentes de cotizaciones históricas:**\n\n1. **CoinMarketCap Historical Data:** Ve a la página de la criptomoneda → \"Historical Data\" → Busca la fecha específica\n2. **CoinGecko:** Similar a CoinMarketCap con API disponible\n3. **Exchanges con pares EUR:** Kraken (BTC/EUR, ETH/EUR), Bitstamp, Coinbase Pro\n\n**Para pares sin cotización directa EUR:**\n\n**Ejemplo:** Operas con ADAUSDT el 15 de marzo de 2024\n\n1. Busca el precio ADA/USDT de ese día: 0.65 USDT\n2. Busca el precio USDT/EUR de ese día: 0.92 EUR\n3. Precio ADA/EUR = 0.65 × 0.92 = **0.598 EUR**\n\n### Cálculo de ganancias y pérdidas con método FIFO\n\nEspaña obliga a usar el **método FIFO (First In, First Out)**: las primeras criptomonedas que compraste son las primeras que vendes.\n\n**Ejemplo simplificado:**\n\n**Compras:**\n- 10/01/2024: Compras 0.5 BTC a 40.000€ = 20.000€\n- 15/02/2024: Compras 0.3 BTC a 45.000€ = 13.500€\n- **Total en cartera:** 0.8 BTC, coste total 33.500€\n\n**Venta:**\n- 20/03/2024: Vendes 0.6 BTC a 50.000€ = 30.000€\n\n**Cálculo FIFO:**\n- Vendes primero los 0.5 BTC comprados el 10/01 (coste: 20.000€)\n- Vendes luego 0.1 BTC de los 0.3 comprados el 15/02 (coste proporcional: 13.500€ × 0.1/0.3 = 4.500€)\n- **Coste total de adquisición:** 20.000€ + 4.500€ = 24.500€\n- **Ganancia patrimonial:** 30.000€ - 24.500€ = **5.500€**\n- **IRPF a pagar (19%):** 1.045€\n\n**Te quedan en cartera:**\n- 0.2 BTC (de la compra del 15/02) con coste de 9.000€\n\n### Herramientas para automatizar el procesamiento\n\nSi tienes muchas operaciones, procesar manualmente es inviable. Estas herramientas pueden ayudarte:\n\n**Herramientas fiscales especializadas:**\n\n1. **Koinly** (recomendado)\n   - Importación directa desde Binance (API o CSV)\n   - Cálculo automático de FIFO\n   - Generación de informes fiscales adaptados a España\n   - Precio: desde 50€/año según número de operaciones\n\n2. **CryptoTax, Accointing, CoinTracking**\n   - Soporte para múltiples exchanges\n   - Generación de informes para modelo 100\n\n**Ventajas:**\n- ✅ Conversión automática a EUR con cotizaciones históricas\n- ✅ Aplicación correcta del método FIFO\n- ✅ Identificación automática de tipos de operación\n- ✅ Generación de informes listos para la declaración\n- ✅ Ahorro de decenas o cientos de horas de trabajo manual\n\n**Desventajas:**\n- ❌ Coste (aunque muy inferior al de un asesor fiscal)\n- ❌ Curva de aprendizaje inicial\n- ❌ Necesitas verificar que los cálculos sean correctos\n\nSi prefieres un [servicio personalizado de procesamiento y análisis de tus datos](/servicios/analisis-carteras), en Cleriontax nos especializamos en integrar datos de múltiples fuentes y generar informes fiscales completos adaptados a tu situación específica.\n\n---\n\n## Verificación de integridad de los datos exportados\n\nAntes de usar los datos para tu declaración fiscal, debes verificar exhaustivamente que están completos y son coherentes.\n\n### Checklist de verificación\n\n**1. Completitud temporal**\n\n- ✅ El primer registro coincide con tu primera operación en Binance\n- ✅ El último registro es reciente (días antes de la exportación)\n- ✅ No hay gaps (huecos) de fechas entre archivos consecutivos\n\n**2. Consistencia de saldos**\n\nVerificación manual:\n\n1. Suma todos los depósitos de BTC\n2. Resta todos los retiros de BTC\n3. Suma/resta operaciones de compra-venta de BTC\n4. El resultado debe coincidir con tu saldo actual de BTC en Binance\n\n**Ejemplo:**\n```\nDepósitos BTC: +1.5 BTC\nRetiros BTC: -0.3 BTC\nCompras BTC (con USDT): +0.2 BTC\nVentas BTC (a EUR): -0.8 BTC\nSaldo calculado: 0.6 BTC\nSaldo real en Binance: 0.6 BTC ✅\n```\n\nSi no coincide, revisa:\n- Operaciones de Convert no exportadas\n- Comisiones pagadas en BTC\n- Transferencias internas entre productos (Spot ↔ Earn)\n\n**3. Coherencia de valores**\n\n- ✅ Todos los precios son positivos\n- ✅ Las fechas están en orden cronológico\n- ✅ No hay valores absurdamente altos o bajos\n- ✅ Las comisiones son coherentes (típicamente 0.1% en Spot)\n\n### Reconciliación con extractos bancarios\n\nPara depósitos y retiros fiat (EUR), verifica:\n\n1. Exporta tu historial de Transaction History filtrando por EUR\n2. Compara con tus extractos bancarios\n3. Cada depósito fiat en Binance debe corresponder a una transferencia saliente de tu banco\n4. Cada retiro fiat de Binance debe corresponder a un ingreso en tu banco\n\nSi hay discrepancias, pueden deberse a:\n- Comisiones bancarias no reflejadas en Binance\n- Retrasos en procesamiento (días diferentes)\n- Conversiones de divisa si tu banco está en otra región\n\n---\n\n## Preparación del informe fiscal final\n\nUna vez que tienes todos los datos exportados, procesados y verificados, el paso final es preparar el documento consolidado que utilizarás para tu declaración.\n\n### Resumen consolidado recomendado\n\nCrea un documento Excel o PDF con:\n\n**1. Resumen ejecutivo:**\n- Período fiscal cubierto\n- Número total de operaciones\n- Ganancia/pérdida patrimonial total\n- Rendimientos recibidos (staking, earn)\n- Saldo final a 31 de diciembre\n\n**2. Detalle de ganancias patrimoniales:**\n\n| Fecha | Operación | Cripto | Cantidad | Precio Venta EUR | Coste Adquisición EUR | Ganancia/Pérdida EUR |\n|-------|-----------|--------|----------|-----------------|----------------------|---------------------|\n| 15/03 | Venta BTC | BTC | 0.5 | 27.500€ | 20.000€ | +7.500€ |\n| ... | ... | ... | ... | ... | ... | ... |\n\n**Total ganancias patrimoniales:** XXXXX€\n\n**3. Detalle de rendimientos:**\n\n| Fecha | Tipo | Cripto | Cantidad | Valor EUR |\n|-------|------|--------|----------|----------|\n| 10/01 | Staking ETH | ETH | 0.05 | 115€ |\n| ... | ... | ... | ... | ... |\n\n**Total rendimientos:** XXXXX€\n\n**4. Saldos a 31 de diciembre:**\n\n| Criptomoneda | Cantidad | Precio 31/12 | Valor EUR |\n|--------------|----------|--------------|----------|\n| BTC | 0.3 | 42.000€ | 12.600€ |\n| ETH | 2.5 | 2.200€ | 5.500€ |\n| ... | ... | ... | ... |\n\n**Total valor cartera:** XXXXX€\n\n*(Importante para determinar si debes presentar [modelo 721](/blog/modelos-100-721-714-criptomonedas))*\n\n### Documentación de respaldo a conservar\n\nGuarda durante **al menos 4 años** (mejor 6 años):\n\n- ✅ Todos los archivos CSV originales descargados de Binance\n- ✅ Capturas de pantalla del proceso de exportación\n- ✅ Emails de confirmación de Binance\n- ✅ Hojas de cálculo con conversiones a EUR y fuentes usadas\n- ✅ Informes generados por herramientas fiscales (Koinly, etc.)\n- ✅ Extractos bancarios de depósitos/retiros fiat\n- ✅ Documentación de cotizaciones históricas\n\n### Integración en el modelo 100 (declaración de la renta)\n\nPara integrar tu informe en la declaración de la renta:\n\n- **Ganancias patrimoniales (casilla 389):** Incluye el total de ganancias patrimoniales calculadas\n- **Rendimientos del capital mobiliario (casilla 027-028):** Incluye el total de rendimientos por staking, savings, earn\n\nPuedes adjuntar tu resumen consolidado en formato PDF como documentación de respaldo cuando presentes la declaración.\n\nSi necesitas ayuda profesional para [preparar tu liquidación fiscal completa](/servicios/liquidaciones-fiscales), nuestro equipo puede encargarse de todo el proceso desde el análisis de datos hasta la presentación de los modelos oficiales.\n\n---\n\n## Casos especiales y situaciones complejas\n\n### Si has perdido acceso a tu cuenta antigua de Binance\n\nPerder el acceso a una cuenta antigua de Binance es más común de lo que parece.\n\n**Soluciones:**\n\n1. **Recuperación de cuenta:**\n   - Contacta con soporte de Binance (support@binance.com)\n   - Proporciona toda la información de verificación posible\n   - El proceso puede tardar semanas\n\n2. **Reconstrucción con información bancaria:**\n   - Usa tus extractos bancarios para identificar depósitos/retiros fiat\n   - Usa herramientas de análisis blockchain si hiciste depósitos/retiros crypto\n   - Estima operaciones basándote en tu memoria y capturas antiguas\n\n3. **Asesoría legal:**\n   - Si Binance no coopera, consulta con un abogado especializado\n   - En casos extremos, solicita que Binance proporcione los datos por requerimiento legal\n\n### Si has usado Binance antes de completar el KYC\n\nSi operaste en Binance cuando aún permitía trading sin verificación completa, sigues estando obligado a declarar, aunque no tengas acceso a exportaciones históricas.\n\n**Solución:**\n- Intenta completar el KYC ahora para acceder a historiales\n- Si no es posible, reconstruye con blockchain explorers (Etherscan, BscScan, etc.)\n- Declara de forma aproximada documentando la imposibilidad de acceso a datos exactos\n\n### Si has operado con múltiples cuentas (tuya y de familiares)\n\nCada cuenta de Binance debe corresponder a un único NIF/DNI. Usar la cuenta de otra persona para operar con tu dinero crea un problema fiscal significativo.\n\n**Solución:**\n- Cada persona debe tener su propia cuenta verificada con su DNI\n- Si ya operaste así, documenta transferencias entre cuentas bancarias para demostrar titularidad real\n\n### Si has hecho arbitraje entre Binance y otros exchanges\n\nEl arbitraje entre exchanges añade complejidad porque implica múltiples transferencias de criptomonedas que debes rastrear cuidadosamente.\n\n**Ejemplo:**\n1. Compras BTC en Kraken a 50.000€\n2. Transfieres a Binance (no tributación)\n3. Vendes en Binance a 50.500€ (ganancia: 500€)\n4. Compras ETH con esos USDT (permuta fiscal)\n5. Transfieres ETH a Coinbase (no tributación)\n\n**Solución:**\n- Exporta historiales de TODOS los exchanges usados\n- Usa herramientas fiscales que soporten múltiples exchanges (Koinly, CryptoTax)\n- Identifica claramente las transferencias inter-exchange para no duplicar operaciones\n\n---\n\n## Conclusión: exportar correctamente es tu seguro fiscal\n\nExportar correctamente tu historial completo de Binance no es solo un requisito burocrático: es tu mejor protección ante posibles requerimientos de Hacienda y la base fundamental para una [declaración fiscal correcta](/blog/errores-declarar-criptomonedas) que minimice tu carga tributaria dentro del marco legal.\n\n### Puntos clave a recordar\n\n- ✅ **Exporta TODO:** No solo trades, también conversiones, staking, earn, distribuciones\n- ✅ **Período completo:** Desde tu primera operación hasta hoy, sin gaps\n- ✅ **Múltiples tipos de archivos:** Transaction History, Trade History, Convert, Earn, etc.\n- ✅ **Límite de 3 meses:** Divide exportaciones largas en trimestres\n- ✅ **Conversión a EUR:** Necesaria para declaración española\n- ✅ **Método FIFO obligatorio:** Primeras compras son primeras ventas\n- ✅ **Conserva evidencias:** CSV originales + capturas + emails de confirmación\n- ✅ **Verifica coherencia:** Saldos finales deben coincidir con realidad\n- ✅ **Considera herramientas especializadas:** Koinly, CryptoTax ahorran mucho tiempo\n- ✅ **Documentación de respaldo:** Guarda todo durante 4-6 años\n\n### Tu próximo paso\n\nSi has exportado todos tus datos de Binance pero te sientes abrumado con el procesamiento, el cálculo de FIFO, las conversiones a EUR y la preparación de tu declaración fiscal, no estás solo.\n\nEn Cleriontax somos expertos en fiscalidad de criptomonedas y procesamiento de datos de exchanges. Nuestro [servicio de análisis y procesamiento de datos](/servicios) te permite enviar tus archivos CSV y recibir un informe fiscal completo, verificado y listo para tu declaración.\n\n**Nuestros servicios incluyen:**\n\n- Procesamiento completo de tus exportaciones CSV de Binance\n- Conversión automática de todas las operaciones a EUR con cotizaciones históricas verificadas\n- Aplicación correcta del método FIFO según normativa española\n- Identificación y clasificación fiscal de cada tipo de operación\n- Cálculo exacto de ganancias patrimoniales y rendimientos\n- Generación de informe fiscal completo listo para modelo 100\n- Preparación de modelo 721 (criptomonedas en el extranjero) si aplica\n- Revisión y validación de integridad de datos\n- Soporte ante requerimientos de la AEAT\n- Integración con otros exchanges si has operado en múltiples plataformas\n\n¿Tienes miles de operaciones? Nuestras herramientas especializadas y metodologías de ingeniería de datos procesan grandes volúmenes de transacciones con precisión y eficiencia.\n\n¿No estás seguro de haber exportado todo correctamente? Revisaremos tu exportación, identificaremos posibles inconsistencias y te ayudaremos a completar los datos faltantes.\n\n[Solicita tu análisis de datos de Binance](/contacto)\n\nCumple con Hacienda sin estrés. Deja que los expertos procesen tus datos de Binance.\n\n---\n\n**Descargo de responsabilidad:** Este artículo tiene finalidad informativa y educativa exclusivamente. No constituye asesoramiento fiscal personalizado. La normativa fiscal está sujeta a cambios y cada situación personal es única. Consulta siempre con un asesor fiscal profesional colegiado antes de tomar decisiones fiscales. Cleriontax no está afiliado con Binance.\n\n---\n\n*Última actualización: Noviembre 2025*\n\n*Publicado por: Equipo Cleriontax - Expertos en Fiscalidad Crypto y Análisis de Datos*"
}
