{
  "title": "Cómo Obtener CSV de Kraken: Guía Completa para Exportar Datos Fiscales",
  "excerpt": "Guía paso a paso para exportar correctamente tu historial completo de Kraken en formato CSV. Aprende a descargar transacciones, trades, conversiones y staking para tu declaración fiscal y cumplimiento con la AEAT.",
  "content": "**Kraken** es uno de los exchanges más respetados y regulados en Europa, especialmente popular entre usuarios españoles por su soporte para pares EUR nativo (BTC/EUR, ETH/EUR) y su transparencia fiscal.\n\nSin embargo, cuando llega el momento de preparar tu **declaración de la renta** y necesitas justificar tus operaciones con criptomonedas ante la AEAT, muchos usuarios se enfrentan a la misma pregunta crítica: ¿cómo exportar correctamente todos mis datos de Kraken para fines fiscales?\n\nA diferencia de Binance, que es más complejo, Kraken ofrece un sistema de exportación de datos significativamente simplificado. Pero aún así, hay pasos específicos que debes seguir para asegurar que obtienes **toda la información fiscal relevante** sin dejar operaciones fuera.\n\nExportar tus datos de Kraken de forma incorrecta puede resultar en:\n\n- Declaraciones fiscales incompletas que sustentan sanciones de Hacienda\n- Imposibilidad de justificar operaciones y ganancias ante la AEAT\n- Cálculos incorrectos del coste de adquisición según método FIFO\n- Pérdida de recompensas de staking no declaradas\n- Falta de trazabilidad de depósitos y retiros\n\nEn esta **guía completa y actualizada para 2025**, te enseñaremos exactamente cómo exportar todos tus datos de Kraken en formato CSV, qué información contiene cada archivo, cómo interpretarla correctamente y cómo organizarla para tu **declaración fiscal precisa y completa**.\n\n---\n\n## ¿Por qué Kraken es diferente a otros exchanges?\n\n### Las ventajas fiscales de Kraken para usuarios españoles\n\nKraken presenta varias características que lo diferencian significativamente de otros exchanges para usuarios en España:\n\n**1. Pares directos en EUR:**\n\nA diferencia de Binance que usa principalmente USDT como divisor, Kraken ofrece **pares directos en euros** como BTC/EUR, ETH/EUR, ADA/EUR. Esto significa que tus operaciones se registran directamente en euros, eliminando la necesidad de conversiones adicionales y reduciendo errores de redondeo.\n\nEsta característica es crucial para la fiscalidad porque:\n- El precio se registra directamente en la moneda de declaración (EUR)\n- Reduces riesgo de desviaciones por fluctuaciones de tipo de cambio\n- Facilita la justificación ante Hacienda de los precios usados\n- Simplifica enormemente el procesamiento de datos para FIFO\n\n**2. Regulación europea y transparencia:**\n\nKraken está regulado en Europa y cumple con estándares mucho más estrictos de transparencia y reportes. La plataforma coopera activamente con autoridades fiscales europeas, incluyendo españolas.\n\nEsto tiene implicaciones fiscales directas:\n- Los datos exportados son documentalmente confiables y defensibles ante Hacienda\n- Kraken puede ser requerido por la AEAT para proporcionar información sobre usuarios españoles\n- La empresa mantiene registros detallados durante años\n- Las exportaciones están respaldadas por sistemas de auditoría internos\n\n**3. Historial de operaciones permanente:**\n\nUnlike algunos exchanges que eliminan historiales después de cierto tiempo, Kraken mantiene registros permanentes de todas tus operaciones desde el registro de tu cuenta. Esto significa que incluso si hiciste trading hace 5 años, aún puedes exportar esa información.\n\n### Obligaciones fiscales específicas con Kraken en España\n\nComo usuario de Kraken en España, debes cumplir con obligaciones fiscales similares a las de otros exchanges, pero con algunas particularidades derivadas de la naturaleza de la plataforma:\n\n**Ganancias patrimoniales por trading:**\n\nCada operación de compra-venta en Kraken genera una ganancia o pérdida patrimonial sujeta a tributación. Como Kraken ofrece pares EUR directos, tienes una ventaja: los precios están ya en la moneda de declaración.\n\nEstas ganancias tributan en la **base del ahorro con tipos del 19%, 21%, 23% y 27%** según el volumen total de ganancias patrimoniales del ejercicio. Si obtuviste ganancias en Kraken durante 2024, debes declararlas en tu [modelo 100 mediante el cálculo correcto del método FIFO](/blog/como-declarar-criptomonedas-renta-2025).\n\n**Rendimientos de staking:**\n\nKraken ofrece programas de staking para Ethereum, Cardano, Polkadot y otras prueba de participación. Cada recompensa recibida constituye un **rendimiento del capital mobiliario** que debe declararse como ingreso en el año en que se recibe.\n\nLos rendimientos de staking se declaran en la **base del ahorro** (aunque con un tratamiento específico como rendimientos). Deben valorarse al precio de la criptomoneda el día exacto de recepción.\n\n**Obligación del modelo 721:**\n\nSi el saldo total de tus criptomonedas en Kraken (y otros exchanges) supera los **50.000€ a 31 de diciembre**, estás obligado a presentar el [modelo 721 de declaración de criptoactivos en el extranjero](/blog/modelo-721-criptomonedas).\n\nLa sanción por no presentar el modelo 721 es muy grave: **1.500€ mínimo y hasta el 150% del valor no declarado**. Por eso es fundamental que al exportar tus datos de Kraken, también captures el saldo final en euros a cierre del año fiscal.\n\n**Cumplimiento con la Directiva DAC8:**\n\nKraken, como exchange europeo regulado, está obligado a comunicar información sobre usuarios a las autoridades fiscales según la [Directiva DAC8](/blog/directiva-dac8-criptomonedas-exchanges-hacienda). Aunque esto ocurre sin tu intervención, es importante que seas consciente de que tus operaciones pueden ser reportadas automáticamente a Hacienda.\n\n---\n\n## Tipos de datos que puedes exportar de Kraken\n\nA diferencia de Binance, Kraken agrupa los tipos de datos de una forma más simplificada. Veamos qué puedes exportar y cuándo necesitas cada tipo:\n\n### 1. Historial de trades (Spot Trading)\n\nEl historial de trades incluye todas las órdenes que has ejecutado en el mercado spot de Kraken: compras, ventas e intercambios.\n\nCada operación registra:\n- **Fecha y hora exacta (UTC):**\n- **Par negociado:** BTC/EUR, ETH/EUR, ADA/USD, etc.\n- **Tipo de orden:** Market, Limit, Stop-Loss\n- **Lado de la operación:** Buy (compra) o Sell (venta)\n- **Precio unitario:**\n- **Cantidad ejecutada:**\n- **Comisión pagada:**\n- **Valor total en la moneda de referencia:**\n\n**Importancia fiscal:**\nEste es el archivo más crítico para tu declaración. Cada línea representa un evento fiscal (ganancia o pérdida patrimonial) que debe incluirse en tu cálculo de FIFO.\n\n### 2. Historial de depósitos y retiros (Funding)\n\nEste archivo incluye todos los movimientos de fondos dentro y fuera de tu cuenta Kraken:\n\n**Depósitos (Inbound):**\n- Transferencias bancarias EUR que has depositado\n- Depósitos de criptomonedas desde otras wallets\n- Ingresos por comisiones o referidos\n\n**Retiros (Outbound):**\n- Transferencias a tu cuenta bancaria\n- Envíos de criptomonedas a otras wallets o exchanges\n- Conversiones de dust (residuos) que no constan en el historial de trades\n\n**Importancia fiscal:**\nEs fundamental para documentar la trazabilidad de tus fondos y demostrar el origen de tu capital. Si Hacienda te requiere, este historial es tu evidencia de dónde vino el dinero con el que compraste criptomonedas.\n\n### 3. Historial de conversiones y intercambios (Conversion)\n\nKraken permite convertir instantáneamente entre criptomonedas, similar a la función Convert de Binance. Este archivo registra:\n\n- Criptomoneda origen y cantidad convertida\n- Criptomoneda destino y cantidad recibida\n- Fecha y hora exacta\n- Tarifa o diferencial de conversión\n\n**Importancia fiscal:**\nCada conversión entre criptomonedas constituye una **permuta** (intercambio de bienes), que es un evento fiscal que genera ganancia o pérdida patrimonial según la [clasificación correcta de operaciones](/blog/clasificar-operaciones-criptomonedas).\n\nEste es un error común: muchos usuarios no exportan conversiones pensando que no son operaciones \"reales\". Sin embargo, desde la perspectiva fiscal, una conversión de BTC a ETH es tan importante como una venta de BTC a EUR.\n\n### 4. Historial de staking (Rewards y Staking)\n\nSi has participado en staking de prueba de participación en Kraken, puedes exportar:\n\n- Cada recompensa de staking recibida\n- Fecha exacta de recepción\n- Cantidad recibida\n- Precio de mercado en ese momento (aunque necesitarás buscarlo por separado)\n\n**Importancia fiscal:**\nCada recompensa de staking es un ingreso fiscal que debe declararse como rendimiento del capital mobiliario. La AEAT requiere que demuestres cuándo recibiste cada recompensa y a qué precio de mercado.\n\n### 5. Historial de comisiones (Fees)\n\nKraken permite ver un desglose detallado de todas las comisiones pagadas, agrupadas por:\n- Tipo de comisión (trading fee, withdrawal fee, etc.)\n- Moneda pagada\n- Período de tiempo\n\n**Importancia fiscal:**\nLas comisiones son gastos deducibles que reducen tu base imponible. Es importante documentarlas correctamente, especialmente si pagas comisiones en criptomonedas (por ejemplo, si pagaste una comisión en BTC, esa cantidad debe deducirse del valor de la ganancia patrimonial).\n\n### 6. Resumen de saldos (Holdings)\n\nKraken permite exportar un resumen de tus tenencias (holdings) actuales o en una fecha específica:\n\n- Cada criptomoneda\n- Cantidad total\n- Precio de mercado actual o en la fecha seleccionada\n- Valor total en EUR\n\n**Importancia fiscal:**\nEste archivo es crucial para calcular si necesitas presentar el modelo 721 (límite de 50.000€). Debes exportar tus saldos específicamente a **31 de diciembre del año fiscal** que declares.\n\n---\n\n## Guía paso a paso: Exportar datos de Kraken\n\nAhora vamos a ver exactamente cómo exportar cada tipo de dato desde tu cuenta de Kraken.\n\n### Requisitos previos\n\nAntes de comenzar a exportar, asegúrate de tener:\n\n- ✅ Acceso a tu cuenta de Kraken verificada\n- ✅ Verificación de identidad (KYC) completada al máximo nivel\n- ✅ Autenticación de dos factores (2FA) activada por seguridad\n- ✅ Permisos de visualización de historial habilitados\n- ✅ Conexión estable a Internet\n- ✅ Espacio en disco para guardar múltiples archivos CSV\n- ✅ Navegador web actualizado (Chrome, Firefox, Safari, Edge)\n\n### Paso 1: Acceder a tu historial de datos\n\n1. Inicia sesión en tu cuenta de Kraken (www.kraken.com)\n2. En la esquina superior derecha, haz clic en tu nombre o icono de perfil\n3. Selecciona \"Settings\" (Configuración)\n4. En el menú lateral, busca \"Manage Data\" o \"Data Export\"\n5. Si no lo ves inmediatamente, puede estar bajo \"Security\" o \"Privacy\"\n\n**Nota:** Kraken ha reorganizado este menú varias veces en 2024-2025. Si no encuentras estas opciones, busca \"Account Statement\" en lugar de \"Data Export\".\n\n### Paso 2: Exportar historial de trades (Spot Trading)\n\nEsta es la exportación más importante para calcular tus ganancias patrimoniales.\n\n**Ubicación:**\n1. Ve a \"Settings\" → \"Manage Data\" → \"Export Data\"\n2. Selecciona \"Trades\"\n3. Elige el período de tiempo deseado (puedes exportar años completos o períodos específicos)\n4. Selecciona el formato: **CSV** (no JSON)\n5. Haz clic en \"Generate Export\"\n\n**Opciones de período:**\n- Kraken te permite exportar en bloques de hasta 1 año\n- Si has operado durante múltiples años, realiza exportaciones separadas para cada año fiscal (2024, 2023, 2022, etc.)\n\n**Lo que recibirás:**\n\nUn archivo CSV con columnas como:\n```\ntxid,refid,time,type,ordertype,pair,amount,price,cost,fee,volume,margin,misc\n1234567,TRAD1234,2024-01-15T14:32:00Z,buy,limit,XBTEUR,0.05,42500.00,2125.00,6.38,0.05,0,\n```\n\nExplicación de las columnas:\n- **txid:** ID único de la transacción\n- **refid:** ID de referencia de la orden\n- **time:** Fecha y hora en UTC\n- **type:** \"buy\" (compra) o \"sell\" (venta)\n- **ordertype:** Tipo de orden (limit, market, stop-loss, etc.)\n- **pair:** Par de trading (XBTEUR, ETHEUR, etc.)\n- **amount:** Cantidad de la criptomoneda operada\n- **price:** Precio unitario\n- **cost:** Costo total (cantidad × precio)\n- **fee:** Comisión pagada\n- **volume:** Volumen (igual a cost en la mayoría de casos)\n- **margin:** Indicación si fue operación con apalancamiento\n\n### Paso 3: Exportar historial de depósitos y retiros (Funding)\n\nEste archivo documenta toda la trazabilidad de fondos entrantes y salientes.\n\n**Ubicación:**\n1. Ve a \"Settings\" → \"Manage Data\" → \"Export Data\"\n2. Selecciona \"Ledger\" (no \"Trades\")\n3. Opcionalmente filtra por:\n   - **Asset:** Puedes exportar todas las monedas o solo criptomonedas específicas\n   - **Type:** Filtra por \"deposit\" o \"withdrawal\"\n4. Selecciona el período deseado (1 año máximo por exportación)\n5. Formato: **CSV**\n6. Haz clic en \"Generate Export\"\n\n**Lo que recibirás:**\n\nUn archivo CSV detallado con cada movimiento:\n```\nrefid,time,type,subtype,aclass,asset,amount,balance,fee,description\nDEP12345,2024-01-10T09:15:00Z,deposit,,,ZEUR,5000.00,5000.00,0.00,EUR Deposit\nWIT67890,2024-01-20T11:30:00Z,withdrawal,,,XXBT,0.5,0.0,0.0005,BTC Withdrawal\n```\n\n**Columnas importantes:**\n- **refid:** ID único del movimiento\n- **time:** Fecha y hora en UTC\n- **type:** \"deposit\" o \"withdrawal\" principalmente\n- **asset:** Moneda (ZEUR para euros, XXBT para Bitcoin, XETH para Ethereum)\n- **amount:** Cantidad depositada o retirada\n- **balance:** Saldo después de la operación\n- **fee:** Comisión de retirada (normalmente 0 para depósitos)\n\n> **Nota importante:** En Kraken, las criptomonedas usan códigos especiales. XXBT = BTC, ZEUR = EUR, XETH = ETH, XADA = ADA. Necesitarás conocer estos códigos para procesar correctamente los datos.\n\n### Paso 4: Exportar historial de conversiones (Conversion History)\n\nMuchos usuarios olvidan exportar conversiones porque no aparecen en el historial de trades regular. Esto es un error fiscal grave.\n\n**Ubicación:**\n1. Ve a \"Settings\" → \"Manage Data\" → \"Export Data\"\n2. Busca \"Convert\" o \"Conversion History\"\n3. Si no lo ves en Export Data, ve a \"Funding\" y busca transacciones de tipo \"convert\"\n4. Alternativamente, en el ledger general, filtra por transactions con descripción \"convert\" o \"conversion\"\n\n**Si no encuentras una opción directa:**\n\nLa opción de exportación de conversiones puede no estar disponible en tu versión de Kraken. En ese caso:\n\n1. Ve a tu \"Account Activity\" o \"Funding History\"\n2. Filtra manualmente por conversiones (búsqueda por \"convert\")\n3. Toma capturas de pantalla o copia manualmente cada conversión\n4. Crea tu propio CSV con fechas, cantidades y pares convertidos\n\n### Paso 5: Exportar historial de staking y recompensas (Rewards)\n\nSi has participado en staking, este es un archivo crítico que no debes olvidar.\n\n**Ubicación:**\n1. Ve a \"Settings\" → \"Manage Data\" → \"Export Data\"\n2. Selecciona \"Rewards\" o \"Staking History\"\n3. Selecciona el período (puedes exportar varios años)\n4. Formato: **CSV**\n5. Genera la exportación\n\n**Lo que recibirá:**\n```\ndate,asset,amount,reward_type\n2024-01-15,XETH,0.00523,ethereum2.s\n2024-01-22,XETH,0.00518,ethereum2.s\n```\n\n**Importante:** El precio de mercado de la recompensa NO está incluido en el CSV de Kraken. Deberás obtener el precio del día de cada recompensa por separado usando:\n- CoinGecko (API histórica)\n- CoinMarketCap\n- El propio historial de precios de Kraken\n\n### Paso 6: Exportar saldos a fecha específica (31 de diciembre)\n\nPara determinar si debes presentar modelo 721, necesitas tu saldo total a 31 de diciembre en euros.\n\n**Ubicación:**\n1. Ve a tu \"Funding\" o \"Spot Wallet\"\n2. En la página de saldos, toma una captura de pantalla mostrando:\n   - Cada criptomoneda que posees\n   - La cantidad exacta\n   - El valor en EUR (si Kraken lo muestra) o el precio EUR actual\n3. Anota la fecha de esta captura (31 de diciembre ideal, o la fecha más próxima disponible)\n4. Guarda como evidencia\n\nAlternativamente:\n1. Ve a \"Settings\" → \"Account Statement\"\n2. Genera un extracto de cuenta para el período que incluya 31 de diciembre\n3. Este extracto incluirá un resumen de saldos finales\n\n---\n\n## Cómo interpretar los datos exportados de Kraken\n\nUna vez descargados los archivos CSV, es importante entender exactamente qué significan los datos y cómo procesarlos para tu declaración fiscal.\n\n### Códigos de criptomonedas en Kraken\n\nKraken usa códigos especiales para criptomonedas en sus exportaciones. Estos son los más comunes:\n\n| Código | Moneda | Código | Moneda |\n|--------|--------|--------|--------|\n| XXBT | Bitcoin | XETH | Ethereum |\n| XADA | Cardano | XDOT | Polkadot |\n| XLTC | Litecoin | XXMR | Monero |\n| ZEUR | Euros | ZUSD | Dólares US |\n| ZGBP | Libras | ZJPY | Yenes |\n\n**Importante:** Al procesar tus datos, reemplaza estos códigos por los nombres estándar (BTC, ETH, etc.) para evitar confusiones.\n\n### Interpretación de operaciones de compra y venta\n\n**Compra (BUY):**\n```\ntime: 2024-03-15T14:30:00Z\ntype: buy\npair: XBTEUR\namount: 0.05 BTC\nprice: 52000.00 EUR\ncost: 2600.00 EUR\nfee: 5.20 EUR\n```\n\nInterpretación fiscal:\n- **15 de marzo de 2024** (a las 14:30 UTC)\n- Compraste **0.05 BTC**\n- A un precio unitario de **52.000€**\n- Pagaste **2.600€** total (sin contar comisión)\n- Comisión: **5,20€**\n- **Coste total de adquisición:** 2.600€ + 5,20€ = 2.605,20€\n- Coste por BTC: 52.104€\n\nEsta información se usa para construir tu registro de compras para el método FIFO.\n\n**Venta (SELL):**\n```\ntime: 2024-06-20T10:15:00Z\ntype: sell\npair: XBTEUR\namount: 0.05 BTC\nprice: 58000.00 EUR\ncost: 2900.00 EUR\nfee: 5.80 EUR\n```\n\nInterpretación fiscal:\n- **20 de junio de 2024** (a las 10:15 UTC)\n- Vendiste **0.05 BTC**\n- A un precio unitario de **58.000€**\n- Recibiste **2.900€** (menos comisión)\n- Comisión: **5,80€**\n- **Ingresos netos:** 2.900€ - 5,80€ = 2.894,20€\n\nSiguiendo el método FIFO:\n- Coste de adquisición (compra del 15 de marzo): 2.605,20€\n- Precio de venta (venta del 20 de junio): 2.900€\n- **Ganancia patrimonial bruta:** 2.900€ - 2.605,20€ = **294,80€**\n- **IRPF a pagar (19%):** 55,93€\n\n### Manejo de las fechas UTC\n\nTodos los datos de Kraken se exportan en **UTC (Coordinated Universal Time)**, pero España está en:\n- **Horario de invierno:** UTC + 1\n- **Horario de verano:** UTC + 2\n\nEsto es especialmente importante para operaciones justo antes o después de cambios de horario.\n\n**Ejemplo problema:**\n- Operación en Kraken: 2024-12-31 23:45:00 UTC\n- Hora en España (invierno): 2025-01-01 00:45:00\n- **Año fiscal:** 2025, no 2024\n\nDebes convertir cada fecha UTC a hora central europea para determinar el año fiscal correcto.\n\n### Identificación de eventos fiscales\n\n**Eventos que GENERAN tributación:**\n- ✅ BUY seguido de SELL (compra y venta genera ganancia/pérdida)\n- ✅ Conversión de crypto a EUR (venta)\n- ✅ Conversión crypto-to-crypto (permuta, es una ganancia/pérdida patrimonial)\n- ✅ Venta a pérdida (pérdida patrimonial que compensa ganancias)\n- ✅ Recompensas de staking (rendimiento del capital)\n\n**Eventos que NO generan tributación inmediata:**\n- ❌ Compra de criptomoneda (solo se registra el coste de adquisición)\n- ❌ Depósito a tu cuenta Kraken (no es ingreso fiscal)\n- ❌ Retiro de criptomoneda a otra wallet (no genera ganancia)\n- ❌ Transferencia entre tus propias wallets en Kraken\n\n### Problemas comunes con datos de Kraken\n\n**Problema 1: Separadores decimales**\nKraken usa punto (.) como separador decimal (formato inglés), pero Excel en español usa coma (,). Al abrir el CSV:\n- Haz clic derecho → Propiedades del archivo\n- Selecciona \"Encoding\" → Unicode (UTF-8)\n- En Excel: Datos → Obtener datos → De archivo de texto\n- Especifica \"Separador de decimales: punto\"\n\n**Problema 2: Cantidades muy pequeñas**\nAlgunas operaciones pueden mostrar cantidades muy pequeñas (ej. 0.00001234 BTC). Asegúrate de que tu software de cálculo mantenga toda la precisión sin redondear.\n\n**Problema 3: Operaciones con apalancamiento**\nSi has hecho margin trading o futures en Kraken, estas operaciones pueden tener un tratamiento fiscal diferente al spot. El campo \"margin\" del CSV te indicará si fue apalancado.\n\n---\n\n## Errores críticos al exportar datos de Kraken (y cómo evitarlos)\n\n### Error 1: No exportar conversiones de crypto-to-crypto\n\nEste es el error más común. Muchos usuarios olvidan que Kraken registra conversiones instantáneas entre criptomonedas en un lugar diferente del historial de trades.\n\nConvertir 1 BTC a 16 ETH es fiscalmente una **permuta** (intercambio de bienes) que genera una ganancia o pérdida patrimonial. No declararla es:\n- Incompleto (omisión de ingresos)\n- Sancionable por la AEAT\n- Pasible de intereses de demora\n\n**Solución:**\n- Busca activamente el historial de \"Conversions\" en Kraken\n- Si no encuentras un CSV directo, copia manualmente cada conversión\n- Valora cada conversión al precio EUR de ese momento\n- Incluye todas las conversiones en tu cálculo FIFO\n\n### Error 2: Olvidar incluir recompensas de staking\n\nSi has participado en Kraken Staking (especialmente ETH 2.0), cada recompensa recibida es un ingreso fiscal.\n\nOlvidar declararlas es particularmente grave porque:\n- La AEAT puede cruzar datos con Kraken\n- Las recompensas están registradas con fecha exacta\n- Su omisión es fácil de detectar en una auditoría\n\n**Solución:**\n- Exporta específicamente \"Rewards\"\n- Para cada recompensa, busca el precio EUR de la criptomoneda en ese día exacto\n- Declara cada recompensa como rendimiento del capital en el año fiscal correspondiente\n\n### Error 3: No convertir correctamente a euros\n\nAlgunos datos de Kraken pueden estar en USD (ZUSD) o GBP (ZGBP) en lugar de EUR, especialmente si operaste con esos pares.\n\nNo convertir correctamente a EUR resulta en:\n- Valores declarados incorrectos\n- Posibles sanciones por error manifiesto\n- Desalineación con la información que Kraken proporciona a Hacienda\n\n**Solución:**\n- Para pares USD: busca el tipo de cambio USD/EUR del día exacto\n- Fuente: Banco Central Europeo, CoinGecko, Kraken histórico\n- Ejemplo: Venta de 1 ETH a 1.500 USD el 15/03/2024\n  - Tipo USD/EUR del 15/03: 0.92\n  - Precio EUR: 1.500 × 0.92 = 1.380€\n\n### Error 4: Usar fechas sin convertir de UTC\n\nNo convertir las fechas UTC a hora local española puede resultar en asignar operaciones al año fiscal incorrecto.\n\n**Solución:**\n- Convierte manualmente o con Excel: `Fecha_UTC + 1 hora (invierno) + 2 horas (verano)`\n- Usa la función TIMEVALUE en Excel para conversión automática\n- Para operaciones cercanas a 31 de diciembre, especialmente importantes\n\n### Error 5: Pérdida de datos de comisiones\n\nAlgunas comisiones en Kraken pueden pagarse en diferentes monedas. Si no las registras correctamente, reduces injustificadamente la base imponible.\n\n**Solución:**\n- Cada comisión reduce la ganancia patrimonial (si está en EUR)\n- Si la comisión está en criptomonedas, debe valorarse al precio de ese día\n- Usa el archivo \"Ledger\" completo para auditar todas las comisiones\n\n### Error 6: No verificar coherencia de saldos\n\nKraken puede tener errores ocasionales o tú mismo podrías tener datos incompletos. Verificar la coherencia te protege.\n\n**Solución:**\n- Suma todos tus depósitos de BTC\n- Resta todos tus retiros de BTC\n- Suma/resta operaciones de compra-venta\n- Compara el resultado con tu saldo actual en Kraken\n- Si no coincide, investiga qué falta\n\n---\n\n## Cómo organizar y procesar los datos exportados\n\nUna vez descargados todos los archivos CSV, necesitas organizarlos sistemáticamente para poder procesarlos correctamente.\n\n### Estructura de carpetas recomendada\n\nOrganiza tus archivos Kraken de forma clara y profesional:\n\n```\n📁 Kraken_Fiscal_2024/\n├── 📁 1_Exportaciones_Originales/\n│   ├── 📄 Kraken_Trades_2024.csv\n│   ├── 📄 Kraken_Trades_2023.csv\n│   ├── 📄 Kraken_Ledger_2024.csv\n│   ├── 📄 Kraken_Conversions_2024.csv\n│   ├── 📄 Kraken_Rewards_2024.csv\n│   └── 📄 Kraken_Holdings_2024-12-31.csv\n├── 📁 2_Datos_Procesados/\n│   ├── 📄 Consolidado_Todos_Trades.xlsx\n│   ├── 📄 FIFO_Calculos.xlsx\n│   └── 📄 Convertido_a_EUR.xlsx\n├── 📁 3_Evidencias/\n│   ├── 📄 Captura_proceso_exportacion.png\n│   ├── 📄 Email_confirmacion_Kraken.pdf\n│   └── 📄 Nota_cotizaciones_usadas.txt\n└── 📁 4_Informe_Final/\n    └── 📄 Resumen_Fiscal_Kraken_2024.xlsx\n```\n\nEsta estructura te permite:\n- Guardar evidencias de dónde provienen los datos\n- Mantener datos originales sin modificar\n- Documentar tu proceso de procesamiento\n- Facilitar auditorías si Hacienda requiere\n\n### Consolidación y limpieza de datos\n\nSi has exportado múltiples archivos (varios años de trades, por ejemplo), necesitas consolidarlos:\n\n**Paso 1: Combinar múltiples archivos del mismo tipo**\n1. Abre el archivo más antiguo en Excel\n2. Copia todas las filas (sin encabezados) de los archivos más recientes\n3. Pégalas al final del primero\n4. Ordena por fecha (columna \"time\")\n5. Verifica que no haya duplicados\n\n**Paso 2: Verificar coherencia de datos**\n- ✅ Todas las fechas están en formato consistente\n- ✅ No hay registros duplicados\n- ✅ Los saldos finales de una operación coinciden con los iniciales de la siguiente\n- ✅ No hay gaps de tiempo sin explicación\n\n**Paso 3: Añadir columnas de procesamiento**\n\nCreía columnas adicionales para procesamiento:\n- Fecha_Local (convertida de UTC)\n- Año_Fiscal (extraído de fecha local)\n- Precio_EUR (búsqueda manual o con herramientas)\n- Ganancia_Pérdida (calculado según FIFO)\n- Tipo_Operacion (clasificación fiscal)\n\n### Conversión manual de precios a EUR\n\nPara operaciones en USD o GBP, necesitas obtener cotizaciones históricas.\n\n**Método 1: CoinGecko API**\n```\nhttps://api.coingecko.com/api/v3/coins/bitcoin/history?date=15-03-2024&vs_currencies=eur\n```\nResponde con el precio EUR de BTC el 15 de marzo de 2024.\n\n**Método 2: Sitio web CoinGecko manualmente**\n1. Ve a https://www.coingecko.com/\n2. Busca la criptomoneda (ej. Bitcoin)\n3. Haz clic en \"Historical Data\"\n4. Busca la fecha específica\n5. Copia el precio EUR\n\n**Método 3: Datos de Kraken históricos**\n1. Ve a la página de charts de Kraken\n2. Busca el par EUR (ej. BTC/EUR)\n3. Configura la fecha\n4. Lee el precio\n\n### Cálculo de ganancias patrimoniales con método FIFO\n\nEste es el paso más crítico y donde muchos usuarios cometen errores graves.\n\n**Ejemplo completo:**\n\n**Historial de compras:**\n1. 10 enero 2024: Compras 0.3 BTC a 40.000€ = 12.000€\n2. 15 febrero 2024: Compras 0.5 BTC a 45.000€ = 22.500€\n3. 20 marzo 2024: Compras 0.2 BTC a 50.000€ = 10.000€\n\n**Historial de ventas:**\n4. 1 junio 2024: Vendes 0.7 BTC a 52.000€ = 36.400€\n\n**Cálculo FIFO (primeras compras = primeras ventas):**\n\n- Vendes primero los 0.3 BTC del 10/01 (coste: 12.000€)\n- Vendes luego 0.4 BTC de los 0.5 del 15/02 (coste: 22.500€ × 0.4/0.5 = 18.000€)\n- **Coste total adquisición:** 12.000€ + 18.000€ = 30.000€\n- **Ingreso venta:** 36.400€\n- **Ganancia patrimonial:** 36.400€ - 30.000€ = **6.400€**\n- **IRPF (19%):** 1.216€\n\n**Saldo restante en cartera:**\n- 0.1 BTC de la compra del 15/02 (coste: 4.500€)\n- 0.2 BTC de la compra del 20/03 (coste: 10.000€)\n- Total: 0.3 BTC con coste acumulado de 14.500€\n\nEste registro es imprescindible para operaciones futuras.\n\n### Herramientas para automatizar el procesamiento\n\nSi tienes muchas operaciones, procesar manualmente es impracticable. Estas herramientas especializadas pueden ayudarte:\n\n**Herramientas fiscales integradas:**\n\n1. **Koinly** (https://koinly.io/)\n   - Importación directa desde Kraken (vinculación automática)\n   - Soporte para múltiples exchanges y wallets\n   - Cálculo automático de FIFO según normativa española\n   - Generación de informes para modelo 100\n   - Desde 49€/año\n\n2. **CryptoTax** (https://www.cryptotax.io/)\n   - Especializado en fiscalidad española\n   - Importación CSV de Kraken\n   - Cálculo de modelos 100, 721, 714\n\n3. **Accointing** o **CoinTracking**\n   - Integración con Kraken\n   - Generación de reportes fiscales\n\n**Ventajas claras:**\n- ✅ Automatización completa de conversión EUR\n- ✅ Aplicación correcta de FIFO sin errores\n- ✅ Manejo de múltiples exchanges simultáneamente\n- ✅ Generación de reportes listos para presentación\n- ✅ Ahorro de docenas de horas de trabajo manual\n\n**Desventajas:**\n- ❌ Coste inicial (aunque inferior a un asesor fiscal)\n- ❌ Necesitas tiempo para aprender la herramienta\n- ❌ Debes verificar resultados (no confíes ciegamente)\n\nEn Cleriontax ofrecemos [análisis completo de datos de Kraken](/servicios/analisis-carteras) con procesamiento automatizado, verificación manual y generación de informes listos para Hacienda. Si prefieres no procesar manualmente, podemos hacerlo por ti.\n\n---\n\n## Verificación de integridad y completitud\n\nAntes de usar tus datos para la declaración fiscal, debes verificar que están completos y son coherentes.\n\n### Checklist de verificación\n\n**Verificación 1: ¿He exportado TODO?**\n\n- ✅ Trades de todos los años que he operado en Kraken\n- ✅ Depósitos y retiros (Ledger) completos\n- ✅ Conversiones crypto-to-crypto\n- ✅ Recompensas de staking (si participé)\n- ✅ Saldos a 31 de diciembre para cálculo de modelo 721\n- ✅ Datos de comisiones\n\n**Verificación 2: ¿Son coherentes los saldos?**\n\nPrueba manual para cada criptomoneda principal:\n\n```\nSaldo BTC verificado:\nDepósitos BTC (del Ledger): +1.5\nRetiros BTC (del Ledger): -0.3\nCompras BTC (de Trades buy): +0.8\nVentas BTC (de Trades sell): -0.9\nSaldo calculado: 1.1 BTC\nSaldo actual en Kraken: 1.1 BTC ✅\n```\n\nSi no coincide:\n- Falta exportar conversiones\n- Faltan transacciones de staking\n- Hay comisiones en BTC no contabilizadas\n- Hay transferencias entre tus propias wallets internas\n\n**Verificación 3: ¿Están todas las fechas correctas?**\n\n- ✅ Fechas en orden cronológico\n- ✅ No hay duplicados\n- ✅ No hay gaps temporales grandes sin explicación\n- ✅ Fechas convertidas correctamente de UTC a hora local\n\n**Verificación 4: ¿Están correctamente valoradas?**\n\n- ✅ Todos los precios en EUR (o convertidos a EUR con tipo de cambio documentado)\n- ✅ Comisiones incluidas en coste de adquisición\n- ✅ Cantidades en BTC, ETH, etc. mantienen toda la precisión decimal\n\n### Documentación de fuentes para auditoría\n\nSi Hacienda requiere, debes poder justificar:\n\n**1. Origen de las cotizaciones**\n\nCrea un documento con notas del tipo:\n```\nOperación: Venta 0.05 BTC el 15/03/2024\nPrecio usado: 52.000€\nFuente: Kraken histórico - gráfico BTC/EUR\nCaptura: kraken_btc_eur_15_03_2024.png\n\nOperación: Venta 1 ETH el 20/05/2024 a 1.500 USD\nTipo USD/EUR: 0.92 (fecha 20/05/2024)\nFuente: Banco Central Europeo\nPrecio EUR: 1.500 × 0.92 = 1.380€\n```\n\n**2. Proceso de exportación**\n\nGuarda capturas de pantalla del proceso:\n- Acceso a \"Settings\" → \"Manage Data\"\n- Selección de tipo de dato (Trades, Ledger, etc.)\n- Generación de exportación\n- Email de confirmación de Kraken\n\n**3. Integridad de archivos**\n\nGuarda una copia sin modificar de los CSV originales (carpeta \"1_Exportaciones_Originales\"). Nunca edites los originales.\n\n---\n\n## Casos especiales y situaciones complejas\n\n### ¿Qué hacer si no puedo acceder a mi cuenta Kraken antigua?\n\nSi cerraste tu cuenta o perdiste acceso y necesitas datos antiguos:\n\n**Opción 1: Contacta con Kraken Support**\n1. Ve a https://support.kraken.com\n2. Abre un ticket solicitando exportación de datos históricos\n3. Proporciona información de verificación\n4. El proceso puede tardar 2-4 semanas\n\n**Opción 2: Reconstrucción manual**\n1. Usa tus extractos bancarios para depósitos/retiros fiat\n2. Usa block explorers (Etherscan, BscScan) para movimientos crypto\n3. Estima operaciones basándote en tu memoria\n4. Documenta que hay información faltante pero que hiciste diligencia\n\n### ¿Qué pasa si exporté algunos datos pero no completamente?\n\nSi exportaste solo 2024 pero has operado desde 2021:\n\n**Problema:** No podrás calcular correctamente el método FIFO porque desconoces el coste de adquisición de criptomonedas compradas antes de 2024.\n\n**Solución:**\n1. Intenta exportar datos de años anteriores desde Kraken\n2. Si Kraken no tiene datos (cuenta cerrada), reconstruye con blockchain\n3. Documenta en tu declaración \"Datos incompletos de año X debido a imposibilidad de acceso\"\n4. Consulta con un asesor fiscal sobre cómo proceder\n\n### ¿Qué hacer con staking compuesto?\n\nSi has hecho staking durante varios años y tus recompensas se reinvirtieron automáticamente:\n\nCada recompensa recibida es un evento fiscal separado con su propia fecha y precio.\n\n**Ejemplo:**\n- 1 enero 2024: Recibes 0.05 ETH de staking (valor: 100€)\n- 8 enero 2024: Recibes 0.05 ETH de staking compuesto (valor: 103€)\n- Enero a diciembre 2024: 50+ eventos separados de staking\n\nDebes declararlos TODOS, no solo el total anual.\n\n### ¿Operé con apalancamiento (margin) en Kraken?\n\nLas operaciones con apalancamiento pueden tener un tratamiento fiscal especial.\n\n**Consideraciones:**\n- Las ganancias/pérdidas de margin tributan como ganancias patrimoniales\n- Los intereses pagados por el préstamo del apalancamiento son gastos deducibles\n- Las posiciones liquidadas pueden tener implicaciones legales además de fiscales\n\nSi tienes operaciones con margin, consulta con un asesor fiscal especializado.\n\n---\n\n## Preparación del informe fiscal final\n\nUna vez que has exportado, procesado y verificado todos tus datos de Kraken, el paso final es preparar un documento consolidado.\n\n### Resumen consolidado recomendado\n\nCrea un informe en Excel o PDF que contenga:\n\n**1. Portada y resumen ejecutivo:**\n- Período fiscal cubierto (01/01/2024 - 31/12/2024)\n- Nombre de usuario Kraken y NIF del titular\n- Fecha de generación del informe\n- Total de operaciones procesadas\n\n**2. Resumen de resultados:**\n\n```\nRESULTADOS FISCALES KRAKEN 2024\n\nGanancias patrimoniales (operaciones spot): +15.250€\nPérdidas patrimoniales (compensadas): -3.100€\nGanancia patrimonial neta: +12.150€\n\nRendimientos por staking: +450€\n\nValor cartera a 31/12/2024: 47.300€\n(Bajo el umbral de 50.000€ para modelo 721)\n\nIRPF estimado a pagar: 2.309€\n(19% sobre ganancias patrimoniales)\n```\n\n**3. Detalle de operaciones (muestra):**\n\n| Fecha | Tipo | Par | Cantidad | Precio | Ganancia/Pérdida EUR |\n|-------|------|-----|----------|--------|---------------------|\n| 15/03 | SELL | BTC/EUR | 0.05 | 52.000€ | +294€ |\n| 20/05 | BUY | ETH/EUR | 2 | 2.100€ | - |\n| ... | ... | ... | ... | ... | ... |\n\n**4. Detalle de recompensas de staking:**\n\n| Fecha | Activo | Cantidad | Precio_EUR | Valor_EUR |\n|-------|--------|----------|------------|----------|\n| 10/01 | ETH | 0.0052 | 2.100€ | 10.92€ |\n| ... | ... | ... | ... | ... |\n\n**5. Saldos a 31/12/2024:**\n\n| Criptomoneda | Cantidad | Precio 31/12 | Valor EUR |\n|--------------|----------|--------------|----------|\n| BTC | 0.15 | 42.000€ | 6.300€ |\n| ETH | 1.5 | 2.200€ | 3.300€ |\n| ... | ... | ... | ... |\n\n**Valor total:** 47.300€\n\n**6. Declaración de cumplimiento:**\n\n\"Certifico que esta exportación y procesamiento de datos de Kraken es completo y exacto según mis registros. Los datos provienen directamente de Kraken.com mediante exportación oficial de CSV en [FECHAS]. He verificado la coherencia y completitud de los datos.\"\n\n### Documentos de respaldo a conservar\n\nGuarda durante **al menos 4 años** (mejor 6 años):\n\n- ✅ Archivos CSV originales de Kraken sin modificar\n- ✅ Capturas de pantalla del proceso de exportación\n- ✅ Emails de confirmación de Kraken\n- ✅ Hojas de cálculo con cálculos y conversiones\n- ✅ Referencias a cotizaciones históricas usadas\n- ✅ Extractos bancarios (depósitos/retiros fiat)\n- ✅ Notas sobre datos faltantes o anomalías\n\n---\n\n## Integración con herramientas de análisis fiscal\n\nMuchos usuarios prefieren usar herramientas especializadas una vez que han exportado sus datos de Kraken.\n\n### Cómo usar datos de Kraken en Koinly (recomendado)\n\n**Opción A: Conectar automáticamente (más fácil)**\n\n1. Crea cuenta en Koinly.io\n2. Ve a \"Add Exchange\"\n3. Selecciona \"Kraken\"\n4. Haz clic en \"Connect\" (autorización automática)\n5. Accede a tu cuenta Kraken cuando se solicite\n6. Koinly descargará automáticamente todos tus datos\n\n**Opción B: Importar CSV manualmente**\n\n1. En Koinly, ve a \"Manual Transactions\" o \"Import\"\n2. Selecciona el tipo de dato (Trade, Deposit, etc.)\n3. Carga tu CSV de Kraken\n4. Koinly procesará automáticamente los datos\n\n**Ventajas:**\n- Cálculo automático de FIFO\n- Generación de reportes fiscales para España\n- Conversión automática de fechas y valores\n- Generación de declaraciones para modelo 100\n\nPara una [guía completa sobre integración de herramientas fiscales](/servicios), consulta nuestros servicios especializados.\n\n---\n\n## Conclusión: Exportar datos de Kraken es más fácil que otros exchanges\n\nKraken facilita significativamente la exportación de datos fiscales en comparación con otros exchanges. Sus CSV directos en EUR y su sistema organizado hacen el proceso mucho menos complejo que con Binance.\n\n### Puntos clave para recordar\n\n- ✅ **Exporta TODO:** Trades, Ledger, Conversiones, Rewards\n- ✅ **Preserva años completos:** Desde tu primer depósito hasta hoy\n- ✅ **Convierte fechas:** UTC a hora local española\n- ✅ **Verifica saldos:** Deben coincidir con tu cartera actual\n- ✅ **Documenta fuentes:** Cotizaciones y proceso de exportación\n- ✅ **Conserva originales:** Guarda CSV sin modificar\n- ✅ **Calcula FIFO correctamente:** Primeras compras = primeras ventas\n- ✅ **Incluye comisiones:** Son gastos deducibles\n- ✅ **No olvides recompensas:** Son ingresos que deben declararse\n- ✅ **Considera herramientas:** Koinly o similar ahorran mucho tiempo\n\n### Tu siguiente paso\n\nSi has exportado tus datos de Kraken pero:\n- Te sientes abrumado con el procesamiento FIFO\n- No estás seguro de cotizaciones o conversiones\n- Necesitas generar un informe fiscal profesional\n- Quieres validación de expertos en fiscalidad crypto\n\nEn Cleriontax podemos ayudarte. Nuestro [servicio de análisis de carteras Kraken](/servicios/analisis-carteras) incluye:\n\n- Procesamiento completo de tus CSV de Kraken\n- Cálculo certero de FIFO según normativa española\n- Generación de informe fiscal listo para modelo 100\n- Determinación de si necesitas modelo 721\n- Validación y verificación de integridad de datos\n- Soporte ante requerimientos de la AEAT\n\n[Solicita tu análisis fiscal de Kraken](/contacto)\n\nCumple con Hacienda sin incertidumbre. Nosotros procesamos tus datos de Kraken.\n\n---\n\n**Descargo de responsabilidad:** Este artículo es informativo y educativo. No constituye asesoramiento fiscal personalizado. La fiscalidad está sujeta a cambios y cada situación es única. Consulta con un asesor fiscal profesional colegiado. Cleriontax no está afiliado con Kraken.\n\n---\n\n*Última actualización: Enero 2025*\n\n*Publicado por: Equipo Cleriontax - Expertos en Fiscalidad Crypto y Exportación de Datos*"
}
