{
  "title": "Guía Completa para la Declaración Fiscal de Criptomonedas en España 2025",
  "excerpt": "Todo lo que necesitas saber para declarar tus criptomonedas correctamente ante la AEAT: FIFO, modelo 100, 720, 721, ganancias patrimoniales y casos prácticos resueltos.",
  "content": "La declaración de criptomonedas en España se ha convertido en una obligación ineludible para cualquier inversor. Desde 2014, la **Dirección General de Tributos (DGT)** ha establecido criterios claros sobre la fiscalidad de criptoactivos, y el control de la AEAT es cada vez más exhaustivo.\n\n> **Resumen ejecutivo:** Esta guía completa te ayudará a entender cómo declarar tus inversiones en criptomonedas ante la AEAT. Aprenderás a calcular ganancias con el método FIFO, conocerás los modelos 100, 720 y 721, y descubrirás estrategias legales de optimización fiscal.\n\n---\n\n## ¿Por qué es obligatorio declarar criptomonedas?\n\nNo declarar correctamente tus operaciones con criptomonedas puede resultar en consecuencias graves:\n\n- **Sanciones económicas** del 50% al 150% de las cantidades no declaradas\n- **Recargos por presentación fuera de plazo** entre el 5% y el 20%\n- **Intereses de demora** calculados desde la fecha límite\n- **Delitos fiscales** cuando la cuota defraudada supera los 120.000 euros\n\nPero más allá de evitar problemas legales, declarar correctamente te permite **optimizar tu situación fiscal** y asegurarte de que pagas exactamente lo que corresponde según la ley.\n\n---\n\n## Los tres escenarios fiscales principales\n\n### 1. Ganancias y pérdidas patrimoniales: el modelo 100\n\nEste es el escenario más habitual para la mayoría de inversores en criptomonedas. Se produce una **ganancia o pérdida patrimonial** en las siguientes situaciones:\n\n- Cuando vendes criptomonedas por euros u otra moneda fiat\n- Al intercambiar una criptomoneda por otra (por ejemplo, Bitcoin por Ethereum)\n- Cuando utilizas criptomonedas para comprar bienes o servicios\n- Si recibes criptomonedas como pago por tu trabajo\n\n#### Cálculo de ganancias: el método FIFO obligatorio\n\nLa **AEAT** exige aplicar el método **FIFO** (First In, First Out). Este sistema establece que las primeras criptomonedas que compraste son las primeras que se consideran vendidas cuando realizas una operación.\n\nLa fórmula básica es:\n\n```\nGanancia o Pérdida = Precio de Venta - Precio de Adquisición (FIFO)\n```\n\n#### Ejemplo práctico detallado\n\nImagina que realizas las siguientes operaciones con Bitcoin:\n\n**Compras realizadas:**\n\n- Enero 2023: 0.5 BTC a 20.000 euros (coste total: 10.000 euros)\n- Marzo 2023: 0.3 BTC a 25.000 euros (coste total: 7.500 euros)\n\n**Venta realizada:**\n\n- Junio 2023: 0.6 BTC a 30.000 euros (ingreso total: 18.000 euros)\n\n**Aplicando el método FIFO:**\n\nPrimero se venden los 0.5 BTC de enero:\n\n- Ingreso por estos 0.5 BTC: 0.5 × 30.000 = 15.000 euros\n- Coste de adquisición: 10.000 euros\n- Ganancia parcial: 15.000 - 10.000 = 5.000 euros\n\nLuego se venden 0.1 BTC de los comprados en marzo:\n\n- Ingreso por estos 0.1 BTC: 0.1 × 30.000 = 3.000 euros\n- Coste de adquisición: 0.1 × 25.000 = 2.500 euros\n- Ganancia parcial: 3.000 - 2.500 = 500 euros\n\n**Ganancia patrimonial total: 5.500 euros**\n\n#### Escalas de tributación para 2025\n\nLas ganancias patrimoniales tributan en la **Base del Ahorro** con los siguientes tipos:\n\n| Base imponible | Tipo aplicable |\n|---|---|\n| Hasta 6.000 euros | 19% |\n| De 6.000 a 50.000 euros | 21% |\n| De 50.000 a 200.000 euros | 23% |\n| De 200.000 a 300.000 euros | 27% |\n| Más de 300.000 euros | 28% |\n\nEn el ejemplo anterior, con una ganancia de 5.500 euros, el impuesto sería:\n\n```\n5.500 × 21% = 1.155 euros\n```\n\n---\n\n### 2. Rendimientos de capital mobiliario: staking y lending\n\nCuando obtienes rendimientos pasivos con tus criptomonedas, estos se consideran **rendimientos de capital mobiliario** y tributan también en la Base del Ahorro.\n\nLos casos más comunes son:\n\n- **Staking:** Participación en la validación de transacciones en blockchains de Proof of Stake como Ethereum, Cardano o Polkadot, recibiendo recompensas por ello\n- **Lending:** Préstamos de criptomonedas en plataformas DeFi (Aave, Compound) o CeFi (Nexo, BlockFi), obteniendo intereses\n- **Cuentas de ahorro crypto:** Productos de ahorro que ofrecen exchanges como Binance Earn o Crypto.com Earn\n\n#### Momento de tributación\n\nSegún la interpretación de la AEAT, tributas cuando **dispones efectivamente** de los tokens recibidos como recompensa. Es decir:\n\n- Cuando retiras las recompensas de staking a tu wallet personal\n- Cuando finalizas un período de lending y recibes los intereses\n- Cuando las recompensas quedan disponibles y puedes utilizarlas libremente\n\n#### Ejemplo de staking\n\nSupongamos que mantienes 10 ETH en staking durante 2023 y recibes 0.5 ETH como recompensa. En el momento de recibirla, el valor de mercado de ETH es de 1.800 euros.\n\n**Cálculo:**\n\n- Rendimiento de capital mobiliario: 0.5 × 1.800 = **900 euros**\n- Tributación aplicable: 900 × 19% = **171 euros**\n\n---\n\n### 3. Otros incrementos patrimoniales\n\n#### Airdrops: tokens gratuitos\n\nLos airdrops son distribuciones gratuitas de tokens, generalmente por campañas promocionales o como recompensa por participar en proyectos.\n\n**Tratamiento fiscal:** Se consideran ganancia patrimonial al valor de mercado en el momento de recibirlos.\n\n#### Hard Forks: división de blockchains\n\nCuando una blockchain se divide y recibes nuevos tokens automáticamente (como ocurrió con Bitcoin Cash en 2017), el tratamiento fiscal difiere de los airdrops.\n\n**Criterio de la AEAT:** Los nuevos tokens recibidos en un hard fork solo tributan cuando los **vendes o intercambias**, no en el momento de recibirlos. Su valor de adquisición se considera cero.\n\n#### Minería de criptomonedas\n\nEl tratamiento fiscal de la minería depende de si se realiza de forma profesional o esporádica:\n\n**Minería profesional** (actividad económica habitual):\n\n- Requiere darse de alta como autónomo\n- Los ingresos tributan como rendimiento de actividad económica\n- Permite deducir gastos relacionados (electricidad, equipos, amortizaciones)\n- Obliga a cotizar a la Seguridad Social\n\n**Minería ocasional** (hobby esporádico):\n\n- No requiere alta como autónomo\n- Se considera ganancia patrimonial cuando vendes las criptomonedas minadas\n- Valor de adquisición: el valor de mercado en el momento de obtenerlas\n\n---\n\n## El modelo 720: declaración de bienes en el extranjero\n\n### Obligación de presentación\n\nDebes presentar el **Modelo 720** si el valor conjunto de tus criptomonedas en exchanges o plataformas extranjeras supera **50.000 euros** a 31 de diciembre.\n\n### Qué se considera extranjero\n\nSe considera extranjero cualquier exchange, plataforma de custodia o servicio que no esté domiciliado en España.\n\n**Requieren declaración en el 720:**\n\n- Binance, Coinbase, Kraken, Crypto.com\n- Bitpanda, Bitstamp, Gemini, Bybit\n- Cualquier exchange internacional\n\n**NO requieren declaración:**\n\n- Wallets no custodiadas personales (Ledger, Trezor, MetaMask)\n- Exchanges españoles\n- Criptomonedas en tu propio control sin intermediarios\n\n### Información esencial del Modelo 720\n\n**Plazo de presentación:** Del 1 de enero al 31 de marzo del año siguiente al que se refiere la declaración.\n\n**Naturaleza:** Es una declaración meramente **informativa**. No genera tributación directa ni supone pagar impuestos adicionales.\n\n**Sanciones:** Extremadamente severas. El incumplimiento o la presentación incorrecta conlleva una sanción mínima de **10.000 euros**, pudiendo ser mucho mayor según la cuantía no declarada.\n\n> **Importante:** Aunque el Modelo 720 no implica pagar impuestos, las consecuencias de no presentarlo o hacerlo incorrectamente son muy graves. Es fundamental cumplir con esta obligación informativa si superas el umbral de los 50.000 euros.\n\n---\n\n## El modelo 721: nuevo reporting para proveedores\n\nEl **Modelo 721** es una novedad introducida en 2023 como parte del endurecimiento del control fiscal sobre criptoactivos.\n\n### A quién aplica\n\nEste modelo es obligatorio únicamente para:\n\n- Personas y entidades que proporcionen servicios de **custodia de monedas virtuales**\n- Exchanges españoles o con presencia fiscal en España\n- Proveedores de servicios de **cambio entre monedas virtuales y dinero fiat**\n- Plataformas que faciliten operaciones con criptoactivos\n\n### Usuarios particulares\n\nLos inversores individuales **NO deben presentar** el Modelo 721. Esta obligación recae exclusivamente sobre los proveedores de servicios, no sobre los usuarios que operan con criptomonedas.\n\n---\n\n## Casos especiales y dudas frecuentes\n\n### ¿Qué pasa si solo he comprado y mantengo?\n\nSi únicamente has comprado criptomonedas y las mantienes sin vender (estrategia conocida como **HODL**), **no tienes obligación de declarar ganancias** en el IRPF, ya que no has materializado ninguna ganancia o pérdida.\n\nSin embargo, sí debes presentar el **Modelo 720** si el valor de tus holdings en exchanges extranjeros supera los 50.000 euros a 31 de diciembre.\n\nEsta estrategia de mantener sin vender es, de hecho, una forma de **diferir la tributación**. Solo pagarás impuestos cuando decidas vender y materializar las ganancias.\n\n### ¿Las transferencias entre wallets tributan?\n\n**No**. Transferir criptomonedas de un wallet a otro que tú controlas no genera ningún hecho imponible. Es equivalente a mover dinero de una cuenta bancaria tuya a otra cuenta también tuya.\n\n**Ejemplos que NO tributan:**\n\n- Transferir Bitcoin de Binance a tu hardware wallet Ledger\n- Mover Ethereum de MetaMask a Trezor\n- Consolidar fondos de varios wallets en uno solo\n- Enviar criptomonedas entre diferentes exchanges que utilizas\n\nSolo tributan las operaciones que implican una **transmisión onerosa** (venta, intercambio por otro activo) o la obtención de rendimientos.\n\n### Compensación de pérdidas con ganancias\n\nLas **pérdidas patrimoniales** se pueden compensar con ganancias patrimoniales dentro del mismo ejercicio fiscal. Si después de compensar te quedan pérdidas sin utilizar, puedes arrastrarlas para compensarlas en los **cuatro años siguientes**.\n\n**Ejemplo de compensación:**\n\n**Año 2023:**\n\n- Ganancias vendiendo Ethereum: +8.000 euros\n- Pérdidas vendiendo Solana: -3.000 euros\n- Base imponible neta: 5.000 euros\n- No hay pérdidas pendientes de compensar\n\n**Año 2024:**\n\n- Ganancias: +2.000 euros\n- Pérdidas: -6.000 euros\n- Base imponible: -4.000 euros (pérdida neta)\n- Pérdidas pendientes de compensar en 2025-2028: 4.000 euros\n\n### Fiscalidad de los NFTs\n\nLos NFTs (tokens no fungibles) reciben un tratamiento fiscal similar a las criptomonedas, pero con algunas particularidades según la actividad:\n\n**Compra y venta ocasional:** Genera ganancia o pérdida patrimonial que tributa al 19%-28% en la Base del Ahorro.\n\n**Creación y venta recurrente por artistas:** Si eres creador y vendes NFTs de forma habitual y profesional, se considera rendimiento de actividad económica, requiriendo alta como autónomo.\n\n**Intercambio de NFT por criptomonedas:** Se trata como una permuta que genera ganancia o pérdida patrimonial en ambas partes.\n\n**Recibir NFT como pago:** Tributará como rendimiento del trabajo (si es por servicios laborales) o como rendimiento de actividad económica (si es por actividad profesional).\n\n### Trading de alto volumen y frecuencia\n\nSi realizas trading activo con cientos o miles de operaciones anuales, debes tener en cuenta que la AEAT podría considerar que es una **actividad económica habitual** en lugar de meras inversiones ocasionales.\n\n**Esto implicaría:**\n\n- Obligación de darte de alta como autónomo\n- Tributar como rendimiento de actividad económica en lugar de ganancias patrimoniales\n- Pagar cotizaciones mensuales a la Seguridad Social\n- Llevar contabilidad formal de la actividad\n\n**Criterios que evalúa la AEAT:**\n\n- **Volumen de operaciones:** Más de 500 operaciones anuales puede ser indicativo\n- **Frecuencia:** Trading diario o intradia de forma constante\n- **Ingresos generados:** Si es tu fuente principal de ingresos\n- **Infraestructura:** Uso de herramientas profesionales, oficina dedicada, etc.\n- **Organización:** Nivel de planificación y sistematización de la actividad\n\n> **Recomendación profesional:** Si realizas más de 100 operaciones mensuales de forma regular, consulta con un asesor fiscal especializado para evaluar tu situación particular y determinar el régimen fiscal más apropiado.\n\n---\n\n## Estrategias de optimización fiscal legal\n\n### Tax-Loss Harvesting: cristalización de pérdidas\n\nEsta estrategia consiste en vender activos con pérdidas latentes antes del cierre del ejercicio fiscal para compensar ganancias ya realizadas, reduciendo así la base imponible.\n\n#### Ejemplo práctico de aplicación\n\nA 15 de diciembre de 2025, tu situación es:\n\n**Ganancias realizadas:**\n\n- Ganancias ya realizadas vendiendo Bitcoin: +15.000 euros\n\n**Portfolio actual con pérdidas latentes:**\n\n- Ethereum: -4.000 euros respecto al precio de compra\n- Solana: -2.000 euros respecto al precio de compra\n\n**Estrategia a aplicar:**\n\n1. Vendes Ethereum antes del 31 de diciembre, cristalizando la pérdida de 4.000 euros\n2. Tu base imponible para 2025 queda en: 15.000 - 4.000 = 11.000 euros\n3. Ahorro fiscal: 4.000 × 21% = **840 euros** de impuestos menos a pagar\n\nOpcional: Puedes recomprar Ethereum en enero de 2026 si mantienes tu convicción en el proyecto. La pérdida fiscal de 2025 queda validada.\n\n> **Importante:** Aunque en España no existe la \"wash sale rule\" de Estados Unidos, es recomendable esperar al menos unos días antes de recomprar el mismo activo, para evitar que la AEAT pueda cuestionar la operación como ficticia.\n\n### Fraccionamiento de ventas entre ejercicios\n\nSi has acumulado ganancias significativas, considera fraccionar las ventas entre diferentes años fiscales para evitar saltar a tramos impositivos superiores.\n\n**Comparativa:**\n\n**Opción A - Vender todo en un año:**\n\n- Ganancia: 55.000 euros\n- Tributación: (6.000 × 19%) + (44.000 × 21%) + (5.000 × 23%) = 11.530 euros\n\n**Opción B - Fraccionar en dos años:**\n\n- Año 1: 27.500 euros → (6.000 × 19%) + (21.500 × 21%) = 5.655 euros\n- Año 2: 27.500 euros → (6.000 × 19%) + (21.500 × 21%) = 5.655 euros\n- Total: 11.310 euros\n- **Ahorro: 220 euros**\n\nAunque el ahorro pueda parecer modesto en este ejemplo, en patrimonios mayores la diferencia puede ser mucho más significativa.\n\n### Estructuración mediante sociedad\n\nPara grandes patrimonios cripto (superiores a 100.000 euros) con operativa profesional, estructurar las inversiones a través de una sociedad puede ofrecer ventajas fiscales.\n\n**Ventajas potenciales:**\n\n- Tipo impositivo del Impuesto de Sociedades (23-25%) frente al máximo del IRPF (28%)\n- Posibilidad de reinvertir beneficios en la sociedad sin tributación personal inmediata\n- Mejor gestión de flujos de efectivo empresariales\n- Deducción de gastos relacionados con la actividad\n\n**Desventajas a considerar:**\n\n- Obligaciones contables y de auditoría más complejas\n- Costes de constitución y mantenimiento de la sociedad\n- Doble imposición al retirar dividendos (sociedades + IRPF personal)\n- Mayor escrutinio y requisitos de reporting\n\n> **Conclusión:** La estructuración societaria solo tiene sentido económico para patrimonios significativos y operativa verdaderamente profesional. Requiere análisis personalizado con asesor fiscal especializado para evaluar si es apropiada en tu caso concreto.\n\n---\n\n## Proceso práctico para tu declaración\n\n### Paso 1: Recopilación de información\n\nNecesitas exportar de cada exchange y wallet:\n\n- Historial completo de transacciones en formato CSV, Excel o mediante API\n- Fechas exactas de cada operación con formato completo (día, mes, año, hora)\n- Importes en euros al tipo de cambio del momento de cada transacción\n- Comisiones pagadas desglosadas por operación\n- Tipo de cada operación (compra, venta, intercambio, transferencia, staking, etc.)\n\n**Plataformas principales a revisar:**\n\nBinance, Coinbase, Kraken, Bitfinex, Bitstamp, Crypto.com, Kucoin, y cualquier otro exchange que hayas utilizado.\n\n### Paso 2: Consolidación y limpieza de datos\n\nEste es el proceso más laborioso pero absolutamente crítico:\n\n- Unifica todos los archivos CSV de diferentes plataformas en un formato común\n- Elimina transacciones duplicadas que puedan aparecer en varios exports\n- Concilia transferencias entre plataformas (una salida de exchange A debe coincidir con una entrada en exchange B)\n- Verifica que los saldos finales calculados coinciden con tus saldos reales actuales\n- Convierte todas las cantidades y valores a un formato uniforme\n\n> **Nota profesional:** Este proceso puede llevar decenas de horas si tienes muchas operaciones. Plataformas especializadas como Cleriontax automatizan completamente este tedioso trabajo.\n\n### Paso 3: Aplicación de la metodología FIFO\n\nPara cada venta o intercambio, debes calcular el coste de adquisición aplicando el método FIFO. Esto requiere:\n\n- Mantener un registro cronológico ordenado de todas las compras de cada activo\n- Calcular la base de coste FIFO para cada operación de venta\n- Rastrear el saldo de cada criptomoneda en cada momento del año\n- Llevar control separado de cada tipo de activo\n\n### Paso 4: Generación de anexos documentales\n\nDebes preparar la siguiente documentación de soporte:\n\n- Listado detallado de todas las operaciones con su ganancia o pérdida individual\n- Resumen agregado de ganancias y pérdidas patrimoniales totales\n- Resumen separado de rendimientos de capital mobiliario (staking, lending, intereses)\n- Documentación justificativa para el Modelo 720 si superas 50.000 euros en el extranjero\n- Capturas de pantalla o PDFs de los exchanges como justificantes de operaciones\n\n### Paso 5: Presentación de la declaración\n\n**Plazos oficiales:**\n\n- **Modelo 100 (IRPF):** Del 11 de abril al 30 de junio\n- **Modelo 720:** Del 1 de enero al 31 de marzo\n\n**Métodos de presentación:**\n\n- Online mediante certificado digital\n- Online con sistema Cl@ve PIN\n- Presencialmente en oficinas de la AEAT (solo para Modelo 100)\n\n---\n\n## Cambios normativos recientes y perspectivas\n\n### Reglamento MiCA de la Unión Europea\n\nEl Reglamento **MiCA** (Markets in Crypto-Assets) entró en vigor progresivamente en 2024-2025, estableciendo un marco regulatorio armonizado en toda la Unión Europea.\n\n**Principales implicaciones:**\n\n- Mayor regulación y supervisión de exchanges y proveedores de servicios\n- Requisitos de capital y reservas para proveedores\n- Mejoras sustanciales en protección al consumidor\n- Estandarización del reporting fiscal automático entre países\n- Regulación específica para stablecoins y su respaldo\n- Mayor transparencia en operaciones y tarifas\n\n### Directiva DAC8: intercambio automático de información\n\nLa **Directiva DAC8** establece el intercambio automático de información fiscal sobre criptoactivos entre los países miembros de la UE, similar al sistema CRS para información bancaria.\n\n**Qué significa para los inversores:**\n\n- Los exchanges reportarán automáticamente tus operaciones a las autoridades fiscales de tu país\n- Intercambio de información entre administraciones tributarias europeas\n- Prácticamente imposible ocultar operaciones con criptomonedas\n- Mayor transparencia implica mayor seguridad jurídica para inversores que declaran correctamente\n\n> **Conclusión regulatoria:** La era de pensar que \"la AEAT no se enterará\" ha terminado definitivamente. La transparencia es total y el control cada vez más exhaustivo. Declarar correctamente no solo es obligatorio, sino la única opción segura y viable a largo plazo.\n\n---\n\n## Checklist final: preparado para declarar\n\nAntes de proceder con tu declaración, verifica que cumples con todos estos requisitos:\n\n- [ ] Tengo exportado el historial completo de transacciones de todas mis plataformas\n- [ ] He identificado todas mis compras con fecha exacta y precio de adquisición\n- [ ] He identificado todas mis ventas e intercambios con fecha exacta y precio de venta\n- [ ] He calculado correctamente las ganancias y pérdidas aplicando metodología FIFO\n- [ ] He cuantificado por separado mis rendimientos de staking, lending y otras fuentes pasivas\n- [ ] Sé si debo presentar Modelo 720 (más de 50.000 euros en exchanges extranjeros)\n- [ ] Dispongo de los justificantes documentales de todas las operaciones relevantes\n- [ ] He considerado y aplicado estrategias de optimización fiscal legal apropiadas para mi situación\n\n---\n\n## Cuándo necesitas ayuda profesional especializada\n\nLa declaración de criptomonedas puede ser extremadamente compleja, especialmente si te encuentras en alguna de estas situaciones:\n\n- Has realizado más de 100 operaciones durante el año\n- Has operado en múltiples exchanges, tanto centralizados como descentralizados\n- Has participado en protocolos DeFi complejos (liquidity pools, yield farming, lending)\n- Has realizado operaciones de staking en múltiples protocolos\n- Tienes dudas sobre la correcta aplicación del método FIFO en tu caso\n- Quieres optimizar tu situación fiscal dentro del marco legal\n- También inviertes en mercados tradicionales (acciones, fondos, derivados) y necesitas consolidar toda tu fiscalidad\n- El volumen y complejidad de tus operaciones requiere herramientas profesionales\n\n### Por qué elegir Cleriontax\n\nEn Cleriontax nos especializamos en la intersección entre **fiscalidad y tecnología**. Nuestro equipo combina:\n\n**Expertise fiscal colegiado:** Asesores fiscales certificados con años de experiencia específica en criptomonedas y activos digitales, conocimiento profundo de la normativa AEAT y criterios DGT.\n\n**Tecnología de análisis de datos:** Ingenieros especializados en procesamiento masivo de transacciones blockchain, algoritmos propios de conciliación y limpieza de datos, automatización de cálculos FIFO complejos.\n\n**Proceso automatizado:** Procesamos automáticamente todos tus datos sin importar su complejidad o volumen, integramos información de 50+ exchanges y protocolos DeFi, validamos y verificamos la coherencia de toda la información.\n\n**Informes profesionales:** Generamos informes detallados listos para presentar ante la AEAT, con documentación de soporte completa y explicaciones claras de cada operación, cumpliendo todos los requisitos legales y formales.\n\n---\n\n## Solicita tu informe fiscal personalizado\n\n¿Listo para declarar tus criptomonedas correctamente? Nuestro equipo de expertos está aquí para ayudarte.\n\n**[Solicita tu análisis gratuito →](/es/contacto)**\n\nContacta con nosotros y obtén una valoración inicial sin compromiso de tu situación fiscal. Te explicaremos exactamente qué necesitas hacer y cómo podemos ayudarte.\n\n---\n\n**Descargo de responsabilidad:** Este artículo tiene finalidad informativa y educativa exclusivamente. No constituye asesoramiento fiscal personalizado ni recomendación de inversión. La normativa fiscal está sujeta a cambios y cada situación personal es única. Consulta siempre con un asesor fiscal profesional colegiado para tu caso específico antes de tomar decisiones.\n\n---\n\n*Última actualización: Enero 2025*\n\n*Publicado por: Equipo Cleriontax - Expertos en Fiscalidad de Criptomonedas y Análisis de Datos Financieros*"
}
