{
  "title": "Com classificar operacions de criptomonedes segons l’AEAT",
  "excerpt": "Aprèn a classificar correctament les teves operacions de criptomonedes segons els criteris de l’AEAT i evita errors a la teva declaració fiscal.",
  "content": "Classificar correctament les operacions de criptomonedes és un dels passos més importants del procés fiscal. D’això depèn si una transacció genera una **guany patrimonial**, un **rendiment** o una simple transferència interna sense impacte fiscal.\n\nUna classificació incorrecta pot alterar el resultat de la teva declaració i generar **discrepàncies amb l’AEAT**. Per això és essencial aplicar els criteris fiscals adequats a cada tipus d’operació, basats en la seva naturalesa i en la normativa vigent.\n\n---\n\n## Per què la classificació fiscal és essencial\n\nLa **classificació fiscal** determina com tributa cada operació i en quin apartat de la teva declaració s’ha d’incloure. No és el mateix una venda de Bitcoin (guany patrimonial) que els interessos obtinguts per staking (rendiment del capital mobiliari).\n\n### Impacte a la teva declaració\n\nCada tipus d’operació té:\n\n- **Diferents tipus impositius:** Els guanys patrimonials tributen a la base de l’estalvi (19%-28%), mentre que altres rendiments poden tenir un tractament diferent.\n- **Diferents models fiscals:** Algunes operacions s’han de declarar al Model 100, altres requereixen informació addicional.\n- **Diferents criteris de càlcul:** FIFO per als guanys patrimonials, valoració de mercat per als rendiments.\n\nUna classificació incorrecta pot portar a:\n\n- Calcular malament la base imposable.\n- Aplicar tipus impositius incorrectes.\n- Ometre operacions que sí s’han de declarar.\n- Incloure moviments sense impacte fiscal.\n\n---\n\n## Tipus d’operacions reconegudes per l’AEAT\n\nL’**Agència Tributària** distingeix principalment tres categories d’operacions en l’àmbit de les criptomonedes:\n\n### 1. Operacions patrimonials\n\n**Definició:** Compres, vendes o intercanvis de criptomonedes que generen guanys o pèrdues patrimonials.\n\n**Exemples:**\n\n- Venda de Bitcoin per euros.\n- Intercanvi d’Ethereum per una altra criptomoneda (swap).\n- Ús de criptomonedes per comprar béns o serveis.\n- Conversió de tokens en exchanges descentralitzats.\n\n**Tributació:**\n\n- S’aplica el mètode **FIFO** per calcular el cost d’adquisició.\n- Els guanys tributen a la **base de l’estalvi** (19%-28%).\n- Les pèrdues es poden compensar amb altres guanys patrimonials.\n\n### 2. Rendiments del capital mobiliari\n\n**Definició:** Ingressos obtinguts per staking, préstecs o recompenses de protocols descentralitzats.\n\n**Exemples:**\n\n- Interès per staking d’ETH, ADA, DOT, etc.\n- Recompenses per yield farming o provisió de liquiditat.\n- Rendiments per lending (préstecs de criptomonedes).\n- Airdrops rebuts com a recompensa o incentiu.\n\n**Tributació:**\n\n- Es valoren al **preu de mercat** en el moment de rebre’ls.\n- Tributen com a **rendiments del capital mobiliari**.\n- Es declaren anualment, encara que no s’hagin convertit a euros.\n\n### 3. Altres operacions no subjectes\n\n**Definició:** Moviments interns entre wallets o transferències entre els teus propis comptes que no tenen efectes fiscals, sempre que es puguin justificar adequadament.\n\n**Exemples:**\n\n- Transferència de Bitcoin de Binance al teu hardware wallet.\n- Moviment d’Ethereum de MetaMask a Ledger.\n- Consolidació de fons en una sola wallet.\n- Dipòsits i retirades en exchanges.\n\n**Important:**\n\n> **Aquestes operacions NO generen fet imposable**, però han d’estar correctament documentades per evitar confusions amb l’AEAT. És fonamental poder demostrar que són moviments interns i no vendes o intercanvis.\n\n---\n\n## Com determinar la naturalesa fiscal de cada transacció\n\nPer classificar correctament cada operació, l’AEAT exigeix analitzar el **propòsit econòmic i el resultat** de la transacció.\n\n### Preguntes clau per classificar una operació:\n\n1. **Canvia la titularitat de l’actiu?**\n   - Sí → Probablement és una operació patrimonial.\n   - No → Pot ser un moviment intern.\n\n2. **Es genera un rendiment o ingrés?**\n   - Sí → Pot ser un rendiment del capital mobiliari.\n   - No → Analitzar si és permuta o transferència.\n\n3. **Hi ha un intercanvi econòmic?**\n   - Sí → És una permuta subjecta a tributació.\n   - No → Pot ser un moviment sense impacte fiscal.\n\n4. **Es pot demostrar que és un moviment intern?**\n   - Sí (mateixes adreces, control exclusiu) → No subjecte.\n   - No → S’ha de tractar com una operació patrimonial.\n\n### Exemple pràctic de classificació\n\n**Operació:** Moure 1 ETH de Coinbase a Uniswap i intercanviar-lo per 2000 USDC.\n\n**Anàlisi:**\n\n1. **Primera part** (Coinbase → Uniswap):\n   - És un **moviment intern**: Només mous fons entre plataformes que controles.\n   - **No té impacte fiscal.**\n\n2. **Segona part** (ETH → USDC a Uniswap):\n   - És un **swap/permuta**: Canvies un actiu per un altre.\n   - **Genera guany o pèrdua patrimonial.**\n   - Es calcula la diferència entre el valor de venda de l’ETH i el seu cost d’adquisició.\n\nPer exemple, un **intercanvi de tokens en un DEX** és una permuta subjecta a tributació, mentre que **moure fons entre wallets personals** no ho és.\n\n### Informació necessària per classificar correctament\n\nLa clau és disposar d’**informació completa**:\n\n- ✅ **Dates exactes** de cada transacció.\n- ✅ **Preus de mercat** en el moment de l’operació.\n- ✅ **Adreces d’origen i destí** (per identificar moviments interns).\n- ✅ **Finalitat de cada operació** (compra, venda, swap, staking, etc.).\n- ✅ **Hash de transacció** per a la traçabilitat a la blockchain.\n- ✅ **Exchange o protocol** on s’ha realitzat.\n\nNomés així es pot garantir la **traçabilitat i coherència** de l’informe fiscal.\n\n---\n\n## Errors comuns en la classificació fiscal de criptomonedes\n\n### Error #1: No considerar els swaps com a permutes\n\nUn dels errors més freqüents és tractar els **swaps entre criptomonedes** com simples conversions sense implicacions fiscals, quan en realitat són **permutes subjectes a tributació**.\n\n**Correcte:** Cada swap genera una guany o pèrdua que s’ha de calcular amb FIFO.\n\n### Error #2: No declarar rendiments d’staking\n\nUn altre error habitual és no declarar els rendiments d’staking o airdrops, considerant-los **‘no realitzats’** fins que es venguin.\n\n**Correcte:** Els rendiments d’staking s’han de declarar anualment al preu de mercat en el moment de rebre’ls.\n\n### Error #3: Confondre moviments interns amb vendes\n\nTambé és comú classificar incorrectament moviments entre wallets o barrejar-los amb operacions reals de compra-venda.\n\n**Correcte:** Els moviments entre les teves pròpies wallets NO generen fet imposable si pots demostrar que controles ambdues adreces.\n\n### Error #4: No aplicar correctament el FIFO\n\nMolts inversors calculen els guanys patrimonials sense aplicar correctament el mètode FIFO, cosa que pot donar lloc a càlculs incorrectes.\n\n**Correcte:** Les primeres criptomonedes que vas comprar són les primeres que es consideren venudes.\n\nAquests errors poden generar **inconsistències i alertes** durant la revisió de l’AEAT.\n\n---\n\n## Com Cleriontax garanteix una classificació precisa\n\nA **Cleriontax** analitzem cada transacció amb un enfocament tècnic i fiscal. Combinen **automatització avançada amb revisió manual** per identificar el tipus exacte d’operació i el seu impacte tributari.\n\n### El nostre procés de classificació\n\n1. **Importació de dades** des d’exchanges, wallets i blockchain.\n2. **Anàlisi automàtica inicial** de cada transacció.\n3. **Identificació del tipus d’operació:**\n   - Compra/venda.\n   - Swap/permuta.\n   - Staking/lending.\n   - Moviment intern.\n   - Airdrop/recompensa.\n4. **Detecció de moviments interns** mitjançant anàlisi d’adreces.\n5. **Càlcul de preus de mercat** històrics.\n6. **Revisió manual per assessors fiscals** especialitzats.\n7. **Validació de coherència** entre diferents fonts.\n8. **Generació de l’informe fiscal** classificat i verificat.\n\nEl nostre sistema detecta:\n\n- ✅ Moviments interns entre les teves wallets.\n- ✅ Intercanvis entre tokens (swaps).\n- ✅ Operacions DeFi complexes.\n- ✅ Rendiments passius (staking, farming).\n- ✅ Airdrops i recompenses.\n- ✅ Comissions de transacció (gas fees).\n\nAplicant els **criteris establerts per l’AEAT**, assegurem que cada informe fiscal sigui complet, coherent i correcte fiscalment.\n\n---\n\n## Conclusió: rigor i traçabilitat en cada operació\n\nLa **classificació fiscal de les operacions cripto** requereix precisió i coneixement especialitzat. Cada error pot traduir-se en sancions o ajustos per part d’Hisenda, per això és fonamental treballar amb informes verificats i metodologies consistents.\n\nPunts clau:\n\n- **Identificar correctament** el tipus d’operació (patrimonial, rendiment o moviment intern).\n- **Aplicar els criteris fiscals** adequats segons la normativa de l’AEAT.\n- **Mantenir traçabilitat completa** de totes les transaccions.\n- **Documentar adequadament** els moviments interns.\n- **Calcular correctament** els guanys patrimonials amb FIFO.\n\nA **Cleriontax** transformem milers de moviments en dades estructurades i auditables, garantint que cada operació estigui correctament classificada i llesta per declarar amb total seguretat.\n\n---\n\n## Cleriontax: experts en classificació fiscal de criptomonedes\n\nNo deixis la classificació de les teves operacions cripto a l’atzar. El nostre equip d’experts garanteix que cada transacció es classifiqui correctament segons els criteris de l’AEAT.\n\n**[Sol·licita el teu informe fiscal →](/contacte)**\n\nContacta amb el nostre equip i obtén una valoració inicial sense compromís. T’explicarem exactament com classifiquem les teves operacions i per què els nostres informes són els més precisos del mercat.\n\n---\n\n**Avís legal:** Aquest article té finalitat exclusivament informativa i educativa. No constitueix assessorament fiscal personalitzat ni recomanació d’inversió. La normativa fiscal està subjecta a canvis i cada situació personal és única. Consulta sempre amb un assessor fiscal professional col·legiat per al teu cas específic.\n\n---\n\n*Última actualització: Octubre 2025*\n\n*Publicat per: Equip Cleriontax - Experts en Fiscalitat de Criptomonedes i Anàlisi de Dades*"
}

