{
  "title": "Com Exportar l'Historial de Binance Correctament: Guia Completa per a la Declaració Fiscal 2025",
  "excerpt": "Guia pas a pas per exportar correctament totes les teves dades de Binance en format CSV. Aprèn a obtenir el teu historial de transaccions, trades, staking, earn i conversions per preparar la teva declaració de la renda i complir amb l'AEAT.",
  "content": "**Binance** és l'exchange de criptomonedes més utilitzat del món, amb milions d'usuaris a Espanya que operen diàriament amb Bitcoin, Ethereum, stablecoins i centenars d'altcoins.\n\nPerò quan arriba el moment de preparar la **declaració de la renda** o respondre a un requeriment de l'AEAT, molts usuaris s'enfronten a un problema crític: com exportar correctament tot l'historial d'operacions de Binance amb finalitats fiscals?\n\nExportar les teves dades de Binance de manera incorrecta o incompleta pot resultar en:\n\n- Declaracions fiscals errònies que derivin en sancions\n- Impossibilitat de justificar operacions davant Hisenda\n- Pèrdua d'informació sobre guanys i pèrdues\n- Càlculs incorrectes del mètode FIFO\n- Manca de traçabilitat de la teva activitat cripto\n\nEn aquesta **guia completa i actualitzada per a 2025**, t'ensenyarem pas a pas com exportar correctament totes les teves dades de Binance, quins fitxers necessites, com interpretar-los i com organitzar-los per a la teva declaració fiscal.\n\n---\n\n## Per què és crucial exportar correctament el teu historial de Binance\n\nL'**Agència Tributària espanyola (AEAT)** té accés a informació sobre les teves operacions amb criptomonedes mitjançant diversos mecanismes: requeriments a exchanges, informació bancària, creuaments de dades internacionals i anàlisi blockchain.\n\n### Obligacions fiscals amb criptomonedes a Espanya\n\nCom a usuari de Binance a Espanya, has de complir diverses obligacions fiscals fonamentals. En primer lloc, cada vegada que vens, intercanvies o converteixes criptomonedes, generes una guany o pèrdua patrimonial que s'ha de declarar en el [model 100 mitjançant l'aplicació del mètode FIFO](/blog/como-declarar-criptomonedas-renta-2025). Aquesta tributació es produeix a la base de l'estalvi amb tipus que oscil·len entre el 19% i el 28%, i requereix que coneguis amb exactitud el preu de compra i venda de cada operació.\n\nSi el saldo total de les teves criptomonedes a Binance supera els 50.000€ a 31 de desembre, estàs obligat a presentar el [model 721 de declaració de criptomonedes a l'estranger](/blog/modelo-721-criptomonedas). Les sancions per no presentar aquest model poden assolir des de 1.500€ fins al 150% del valor no declarat, i s'ha de presentar al març de l'any següent.\n\nA més, els ingressos generats per staking, savings i lending s'han de declarar com a rendiments del capital mobiliari en l'exercici fiscal en què es reben. L'AEAT pot sol·licitar justificació detallada de qualsevol operació, de manera que les dades han de ser coherents, estar completes i mantenir una [traçabilitat absoluta de totes les transaccions](/blog/clasificar-operaciones-criptomonedas).\n\n### Conseqüències de no tenir l'historial complet\n\nSense un historial correcte i complet de Binance, t'enfrontes a múltiples problemes fiscals. No podràs calcular correctament els teus guanys o pèrdues patrimonials ni aplicar el mètode FIFO obligatori a Espanya. Tampoc no podràs justificar l'origen de les teves criptomonedes davant un requeriment d'Hisenda.\n\nEl risc més greu és que l'AEAT consideri que el 100% de les teves vendes constitueixen guany patrimonial, cosa que pot resultar en liquidacions tributàries excessives, recàrrecs per presentació fora de termini i sancions significatives.\n\n> **Dada important:** Si no pots demostrar el preu de compra de les teves criptomonedes, l'AEAT pot considerar que el cost d'adquisició és 0€, i tributar el 100% del valor de venda.\n\n---\n\n## Tipus de dades que necessites exportar de Binance\n\nBinance genera múltiples tipus d'operacions, cadascuna amb implicacions fiscals diferents. Per a una declaració fiscal completa, necessites exportar tots els tipus de dades que hagin estat rellevants en la teva activitat.\n\n### 1. Historial de transaccions (Transaction History)\n\nAquest fitxer inclou tots els dipòsits i retirades tant en fiat com en criptomonedes, les distribucions i airdrops que hagis rebut, les recompenses de programes promocionals i totes les comissions que hagis pagat en les teves operacions.\n\n**Per què el necessites:**\n\n- Traçabilitat completa d'entrada i sortida de fons\n- Justificació de l'origen de les teves criptomonedes\n- Identificació d'airdrops i recompenses (rendiments fiscals)\n\n### 2. Historial de trades (Trade History)\n\nL'historial de trades spot inclou totes les teves ordres de compra-venda en parells com BTC/USDT, ETH/EUR i similars. Registra les ordres limit, market i stop-limit amb els seus respectius preus d'execució, quantitats negociades, comissions aplicades i dates exactes amb marca temporal.\n\n**Per què el necessites:**\n\n- Càlcul de guanys i pèrdues patrimonials\n- Aplicació correcta del mètode FIFO\n- Base documental per a la declaració en el model 100\n\n### 3. Historial de conversions (Convert History)\n\nLes conversions inclouen tots els intercanvis instantanis entre criptomonedes que hagis realitzat, com convertir BTC a ETH directament. També abasta les conversions de dust, aquestes petites quantitats residuals que Binance permet convertir a BNB.\n\nÉs crucial entendre que fiscalment, cada conversió entre criptomonedes constitueix una permuta que genera una guany o pèrdua patrimonial que s'ha de declarar. Això inclou fins i tot les conversions de dust, que tot i involucrar quantitats petites, continuen sent esdeveniments fiscals segons la [normativa de classificació d'operacions](/blog/clasificar-operaciones-criptomonedas).\n\n### 4. Historial de staking i Earn\n\nSi has participat en staking de criptomonedes com ETH 2.0, ADA o DOT, o has utilitzat productes de Binance Savings i Lending, totes les recompenses rebudes constitueixen rendiments del capital mobiliari. Aquests ingressos s'han de valorar al preu de mercat del dia de recepció i declarar-se en l'exercici fiscal corresponent.\n\n### 5. Historial de comissions (Fee Details)\n\nLes comissions que pagues a Binance són despeses deduïbles que redueixen la base imposable dels teus guanys patrimonials. Això inclou les trading fees de compra-venda, les withdrawal fees de retirada i les comissions pagades en BNB si tens activat el descompte del 25%.\n\n### 6. Altres historials rellevants\n\nSi has operat amb futurs, opcions o margin trading, necessitaràs també l'historial complet d'aquestes operacions, ja que els beneficis de derivats tributen com a guanys patrimonials. Les distribucions per airdrops, hard forks i recompenses de programes de referits també han d'estar correctament documentades.\n\n---\n\n## Guia pas a pas: Com exportar el teu historial complet de Binance\n\nAra veurem exactament com exportar cada tipus de dada des del teu compte de Binance de manera sistemàtica i completa.\n\n### Requisits previs\n\nAbans de començar el procés d'exportació, assegura't de tenir:\n\n- ✅ Accés al teu compte de Binance (web o app)\n- ✅ Verificació d'identitat completada (KYC)\n- ✅ Autenticació de doble factor (2FA) activada\n- ✅ Connexió estable a internet\n- ✅ Espai d'emmagatzematge per a múltiples fitxers CSV\n\n### Pas 1: Exportar historial de transaccions (Transaction History)\n\n**Accés des de la web:**\n\n1. Inicia sessió a www.binance.com\n2. Fes clic al teu icona de perfil (a dalt a la dreta)\n3. Selecciona \"Wallet\" → \"Transaction History\"\n4. Configura els filtres:\n   - **Type:** Selecciona \"All\" (o filtra per Deposit, Withdrawal, etc.)\n   - **Coin:** Pots seleccionar \"All\" o una criptomoneda específica\n   - **Date:** Selecciona el rang (màxim 3 mesos per exportació)\n5. Fes clic a \"Export Transaction History\" (cantonada superior dreta)\n6. Selecciona \"Generate\"\n7. Rebràs un correu electrònic quan el fitxer CSV estigui llest\n8. Descarrega'l i guarda'l amb un nom descriptiu (ex. `Binance_Transactions_2024_Q1.csv`)\n\n**Important:** Si el teu historial abasta més de 3 mesos, has de fer **múltiples exportacions** dividint per trimestres o mesos.\n\n### Pas 2: Exportar historial de trades (Trade History)\n\nPer exportar el teu historial complet d'operacions spot:\n\n1. Ves a \"Orders\" → \"Spot Order\"\n2. Fes clic a la pestanya \"Trade History\"\n3. Configura els filtres:\n   - **Trading pair:** \"All\" o parells específics (BTC/USDT, ETH/EUR, etc.)\n   - **Date:** Rang de dates (màxim 3 mesos)\n   - **Side:** All (Buy i Sell)\n4. Fes clic a \"Export Complete Trade History\"\n5. Selecciona \"Generate\"\n6. Espera el correu de confirmació i descarrega el CSV\n\n**Columnes importants del fitxer:**\n\n| Columna | Descripció | Exemple |\n|---------|-------------|----------|\n| **Date(UTC)** | Data i hora en UTC | 2024-03-15 14:32:10 |\n| **Pair** | Parell de trading | BTCUSDT |\n| **Type** | Tipus d'ordre | LIMIT, MARKET |\n| **Side** | Compra o venda | BUY, SELL |\n| **Price** | Preu unitari | 55000.00 |\n| **Executed** | Quantitat executada | 0.025 BTC |\n| **Amount** | Valor total | 1375.00 USDT |\n| **Fee** | Comissió pagada | 0.00125 BTC |\n| **Fee Coin** | Moneda de la comissió | BTC, BNB |\n\n### Pas 3: Exportar historial de conversions (Convert History)\n\nLes conversions instantànies s'exporten des d'un apartat diferent:\n\n1. Ves a \"Wallet\" → \"Spot Wallet\"\n2. Fes clic a \"Convert\"\n3. Accedeix a \"Convert History\"\n4. Selecciona el rang de dates\n5. Fes clic a \"Export\" i descarrega el CSV\n\n**No oblidis exportar també el Dust Conversion:**\n\n1. Ves a \"Wallet\" → \"Spot Wallet\"\n2. Fes clic a \"Convert to BNB\" (icona de tres punts)\n3. Accedeix a l'historial de dust conversion\n4. Exporta l'historial\n\n> **Nota fiscal:** Cada dust conversion és una permuta fiscal que genera guany/pèrdua patrimonial, encara que les quantitats siguin petites.\n\n### Pas 4: Exportar historial d'Earn (Savings, Staking, Lending)\n\nPer exportar les teves recompenses de productes Earn:\n\n1. Ves a \"Earn\" → \"Simple Earn\" (o \"Savings\" si és un compte antic)\n2. Fes clic a \"History\"\n3. Selecciona:\n   - **Type:** Interest (interessos rebuts)\n   - **Date:** Rang complet\n4. Exporta l'historial en CSV\n\nPer a Staking:\n\n1. Ves a \"Earn\" → \"Staking\"\n2. Accedeix a \"Staking History\"\n3. Filtra per Status: All, Asset: All\n4. Exporta el fitxer\n\nRecorda que cada recompensa rebuda és un ingrés fiscal que s'ha de valorar al preu de mercat del dia de recepció, tal com expliquem a la nostra [guia sobre fiscalitat DeFi](/blog/fiscalidad-defi-espana).\n\n### Pas 5: Verificar que no faltin dades\n\nAbans d'acabar, verifica:\n\n- ✅ Has exportat dades de tots els anys en què has utilitzat Binance\n- ✅ No hi ha \"buits\" en les dates (exportacions consecutives sense gaps)\n- ✅ Has exportat tots els tipus d'operacions que vas realitzar\n- ✅ Els fitxers CSV s'obren correctament i contenen dades\n- ✅ El nombre d'operacions coincideix amb el teu record aproximat\n\n---\n\n## Com interpretar els fitxers CSV de Binance\n\nUn cop descarregats els fitxers, necessites entendre la seva estructura per processar-los correctament.\n\n### Conversió de dates UTC a hora local espanyola\n\nBinance exporta totes les dates en **UTC (Coordinated Universal Time)**. Per a Espanya:\n\n- **Horari d'hivern:** UTC + 1 hora\n- **Horari d'estiu:** UTC + 2 hores\n\nAixò és important per determinar l'any fiscal correcte d'operacions properes a final d'any.\n\n**Exemple:**\n- Operació a Binance: 2024-12-31 23:30:00 UTC\n- Hora a Espanya (hivern): 2025-01-01 00:30:00\n- **Any fiscal:** 2025 (no 2024)\n\n### Identificació d'operacions fiscalment rellevants\n\n**Esdeveniments que generen guany/pèrdua patrimonial:**\n- ✅ SELL (venda de cripto a fiat o stablecoin)\n- ✅ Swap/Convert (intercanvi cripto-a-cripto)\n- ✅ Dust conversion (conversió a BNB)\n- ✅ Ús de cripto per pagar comissions\n\n**Esdeveniments que NO generen tributació immediata:**\n- ❌ BUY (compra de cripto amb fiat)\n- ❌ Deposit (dipòsit)\n- ❌ Transferència interna entre wallets de Binance\n\n**Esdeveniments que generen rendiments:**\n- ✅ Recompenses de staking\n- ✅ Interessos de savings\n- ✅ Airdrops\n- ✅ Recompenses per referits\n\nSi necessites ajuda per [classificar correctament cada tipus d'operació](/blog/clasificar-operaciones-criptomonedas), la nostra guia especialitzada t'explica en detall els criteris fiscals aplicables.\n\n### Problemes comuns amb els fitxers CSV de Binance\n\nAlguns fitxers utilitzen el format `DD/MM/YYYY`, altres `YYYY-MM-DD`. Normalitza totes les dates a un únic format abans de processar-les fent servir Excel, Google Sheets o [eines fiscals especialitzades](/blog/herramientas-rastrear-criptomonedas).\n\nBinance utilitza el punt (`.`) com a separador decimal, però l'Excel en espanyol utilitza la coma (`,`). En obrir el CSV, especifica el format \"English (United States)\" per als números.\n\nLes comissions es poden pagar en diferents monedes (BTC, BNB, USDT). Cada comissió s'ha de valorar al preu de mercat del moment.\n\nLes ordres grans es poden executar en múltiples \"fills\" parcials. Cada fill apareix com una línia separada al CSV. Per calcular el preu mitjà d'adquisició, utilitza la mitjana ponderada.\n\n**Exemple:**\n- Ordre: Comprar 1 BTC a preu de mercat\n- Fill 1: 0,4 BTC a 54.900€\n- Fill 2: 0,6 BTC a 55.100€\n- **Preu mitjà:** (0,4×54.900 + 0,6×55.100) / 1 = 55.020€\n\n---\n\n## Errors crítics en exportar dades de Binance (i com evitar-los)\n\nAquests són els errors més comuns que cometen els usuaris en exportar el seu historial de Binance amb finalitats fiscals.\n\n### Error 1: Exportar només un any quan has operat diversos\n\nMolts usuaris només exporten dades de l'any fiscal actual, ignorant anys anteriors. Això és greu perquè no podràs calcular correctament el cost d'adquisició si vas comprar criptomonedes en anys previs. El mètode FIFO requereix l'historial complet des de la teva primera compra.\n\n**Solució:**\n- Exporta dades des de la teva **primera operació a Binance** fins avui\n- Si fa anys que utilitzes Binance, divideix les exportacions per trimestres\n\n### Error 2: Oblidar exportar les conversions (Convert)\n\nAlguns usuaris només exporten trades del mercat spot, oblidant completament les conversions instantànies. Això és particularment greu perquè cada conversió cripto-a-cripto és una permuta fiscal.\n\nSi has utilitzat freqüentment la funció Convert, aquestes operacions poden representar entre el 30% i el 40% dels teus esdeveniments fiscals totals.\n\n**Solució:**\n- Exporta sempre Convert History a més de Trade History\n- Inclou també les dust conversions encara que impliquin quantitats petites\n\n### Error 3: No exportar staking i earn si has utilitzat aquests productes\n\nEls rendiments de staking es consideren ingressos fiscals que s'han de declarar com a rendiments del capital mobiliari, tributant a la base general de l'IRPF. No declarar-los constitueix una omissió fiscal sancionable.\n\n**Solució:**\n- Si has utilitzat Staking, Savings, Launchpool, Vault o Lending: exporta tots aquests historials\n- Valora cada recompensa rebuda al preu de mercat del dia\n\n### Error 4: No convertir els preus a euros\n\nHisenda requereix que totes les operacions es declarin en **euros (EUR)**, utilitzant el tipus de canvi del dia i hora exactes de cada operació.\n\n**Solució:**\n- Per a cada operació, busca el preu EUR de la criptomoneda en aquell moment\n- Fonts fiables: CoinMarketCap Historical Data, CoinGecko, Kraken\n- Eines com Koinly o CryptoTax fan això automàticament\n\n### Error 5: No guardar evidències de les exportacions\n\nEn cas d'inspecció, necessites demostrar que les dades són oficials i provenen directament de Binance.\n\n**Solució:**\n- Fes captures de pantalla del procés d'exportació\n- Guarda els correus de confirmació que Binance envia\n- Anota la data d'exportació al nom del fitxer\n- Conserva els fitxers originals sense modificar\n\n### Error 6: No verificar la coherència de les dades exportades\n\nBinance pot tenir ocasionalment problemes tècnics que generin exportacions incompletes, operacions mancants o registres duplicats.\n\n**Solució:**\n- Verifica que el nombre d'operacions coincideixi amb la teva activitat aproximada\n- Comprova que no hi hagi gaps de dates entre exportacions consecutives\n- Suma els saldos finals i verifica que coincideixin amb la teva wallet actual\n\n---\n\n## Com organitzar i processar les dades exportades\n\nUn cop tens tots els fitxers CSV descarregats, necessites organitzar-los sistemàticament i processar-los per convertir-los en informació fiscal útil.\n\n### Estructura de carpetes recomanada\n\nOrganitza els teus fitxers en una estructura jeràrquica clara:\n\n```\n📁 Binance_Fiscal_2024/\n├── 📁 1_Originales/\n│   ├── 📄 Binance_Transactions_2024_Q1.csv\n│   ├── 📄 Binance_Transactions_2024_Q2.csv\n│   ├── 📄 Binance_TradeHistory_2024_Q1.csv\n│   ├── 📄 Binance_ConvertHistory_2024.csv\n│   ├── 📄 Binance_StakingHistory_2024.csv\n│   └── ...\n├── 📁 2_Procesados/\n│   ├── 📄 Todas_Transacciones_Consolidadas.xlsx\n│   ├── 📄 Trades_con_EUR.xlsx\n│   └── ...\n├── 📁 3_Evidencias/\n│   ├── 📄 Captura_exportacion_1.png\n│   ├── 📄 Email_confirmacion_Binance.pdf\n│   └── ...\n└── 📁 4_Informe_Final/\n    └── 📄 Resumen_Fiscal_Binance_2024.xlsx\n```\n\n### Consolidació de múltiples fitxers CSV\n\nSi has exportat múltiples fitxers del mateix tipus (diversos trimestres de Trade History), necessites consolidar-los en un únic fitxer per facilitar l'anàlisi.\n\n**Opció 1: Manualment amb Excel/Google Sheets**\n\n1. Obre tots els CSV del mateix tipus\n2. Copia i enganxa les files en una única fulla\n3. Elimina encapçalaments duplicats\n4. Ordena per data (més antiga primer)\n5. Verifica que no hi hagi duplicats\n\n**Opció 2: Amb eines de processament**\n\n- **Python + Pandas:** Per a usuaris tècnics\n- **Power Query (Excel):** Integració automàtica de múltiples CSV\n- **Google Sheets Apps Script:** Automatització de la consolidació\n\n### Conversió a euros (EUR)\n\nPer a cada operació, necessites afegir columnes amb valors en EUR:\n\n**Columnes a afegir:**\n- Precio_EUR: Preu unitari en euros\n- Valor_Total_EUR: Valor total de l'operació en euros\n- Comision_EUR: Comissió pagada en euros\n\n**Fonts de cotitzacions històriques:**\n\n1. **CoinMarketCap Historical Data:** Ves a la pàgina de la criptomoneda → \"Historical Data\" → Busca la data específica\n2. **CoinGecko:** Similar a CoinMarketCap amb API disponible\n3. **Exchanges amb parells EUR:** Kraken (BTC/EUR, ETH/EUR), Bitstamp, Coinbase Pro\n\n**Per a parells sense cotització directa en EUR:**\n\n**Exemple:** Operes amb ADAUSDT el 15 de març de 2024\n\n1. Busca el preu ADA/USDT d'aquell dia: 0,65 USDT\n2. Busca el preu USDT/EUR d'aquell dia: 0,92 EUR\n3. Preu ADA/EUR = 0,65 × 0,92 = **0,598 EUR**\n\n### Càlcul de guanys i pèrdues amb el mètode FIFO\n\nEspanya obliga a utilitzar el **mètode FIFO (First In, First Out)**: les primeres criptomonedes que vas comprar són les primeres que vens.\n\n**Exemple simplificat:**\n\n**Compres:**\n- 10/01/2024: Compres 0,5 BTC a 40.000€ = 20.000€\n- 15/02/2024: Compres 0,3 BTC a 45.000€ = 13.500€\n- **Total en cartera:** 0,8 BTC, cost total 33.500€\n\n**Venda:**\n- 20/03/2024: Vens 0,6 BTC a 50.000€ = 30.000€\n\n**Càlcul FIFO:**\n- Vens primer els 0,5 BTC comprats el 10/01 (cost: 20.000€)\n- Després vens 0,1 BTC dels 0,3 comprats el 15/02 (cost proporcional: 13.500€ × 0,1/0,3 = 4.500€)\n- **Cost total d'adquisició:** 20.000€ + 4.500€ = 24.500€\n- **Guany patrimonial:** 30.000€ - 24.500€ = **5.500€**\n- **IRPF a pagar (19%):** 1.045€\n\n**Et queden en cartera:**\n- 0,2 BTC (de la compra del 15/02) amb un cost de 9.000€\n\n### Eines per automatitzar el processament\n\nSi tens moltes operacions, el processament manual és inviable. Aquestes eines et poden ajudar:\n\n**Eines fiscals especialitzades:**\n\n1. **Koinly** (recomanat)\n   - Importació directa des de Binance (API o CSV)\n   - Càlcul automàtic de FIFO\n   - Generació d'informes fiscals adaptats a Espanya\n   - Preu: des de 50€/any segons nombre d'operacions\n\n2. **CryptoTax, Accointing, CoinTracking**\n   - Suport per a múltiples exchanges\n   - Generació d'informes per al model 100\n\n**Avantatges:**\n- ✅ Conversió automàtica a EUR amb cotitzacions històriques\n- ✅ Aplicació correcta del mètode FIFO\n- ✅ Identificació automàtica de tipus d'operació\n- ✅ Generació d'informes llestos per a la declaració\n- ✅ Estalvi de desenes o centenars d'hores de treball manual\n\n**Desavantatges:**\n- ❌ Cost (encara que molt inferior al d'un assessor fiscal)\n- ❌ Corba d'aprenentatge inicial\n- ❌ Cal verificar que els càlculs siguin correctes\n\nSi prefereixes un [servei personalitzat de processament i anàlisi de les teves dades](/servicios/analisis-carteras), a Cleriontax estem especialitzats a integrar dades de múltiples fonts i generar informes fiscals complets adaptats a la teva situació específica.\n\n---\n\n## Verificació de la integritat de les dades exportades\n\nAbans d'utilitzar les dades per a la teva declaració fiscal, has de verificar exhaustivament que estan completes i són coherents.\n\n### Checklist de verificació\n\n**1. Completesa temporal**\n\n- ✅ El primer registre coincideix amb la teva primera operació a Binance\n- ✅ L'últim registre és recent (dies abans de l'exportació)\n- ✅ No hi ha gaps (buits) de dates entre fitxers consecutius\n\n**2. Consistència de saldos**\n\nVerificació manual:\n\n1. Suma tots els dipòsits de BTC\n2. Resta totes les retirades de BTC\n3. Suma/resta operacions de compra-venda de BTC\n4. El resultat ha de coincidir amb el teu saldo actual de BTC a Binance\n\n**Exemple:**\n```\nDipòsits BTC: +1.5 BTC\nRetirades BTC: -0.3 BTC\nCompres BTC (amb USDT): +0.2 BTC\nVendes BTC (a EUR): -0.8 BTC\nSaldo calculat: 0.6 BTC\nSaldo real a Binance: 0.6 BTC ✅\n```\n\nSi no coincideix, revisa:\n- Operacions de Convert no exportades\n- Comissions pagades en BTC\n- Transferències internes entre productes (Spot ↔ Earn)\n\n**3. Coherència de valors**\n\n- ✅ Tots els preus són positius\n- ✅ Les dates estan en ordre cronològic\n- ✅ No hi ha valors exageradament alts o baixos\n- ✅ Les comissions són coherents (típicament 0,1% en Spot)\n\n### Reconciliació amb extractes bancaris\n\nPer a dipòsits i retirades fiat (EUR), verifica:\n\n1. Exporta el teu historial de Transaction History filtrant per EUR\n2. Compara amb els teus extractes bancaris\n3. Cada dipòsit fiat a Binance ha de correspondre a una transferència sortint del teu banc\n4. Cada retirada fiat de Binance ha de correspondre a un ingrés al teu banc\n\nSi hi ha discrepàncies, poden deure's a:\n- Comissions bancàries no reflectides a Binance\n- Retards en el processament (dies diferents)\n- Conversions de divisa si el teu banc és en una altra zona\n\n---\n\n## Preparació de l'informe fiscal final\n\nUn cop tens totes les dades exportades, processades i verificades, el pas final és preparar el document consolidat que utilitzaràs per a la teva declaració.\n\n### Resum consolidat recomanat\n\nCrea un document Excel o PDF amb:\n\n**1. Resum executiu:**\n- Període fiscal cobert\n- Nombre total d'operacions\n- Guany/pèrdua patrimonial total\n- Rendiments rebuts (staking, earn)\n- Saldo final a 31 de desembre\n\n**2. Detall de guanys patrimonials:**\n\n| Data | Operació | Cripto | Quantitat | Preu Venda EUR | Cost Adquisició EUR | Guany/Pèrdua EUR |\n|-------|-----------|--------|----------|-----------------|----------------------|---------------------|\n| 15/03 | Venda BTC | BTC | 0.5 | 27.500€ | 20.000€ | +7.500€ |\n| ... | ... | ... | ... | ... | ... | ... |\n\n**Total guanys patrimonials:** XXXXX€\n\n**3. Detall de rendiments:**\n\n| Data | Tipus | Cripto | Quantitat | Valor EUR |\n|-------|------|--------|----------|----------|\n| 10/01 | Staking ETH | ETH | 0.05 | 115€ |\n| ... | ... | ... | ... | ... |\n\n**Total rendiments:** XXXXX€\n\n**4. Saldos a 31 de desembre:**\n\n| Criptomoneda | Quantitat | Preu 31/12 | Valor EUR |\n|--------------|----------|--------------|----------|\n| BTC | 0.3 | 42.000€ | 12.600€ |\n| ETH | 2.5 | 2.200€ | 5.500€ |\n| ... | ... | ... | ... |\n\n**Total valor cartera:** XXXXX€\n\n*(Important per determinar si has de presentar [model 721](/blog/modelos-100-721-714-criptomonedas))*\n\n### Documentació de suport a conservar\n\nGuarda durant **almenys 4 anys** (millor 6 anys):\n\n- ✅ Tots els fitxers CSV originals descarregats de Binance\n- ✅ Captures de pantalla del procés d'exportació\n- ✅ Correus de confirmació de Binance\n- ✅ Fulls de càlcul amb conversions a EUR i fonts utilitzades\n- ✅ Informes generats per eines fiscals (Koinly, etc.)\n- ✅ Extractes bancaris de dipòsits/retirades fiat\n- ✅ Documentació de cotitzacions històriques\n\n### Integració en el model 100 (declaració de la renda)\n\nPer integrar el teu informe a la declaració de la renda:\n\n- **Guanys patrimonials (casella 389):** Inclou el total de guanys patrimonials calculats\n- **Rendiments del capital mobiliari (caselles 027-028):** Inclou el total de rendiments per staking, savings, earn\n\nPots adjuntar el teu resum consolidat en format PDF com a documentació de suport quan presentis la declaració.\n\nSi necessites ajuda professional per [preparar la teva liquidació fiscal completa](/servicios/liquidaciones-fiscales), el nostre equip pot encarregar-se de tot el procés des de l'anàlisi de dades fins a la presentació dels models oficials.\n\n---\n\n## Casos especials i situacions complexes\n\n### Si has perdut l'accés al teu antic compte de Binance\n\nPerdre l'accés a un compte antic de Binance és més comú del que sembla.\n\n**Solucions:**\n\n1. **Recuperació de compte:**\n   - Contacta amb el suport de Binance (support@binance.com)\n   - Proporciona tota la informació de verificació possible\n   - El procés pot trigar setmanes\n\n2. **Reconstrucció amb informació bancària:**\n   - Utilitza els teus extractes bancaris per identificar dipòsits/retirades fiat\n   - Fes servir eines d'anàlisi blockchain si vas fer dipòsits/retirades cripto\n   - Estima operacions basant-te en la memòria i captures antigues\n\n3. **Assessorament legal:**\n   - Si Binance no coopera, consulta amb un advocat especialitzat\n   - En casos extrems, sol·licita que Binance proporcioni les dades per requeriment legal\n\n### Si has utilitzat Binance abans de completar el KYC\n\nSi vas operar a Binance quan encara permetia trading sense verificació completa, continues estant obligat a declarar, encara que no tinguis accés a exportacions històriques.\n\n**Solució:**\n- Intenta completar el KYC ara per accedir als historials\n- Si no és possible, reconstrueix amb blockchain explorers (Etherscan, BscScan, etc.)\n- Declara de manera aproximada documentant la impossibilitat d'accedir a dades exactes\n\n### Si has operat amb múltiples comptes (teva i de familiars)\n\nCada compte de Binance ha de correspondre a un únic NIF/DNI. Utilitzar el compte d'una altra persona per operar amb els teus diners crea un problema fiscal significatiu.\n\n**Solució:**\n- Cada persona ha de tenir el seu propi compte verificat amb el seu DNI\n- Si ja has operat així, documenta transferències entre comptes bancaris per demostrar la titularitat real\n\n### Si has fet arbitratge entre Binance i altres exchanges\n\nL'arbitratge entre exchanges afegeix complexitat perquè implica múltiples transferències de criptomonedes que has de rastrejar acuradament.\n\n**Exemple:**\n1. Compres BTC a Kraken a 50.000€\n2. Transfereixes a Binance (no tributació)\n3. Vens a Binance a 50.500€ (guany: 500€)\n4. Compres ETH amb aquests USDT (permuta fiscal)\n5. Transfereixes ETH a Coinbase (no tributació)\n\n**Solució:**\n- Exporta historials de TOTS els exchanges utilitzats\n- Utilitza eines fiscals que admetin múltiples exchanges (Koinly, CryptoTax)\n- Identifica clarament les transferències inter-exchange per no duplicar operacions\n\n---\n\n## Conclusió: exportar correctament és el teu segur fiscal\n\nExportar correctament el teu historial complet de Binance no és només un requisit burocràtic: és la teva millor protecció davant possibles requeriments d'Hisenda i la base fonamental per a una [declaració fiscal correcta](/blog/errores-declarar-criptomonedas) que minimitzi la teva càrrega tributària dins del marc legal.\n\n### Punts clau a recordar\n\n- ✅ **Exporta-HO TOT:** No només trades, també conversions, staking, earn, distribucions\n- ✅ **Període complet:** Des de la teva primera operació fins avui, sense buits\n- ✅ **Múltiples tipus de fitxers:** Transaction History, Trade History, Convert, Earn, etc.\n- ✅ **Límit de 3 mesos:** Divideix exportacions llargues en trimestres\n- ✅ **Conversió a EUR:** Necessària per a la declaració espanyola\n- ✅ **Mètode FIFO obligatori:** Les primeres compres són les primeres vendes\n- ✅ **Conserva evidències:** CSV originals + captures + correus de confirmació\n- ✅ **Verifica coherència:** Els saldos finals han de coincidir amb la realitat\n- ✅ **Considera eines especialitzades:** Koinly, CryptoTax estalvien molt de temps\n- ✅ **Documentació de suport:** Guarda-ho tot durant 4–6 anys\n\n### El teu següent pas\n\nSi has exportat totes les teves dades de Binance però et sents aclaparat amb el processament, el càlcul FIFO, les conversions a EUR i la preparació de la teva declaració fiscal, no estàs sol.\n\nA Cleriontax som experts en fiscalitat de criptomonedes i processament de dades d'exchanges. El nostre [servei d'anàlisi i processament de dades](/servicios) et permet enviar els teus fitxers CSV i rebre un informe fiscal complet, verificat i llest per a la teva declaració.\n\n**Els nostres serveis inclouen:**\n\n- Processament complet de les teves exportacions CSV de Binance\n- Conversió automàtica de totes les operacions a EUR amb cotitzacions històriques verificades\n- Aplicació correcta del mètode FIFO segons normativa espanyola\n- Identificació i classificació fiscal de cada tipus d'operació\n- Càlcul exacte de guanys patrimonials i rendiments\n- Generació d'un informe fiscal complet llest per al model 100\n- Preparació del model 721 (criptomonedes a l'estranger) si escau\n- Revisió i validació de la integritat de dades\n- Suport davant requeriments de l'AEAT\n- Integració amb altres exchanges si has operat en múltiples plataformes\n\nTens milers d'operacions? Les nostres eines especialitzades i metodologies d'enginyeria de dades processen grans volums de transaccions amb precisió i eficiència.\n\nNo tens clar si has exportat tot correctament? Revisarem la teva exportació, identificarem possibles inconsistències i t'ajudarem a completar les dades que faltin.\n\n[Sol·licita la teva anàlisi de dades de Binance](/contacto)\n\nCompleix amb Hisenda sense estrès. Deixa que els experts processem les teves dades de Binance.\n\n---\n\n**Avís legal:** Aquest article té finalitat exclusivament informativa i educativa. No constitueix assessorament fiscal personalitzat. La normativa fiscal està subjecta a canvis i cada situació personal és única. Consulta sempre amb un assessor fiscal professional col·legiat abans de prendre decisions fiscals. Cleriontax no està afiliada amb Binance.\n\n---\n\n*Última actualització: novembre de 2025*\n\n*Publicat per: Equip Cleriontax - Experts en Fiscalitat Crypto i Anàlisi de Dades*"
}

