{
  "title": "Com declarar les teves criptomonedes a la renda 2025 pas a pas",
  "excerpt": "Guia completa per declarar criptomonedes a la renda 2025 segons la normativa de l’AEAT. Aprèn què declarar, com fer-ho i com evitar errors comuns.",
  "content": "Cada any, l’**Agència Tributària (AEAT)** reforça el control sobre els actius digitals i exigeix més transparència als inversors. Declarar les teves criptomonedes no és només una obligació legal, sinó també una garantia de seguretat patrimonial i fiscal.\n\nL’**AEAT** disposa d’informació proporcionada per exchanges nacionals i internacionals, cosa que significa que les operacions realitzades en plataformes centralitzades o descentralitzades poden ser detectades fàcilment. Per tant, no declarar les teves criptos pot comportar **sancions, recàrrecs o fins i tot inspeccions fiscals**.\n\n---\n\n## Per què és important declarar les teves criptomonedes\n\nDeclarar correctament les teves criptomonedes no només et protegeix de sancions, sinó que també et permet:\n\n- **Optimitzar la teva situació fiscal** i pagar exactament el que correspon segons la llei\n- **Evitar sancions econòmiques** que poden arribar fins al 150% de les quantitats no declarades\n- **Prevenir inspeccions fiscals** i procediments sancionadors de l’AEAT\n- **Garantir seguretat patrimonial** amb documentació fiscal completa i traçable\n\n> **Important:** L’AEAT disposa d’informació proporcionada per exchanges nacionals i internacionals. Les operacions en plataformes centralitzades i descentralitzades poden ser detectades fàcilment.\n\n---\n\n## Quan has de declarar les teves criptomonedes\n\nLes criptomonedes s’han de declarar quan existeix una **guany o pèrdua patrimonial** derivada de:\n\n- **Venda de criptomonedes** per euros o una altra moneda fiat\n- **Intercanvi entre criptomonedes** (per exemple, BTC per ETH)\n- **Ús de criptomonedes** per comprar béns o serveis\n- **Rendiments obtinguts** per staking, farming, airdrops o préstecs d’actius digitals\n\n### I si només mantinc les meves criptomonedes sense vendre?\n\nEncara que mantinguis les teves criptomonedes sense vendre (estratègia **HODL**), has d’informar sobre el seu valor i custòdia en determinats models informatius, especialment si superes certs llindars establerts per la normativa espanyola.\n\n**Models informatius a tenir en compte:**\n\n- **Model 720:** Si el valor dels teus actius en exchanges estrangers supera els 50.000 euros a 31 de desembre\n- **Model 721:** Obligatori per als proveïdors de serveis de custòdia (no per a inversors particulars)\n\n---\n\n## Com calcular els guanys o pèrdues\n\nL’**AEAT** exigeix utilitzar el mètode **FIFO** (First In, First Out) per determinar quines unitats de criptomonedes es venen primer. Aquest mètode implica que les primeres criptomonedes que vas comprar són les primeres que es consideren venudes.\n\n### El mètode FIFO pas a pas\n\n**Exemple pràctic:**\n\nImagina que realitzes les següents operacions amb Bitcoin:\n\n**Compres:**\n\n- Gener 2024: 0,5 BTC a 40.000 € (cost: 20.000 €)\n- Març 2024: 0,3 BTC a 50.000 € (cost: 15.000 €)\n\n**Venda:**\n\n- Juny 2024: 0,6 BTC a 60.000 € (ingrés: 36.000 €)\n\n**Aplicant FIFO:**\n\n1. Primer es venen els 0,5 BTC de gener:\n   - Ingrés: 0,5 × 60.000 = 30.000 €\n   - Cost: 20.000 €\n   - Guany: 10.000 €\n\n2. Després es venen 0,1 BTC de març:\n   - Ingrés: 0,1 × 60.000 = 6.000 €\n   - Cost: 0,1 × 50.000 = 5.000 €\n   - Guany: 1.000 €\n\n**Guany patrimonial total: 11.000 €**\n\n### Per què el càlcul FIFO és complex\n\nCalcular correctament els guanys i pèrdues és un dels passos més complexos, ja que requereix:\n\n- Analitzar l’historial complet de transaccions des del moment d’adquisició\n- Conciliar moviments entre diferents wallets i exchanges\n- Rastrejar operacions en múltiples blockchains\n- Aplicar tipus de canvi històrics per a cada transacció\n\nA **Cleriontax** automatitzem aquest procés i validem cada transacció per garantir informes precisos i traçables.\n\n---\n\n## Models fiscals que has de presentar\n\n### Model 100: Declaració de la Renda (IRPF)\n\nEl **model principal** on s’inclouen els guanys o pèrdues patrimonials derivades d’operacions amb criptomonedes.\n\n**Què incloure al Model 100:**\n\n- Guanys i pèrdues patrimonials per venda o intercanvi de criptomonedes\n- Rendiments del capital mobiliari per staking, lending i altres fonts passives\n- Rendiments del treball si reps criptomonedes com a salari\n\n### Model 721: Béns i drets a l’estranger\n\nObligatori per a **proveïdors de serveis** de custòdia de criptomonedes, exchanges espanyols i plataformes que facilitin operacions amb criptoactius.\n\n**Important:** Els inversors particulars **NO han de presentar** el Model 721.\n\n### Model 714: Impost sobre el Patrimoni\n\nPot ser necessari presentar-lo segons el **tipus d’actiu, residència fiscal i volum d’operacions**.\n\n> **Recomanació:** Identificar correctament quins models s’apliquen a la teva situació és clau per evitar errors i sancions. Comptar amb assessorament especialitzat en fiscalitat cripto és fonamental.\n\n---\n\n## Errors més comuns en declarar criptomonedes\n\nEntre els errors més habituals es troben:\n\n### 1. No incloure els intercanvis entre criptomonedes\n\nMolts inversors creuen que només han de declarar quan converteixen criptomonedes a euros. **Error:** Els intercanvis entre criptomonedes (per exemple, BTC per ETH) també generen guanys o pèrdues patrimonials que s’han de declarar.\n\n### 2. Confondre moviments interns amb vendes\n\nTransferir criptomonedes d’un wallet a un altre que controles **NO genera** cap fet imposable. Tot i això, és comú confondre aquestes transferències amb vendes.\n\n**Exemples que NO tributen:**\n\n- Transferir Bitcoin de Binance al teu hardware wallet Ledger\n- Moure Ethereum de MetaMask a Trezor\n- Consolidar fons de diversos wallets en un de sol\n\n### 3. Utilitzar informes automàtics amb errors de càlcul\n\nAlguns exchanges ofereixen informes fiscals automàtics que poden contenir errors en:\n\n- Aplicació incorrecta del mètode FIFO\n- Tipus de canvi històrics inexactes\n- Transaccions duplicades o absents\n- Classificació incorrecta d’operacions\n\n### 4. No declarar rendiments de staking o lending\n\nEls rendiments passius obtinguts per staking, lending o farming s’han de declarar com a **rendiments del capital mobiliari**, no com a guanys patrimonials.\n\n> **Solució:** A Cleriontax revisem i depurem totes les dades abans d’elaborar l’informe fiscal final, aplicant criteris fiscals actualitzats i verificant que les operacions compleixen les normes de l’AEAT.\n\n---\n\n## Escales de tributació per al 2025\n\nEls guanys patrimonials de criptomonedes tributen a la **Base de l’Estalvi** amb els següents tipus:\n\n| Base imposable | Tipus aplicable |\n|---|---|\n| Fins a 6.000 € | 19% |\n| De 6.000 € a 50.000 € | 21% |\n| De 50.000 € a 200.000 € | 23% |\n| De 200.000 € a 300.000 € | 27% |\n| Més de 300.000 € | 28% |\n\n**Exemple de càlcul:**\n\nSi has obtingut un guany patrimonial de 15.000 € per la venda de criptomonedes:\n\n- Primers 6.000 € al 19% = 1.140 €\n- Següents 9.000 € al 21% = 1.890 €\n- **Total a pagar: 3.030 €**\n\n---\n\n## Terminis i dates importants per al 2025\n\n**Model 100 (IRPF):**\n\n- De l’**11 d’abril al 30 de juny de 2025**\n- Domiciliació bancària: fins al 25 de juny\n\n**Model 720 (Béns a l’estranger):**\n\n- De l’**1 de gener al 31 de març de 2025**\n- Només si superes 50.000 € en exchanges estrangers a 31 de desembre de 2024\n\n> **Recordatori:** Presentar fora de termini comporta recàrrecs del 5% al 20% segons el retard, més interessos de demora.\n\n---\n\n## Conclusió: ordre, traçabilitat i seguretat fiscal\n\nLa clau per declarar correctament les teves criptomonedes és disposar de:\n\n- **Dades organitzades:** Historial complet de totes les teves transaccions a tots els exchanges i wallets\n- **Criteris fiscals clars:** Aplicació correcta del mètode FIFO i classificació adequada de les operacions\n- **Traçabilitat completa:** Conciliació de moviments entre plataformes i blockchains\n- **Assessorament especialitzat:** Experts en fiscalitat cripto que coneguin la normativa actualitzada de l’AEAT\n\nLa fiscalitat cripto evoluciona constantment, i comptar amb un equip especialitzat marca la diferència entre un informe segur i un risc innecessari.\n\n---\n\n## Cleriontax: experts en fiscalitat de criptomonedes\n\nA **Cleriontax** t’ajudem a transformar el caos de dades de les teves wallets i exchanges en un **informe fiscal exacte, verificat i llest per presentar** davant l’AEAT.\n\n**El nostre procés automatitzat:**\n\n- Importació automàtica des de més de 50 exchanges i wallets\n- Conciliació i neteja de dades amb algoritmes propis\n- Aplicació correcta del mètode FIFO per a cada operació\n- Classificació precisa de guanys patrimonials vs. rendiments\n- Generació d’informes llestos per incloure a la teva declaració\n- Revisió per assessors fiscals col·legiats especialitzats en cripto\n\n**[Sol·licita el teu informe fiscal →](/ca/contacte)**\n\nContacta amb el nostre equip i obtén una valoració inicial sense compromís. T’explicarem exactament què necessites fer i com podem ajudar-te a declarar les teves criptomonedes correctament.\n\n---\n\n**Avís legal:** Aquest article té finalitat exclusivament informativa i educativa. No constitueix assessorament fiscal personalitzat ni recomanació d’inversió. La normativa fiscal està subjecta a canvis i cada situació personal és única. Consulta sempre amb un assessor fiscal professional col·legiat per al teu cas específic.\n\n---\n\n*Última actualització: Octubre 2025*\n\n*Publicat per: Equip Cleriontax - Experts en Fiscalitat de Criptomonedes i Anàlisi de Dades*"
}