{
  "title": "Errors més comuns en declarar criptomonedes davant Hisenda (i com evitar-los)",
  "excerpt": "Descobreix els errors més habituals en declarar criptomonedes davant l’AEAT i aprèn com evitar-los per garantir una declaració fiscal precisa i segura.",
  "content": "La **complexitat de l’ecosistema cripto** i la manca de criteris uniformes fan que declarar criptomonedes davant l’AEAT sigui un procés propens a errors. Milers d’inversors utilitzen dades incompletes o informes automàtics sense revisar, cosa que pot derivar en **discrepàncies fiscals**.\n\nEl problema més comú és la **manca de traçabilitat**: moviments entre wallets, swaps i operacions DeFi no sempre queden reflectits correctament. Sense una revisió professional, és fàcil ometre transaccions o duplicar registres, cosa que afecta directament el resultat de la declaració de la renda.\n\n---\n\n## Per què es cometen tants errors en declarar criptomonedes\n\nDeclarar criptomonedes no és com declarar accions o fons d’inversió tradicionals. L’ecosistema cripto presenta desafiaments únics:\n\n- **Múltiples wallets i exchanges:** La majoria d’inversors tenen criptomonedes distribuïdes en diverses plataformes\n- **Operacions complexes:** Staking, farming, airdrops, NFTs, cadascuna amb un tractament fiscal diferent\n- **Manca d’informes oficials:** A diferència dels bancs, els exchanges no sempre proporcionen certificats fiscals\n- **Moviments entre blockchains:** Els ponts (bridges) i conversions compliquen la traçabilitat\n- **Tokens sense valor de mercat:** Molts tokens rebuts no tenen un preu oficial en el moment de la transacció\n\nA més, la **normativa fiscal evoluciona constantment**, i allò que era vàlid fa un any pot no ser-ho ara. L’AEAT actualitza els seus criteris regularment, i mantenir-se al dia requereix coneixement especialitzat.\n\n---\n\n## Errors més freqüents en les declaracions cripto\n\nAquests són els **6 errors més comuns** que detectem en revisar declaracions de criptomonedes:\n\n1. **No incloure els intercanvis entre criptomonedes**, creient que només s’han de declarar les conversions a euros.\n\n2. **Confondre els moviments interns entre wallets amb vendes o permutes reals.** Transferir BTC de Binance al teu Ledger NO és una venda.\n\n3. **Utilitzar preus de mercat incorrectes o dates d’adquisició errònies.** Un error de data pot canviar completament el càlcul FIFO.\n\n4. **No declarar els rendiments de staking, airdrops o farming.** Aquests es consideren rendiments del capital mobiliari.\n\n5. **No tenir en compte les comissions de transacció en calcular els guanys o pèrdues.** Les gas fees redueixen el teu guany patrimonial.\n\n6. **Presentar informes automàtics sense revisió manual de les dades o amb tokens no reconeguts per l’AEAT.** Les eines automàtiques cometen errors amb freqüència.\n\n### Exemple real d’un error comú\n\n**Cas típic:**\n\nUn inversor compra 1 ETH a Coinbase per 2.000 €, el transfereix a la seva wallet MetaMask (paga 15 € de gas), després l’intercanvia per 50 tokens XYZ a Uniswap (paga 20 € de gas), i finalment ven els 50 XYZ per 2.500 € en un altre exchange.\n\n**Error freqüent:**\n\nNomés declarar la venda final de 2.500 € sense considerar:\n- El cost d’adquisició inicial (2.000 €)\n- Les comissions de gas (35 € en total)\n- L’intercanvi ETH → XYZ com a fet imposable\n\n**Declaració correcta:**\n\n1. **Primera operació:** ETH → XYZ\n   - Cost ETH: 2.015 € (2.000 + 15 gas)\n   - Valor XYZ rebut: 1.980 € (valor de mercat en el moment del swap)\n   - Pèrdua: -35 €\n\n2. **Segona operació:** Venda XYZ\n   - Cost: 2.000 € (1.980 + 20 gas)\n   - Venda: 2.500 €\n   - Guany: 500 €\n\n**Guany patrimonial total: 465 €** (500 - 35)\n\n---\n\n## Conseqüències fiscals de cometre errors\n\nUn **informe incorrecte** pot derivar en:\n\n- **Sancions econòmiques:** Del 50% al 150% de la quantitat no declarada\n- **Recàrrecs per presentació fora de termini:** Del 5% al 20% segons el retard\n- **Requeriments d’informació addicional:** Hisenda pot sol·licitar justificants de totes les teves operacions\n- **Inspeccions fiscals:** En casos de discrepàncies greus o reiterades\n- **Interessos de demora:** S’apliquen sobre les quantitats no ingressades\n\nEls errors en els càlculs o la **omissió d’operacions** solen ser detectats fàcilment per Hisenda gràcies al creuament de dades amb exchanges nacionals i internacionals.\n\n> **Important:** L’AEAT disposa d’informació proporcionada per exchanges com Coinbase, Binance, Kraken i altres plataformes que operen a Espanya. Les discrepàncies entre la teva declaració i les dades d’Hisenda activen alertes automàtiques.\n\nA més, els errors reiterats poden considerar-se **negligència o frau fiscal**, cosa que incrementa significativament la quantia de les sancions. Per això, és fonamental presentar una declaració completa, coherent i recolzada per un informe fiscal verificat.\n\n---\n\n## Com evitar errors en declarar criptomonedes\n\nLa clau és treballar amb **dades organitzades, preus de mercat correctes i criteris fiscals actualitzats**.\n\n### Checklist abans de generar el teu informe fiscal:\n\n- ✅ **Recopila totes les teves transaccions** de tots els exchanges i wallets\n- ✅ **Identifica moviments interns** vs. operacions amb impacte fiscal\n- ✅ **Classifica correctament** cada tipus d’operació (compra, venda, swap, staking, etc.)\n- ✅ **Verifica els preus de mercat** històrics de cada transacció\n- ✅ **Aplica correctament el FIFO** per calcular guanys i pèrdues\n- ✅ **Inclou totes les comissions** (gas fees, trading fees, etc.)\n- ✅ **Revisa tokens sense valor** o amb dades incompletes\n- ✅ **Valida la coherència** entre diferents plataformes\n\nAbans de generar el teu informe fiscal, revisa que tots els moviments estiguin classificats correctament (compres, vendes, swaps, rendiments, etc.).\n\n**A Cleriontax revisem cada operació**, identifiquem possibles inconsistències i corregim errors en les dades per generar un informe fiscal exacte i traçable, validat segons la normativa vigent.\n\n### El nostre procés de validació inclou:\n\n1. **Anàlisi automàtica inicial** de totes les teves transaccions\n2. **Detecció d’anomalies** (preus fora de rang, duplicats, etc.)\n3. **Revisió manual** per assessors fiscals especialitzats\n4. **Classificació fiscal precisa** de cada tipus d’operació\n5. **Validació creuada** entre diferents fonts de dades\n6. **Generació de l’informe final** llest per incloure a la teva declaració\n\n---\n\n## Què fer si ja has comès un error en la teva declaració\n\nSi has detectat un error en una declaració anterior, **no esperis que Hisenda t’ho notifiqui**. Pots presentar:\n\n### Declaració complementària\n\nSi descobreixes que has omès operacions o ingressos que resulten en una quota a pagar més alta:\n\n- Es pot presentar en qualsevol moment\n- Inclou recàrrec i interessos de demora\n- El recàrrec és menor si es presenta voluntàriament (del 5% al 20%)\n\n### Declaració rectificativa (sol·licitud de rectificació)\n\nSi descobreixes que has pagat de més o has comès errors que no impliquen pagar més:\n\n- S’ha de sol·licitar abans que prescrigui el dret (normalment 4 anys)\n- Hisenda pot retornar les quantitats ingressades en excés\n- No comporta recàrrecs ni sancions\n\nL’important és **fer-ho abans de rebre un requeriment d’Hisenda**. La presentació voluntària redueix significativament les penalitzacions.\n\n**El nostre equip pot ajudar-te a:**\n\n- Revisar i analitzar la teva declaració anterior\n- Identificar els errors específics\n- Refer l’informe fiscal correctament\n- Preparar la declaració complementària o rectificativa\n- Assessorar-te durant tot el procés\n\nAixò **redueix el risc de sanció** i demostra bona fe davant l’AEAT.\n\n---\n\n## Conclusió: revisió i exactitud, les claus d’una declaració segura\n\nDeclarar criptomonedes correctament requereix **més que un arxiu automàtic**: implica coneixement fiscal, validació de dades i traçabilitat completa.\n\nEvitar errors no només t’estalvia sancions, sinó que també:\n\n- **Demostra compliment** i transparència davant Hisenda\n- **Optimitza la teva situació fiscal** pagant exactament el que correspon\n- **Evita futures inspeccions** i procediments sancionadors\n- **Garanteix seguretat patrimonial** amb documentació completa\n\nLa diferència entre un informe automàtic i un de revisat professionalment pot suposar **milers d’euros en sancions evitades** i tranquil·litat garantida.\n\n---\n\n## Cleriontax: garantim l’exactitud de la teva declaració\n\nA **Cleriontax** no només generem informes fiscals, sinó que els **validem i verifiquem** per garantir que cada dada sigui correcta i cada operació estigui ben classificada.\n\n**El nostre compromís:**\n\n- ✅ Revisió manual de totes les dades per assessors fiscals col·legiats\n- ✅ Detecció i correcció d’errors abans de generar l’informe\n- ✅ Aplicació correcta del FIFO i criteris fiscals actualitzats\n- ✅ Informes traçables i recolzats per documentació completa\n- ✅ Assistència en cas de requeriments de l’AEAT\n\n**[Sol·licita una revisió del teu informe fiscal →](/ca/contacte)**\n\nContacta amb el nostre equip i obtén una valoració inicial sense compromís. T’explicarem exactament què necessites fer i com podem ajudar-te a declarar correctament les teves criptomonedes.\n\n---\n\n**Avís legal:** Aquest article té una finalitat exclusivament informativa i educativa. No constitueix assessorament fiscal personalitzat ni recomanació d’inversió. La normativa fiscal està subjecta a canvis i cada situació personal és única. Consulta sempre amb un assessor fiscal professional col·legiat per al teu cas específic.\n\n---\n\n*Última actualització: Octubre 2025*\n\n*Publicat per: Equip Cleriontax - Experts en Fiscalitat de Criptomonedes i Anàlisi de Dades*"
}
