{
  "title": "Fiscalitat DeFi a Espanya: com tributen els teus rendiments el 2025",
  "excerpt": "Descobreix com tributen les operacions DeFi a Espanya el 2025. Expliquem la fiscalitat del staking, yield farming, airdrops i altres rendiments segons l’AEAT.",
  "content": "La **DeFi** (finances descentralitzades) ha revolucionat la manera d’invertir en criptomonedes, però també ha introduït nous reptes fiscals. A diferència de les operacions centralitzades, les plataformes DeFi funcionen sense intermediaris i generen rendiments que l’**AEAT** considera rendiments de capital o guanys patrimonials, segons el cas.\n\nAixò significa que cada moviment —des d’un staking fins a una provisió de liquiditat— pot tenir conseqüències fiscals diferents. Entendre aquesta diferència és clau per evitar errors i mantenir una traçabilitat completa de les teves operacions.\n\n---\n\n## Què és la fiscalitat DeFi i per què és diferent\n\nLa **fiscalitat DeFi** es refereix al tractament tributari que reben les operacions realitzades en protocols descentralitzats. Aquests protocols permeten realitzar préstecs, intercanvis, provisió de liquiditat i obtenció de rendiments sense necessitat d’intermediaris tradicionals com bancs o exchanges centralitzats.\n\nLa principal diferència rau en què:\n\n- Les transaccions queden registrades a la **blockchain**, cosa que facilita la traçabilitat però complica la identificació del tipus d’operació\n- Els rendiments poden generar-se de múltiples maneres: **staking, lending, farming, airdrops, NFTs**\n- L’AEAT exigeix classificar cada tipus de rendiment de manera diferent\n- No existeix cap intermediari que emeti un certificat fiscal, de manera que el contribuent ha de construir el seu propi informe\n\n---\n\n## Com tributen els interessos, comissions i recompenses\n\nEls interessos obtinguts per **staking o lending** es consideren **rendiments del capital mobiliari** i tributen a la base de l’estalvi, amb tipus que oscil·len entre el **19% i el 28%**, segons l’import total.\n\nEn canvi, les recompenses per **farming, airdrops o pools de liquiditat** poden tractar-se com a **guanys patrimonials**.\n\n### Taula de tributació 2025\n\n| Base imposable | Tipus aplicable |\n|---|---|\n| Fins a 6.000 € | 19% |\n| De 6.000 € a 50.000 € | 21% |\n| De 50.000 € a 200.000 € | 23% |\n| De 200.000 € a 300.000 € | 27% |\n| Més de 300.000 € | 28% |\n\n**Exemple pràctic:**\n\nImagina que obtens:\n\n- 2.000 € d’interessos per staking d’ETH\n- 1.500 € de recompenses per proveir liquiditat a Uniswap\n- 500 € d’airdrops de nous tokens\n\n**Classificació fiscal:**\n\n- Els 2.000 € d’staking: **rendiments del capital mobiliari** al 19%\n- Els 1.500 € de farming: **guanys patrimonials** al 19% (si es venen)\n- Els 500 € d’airdrops: **no tributen fins que es venguin o intercanviïn**\n\nCada protocol pot implicar un tractament diferent. Per exemple, els tokens obtinguts com a incentiu per proveir liquiditat no s’han de declarar fins que es venguin o intercanviïn, mentre que els interessos generats per staking sí que s’han de declarar anualment.\n\n---\n\n## Declarar operacions en protocols DeFi pas a pas\n\nEl primer pas per declarar correctament les teves operacions DeFi és **identificar la naturalesa de cada transacció**: inversió, rendiment o intercanvi. Per fer-ho, s’analitzen els moviments registrats a la blockchain i es classifiquen segons els criteris fiscals vigents.\n\n**Procés de declaració:**\n\n1. **Recopilar tots els moviments** de les teves wallets en cada blockchain (Ethereum, Polygon, BSC, etc.)\n2. **Classificar cada transacció** segons la seva naturalesa fiscal\n3. **Obtenir el valor de mercat** en euros en el moment de cada operació\n4. **Aplicar el mètode FIFO** per calcular guanys i pèrdues\n5. **Generar l’informe fiscal** amb tots els rendiments i guanys patrimonials\n6. **Incloure les dades** a la teva declaració de la renda (Model 100)\n\nA **Cleriontax** apliquem un procés de classificació detallat, combinant anàlisi automatitzada i revisió professional, per garantir que cada rendiment o guany es declari correctament segons la normativa espanyola.\n\n> **Important:** L’AEAT pot sol·licitar justificació de cada operació. És fonamental mantenir registres complets de totes les teves transaccions DeFi.\n\n---\n\n## Fiscalitat i traçabilitat en entorns multichain\n\nLa majoria d’inversors DeFi operen en diverses xarxes —**Ethereum, Polygon, BSC, Solana, Cosmos**—, cosa que complica la traçabilitat de les transaccions. L’AEAT exigeix poder justificar l’origen i el destí dels fons, així com el valor de mercat en cada moment.\n\n**Reptes de la fiscalitat multichain:**\n\n- **Ponts de liquiditat (bridges):** Transferir actius entre blockchains pot generar esdeveniments fiscals\n- **Tokens embolcallats (wrapped):** Convertir ETH en WETH o BTC en WBTC pot considerar-se un intercanvi\n- **Diferents exchanges descentralitzats:** Cada DEX registra les operacions de manera diferent\n- **Gas fees:** Les comissions pagades en tokens natius s’han de valorar en euros\n\nEl nostre equip consolida tota aquesta informació per oferir un **informe fiscal únic, coherent i compatible amb els requisits d’Hisenda**. Això inclou identificar transaccions creuades, ponts de liquiditat i conversions entre tokens de diferents cadenes.\n\n---\n\n## Claus per evitar errors en la declaració DeFi\n\nEls errors més comuns en la fiscalitat DeFi provenen de:\n\n- **Informes incomplets:** No incloure totes les wallets o blockchains utilitzades\n- **Manca de dades de preu:** No disposar del valor de mercat històric de cada token\n- **Classificació incorrecta:** Confondre rendiments amb guanys patrimonials\n- **Omissió d’airdrops:** Oblidar declarar tokens rebuts gratuïtament quan es venen\n- **No aplicar correctament el FIFO:** Errors en el càlcul del cost d’adquisició\n\nEn molts casos, les eines automàtiques no detecten moviments entre protocols o tokens sense valor de mercat.\n\n**Per això, a Cleriontax fem una validació exhaustiva** abans de generar l’informe fiscal final, assegurant que cada operació reflecteixi correctament el seu impacte tributari. El nostre objectiu és que declaris els teus rendiments DeFi amb total seguretat i conforme a la llei.\n\n---\n\n## Conclusió: claredat fiscal en l’ecosistema DeFi\n\nLa **fiscalitat DeFi** és complexa, però pot gestionar-se amb precisió si es treballa amb dades netes, classificades i revisades per experts. Cada operació compta, i una traçabilitat adequada evita sancions i garanteix confiança davant l’AEAT.\n\nLa clau està en:\n\n- **Traçabilitat completa** de totes les teves operacions\n- **Classificació correcta** de cada tipus de rendiment\n- **Valoració precisa** en euros de cada transacció\n- **Assessorament especialitzat** en fiscalitat cripto\n\nA **Cleriontax** t’ajudem a convertir els teus rendiments DeFi en un informe fiscal clar, complet i verificat, llest per presentar a la teva declaració de la renda 2025.\n\n---\n\n## Cleriontax: experts en fiscalitat DeFi\n\nA **Cleriontax** som especialistes en la fiscalitat d’operacions DeFi. El nostre equip combina expertesa en blockchain, anàlisi de dades i assessorament fiscal per oferir-te:\n\n- Anàlisi complet de les teves operacions en tots els protocols DeFi\n- Classificació automàtica i revisió manual de cada transacció\n- Informes fiscals llestos per incloure a la teva declaració\n- Assistència personalitzada durant tot el procés\n\n**[Sol·licita el teu informe fiscal →](/ca/contacte)**\n\nContacta amb el nostre equip i obtén una valoració inicial sense compromís. T’explicarem exactament què necessites fer i com podem ajudar-te a declarar correctament les teves operacions DeFi.\n\n---\n\n**Avís legal:** Aquest article té una finalitat exclusivament informativa i educativa. No constitueix assessorament fiscal personalitzat ni recomanació d’inversió. La normativa fiscal està subjecta a canvis i cada situació personal és única. Consulta sempre amb un assessor fiscal professional col·legiat per al teu cas específic.\n\n---\n\n*Última actualització: Novembre 2025*\n\n*Publicat per: Equip Cleriontax - Experts en Fiscalitat de Criptomonedes i Anàlisi de Dades*"
}
