{
  "title": "Stablecoins i Fiscalitat a Espanya 2025: Per Què Convertir BTC a USDT Sí Tributa davant l'AEAT",
  "excerpt": "Milers d'inversors creuen que convertir les seves criptomonedes a stablecoins com USDT o USDC els protegeix fiscalment. Descobreix per què aquest és un dels errors més costosos que pots cometre davant Hisenda i com evitar sancions de fins al 150%.",
  "content": "Imagina aquesta situació: Vas comprar Bitcoin a 30.000€ i ara val 60.000€. El mercat sembla inestable i decideixes «protegir» els teus guanys convertint-los a USDT. No has venut a euros, només has passat a una moneda estable. Al teu cap, no has materialitzat cap guany fiscal. Continues a l'ecosistema crypto.\n\n**Error.** Acabes de generar un guany patrimonial de 30.000€ que has de declarar a Hisenda.\n\nAquest és probablement l'**error fiscal més estès** entre inversors de criptomonedes a Espanya. La creença que les stablecoins són un «refugi fiscal» on pots aparcar els teus guanys sense que l'AEAT se n'assabenti ha portat milers de contribuents a declaracions incorrectes, requeriments d'Hisenda i sancions que poden superar el 150% del no declarat.\n\nEn aquesta guia completa analitzarem per què les stablecoins tributen exactament igual que qualsevol altra criptomoneda, com t'afecta fiscalment operar amb elles, què diu realment l'AEAT sobre USDT, USDC, DAI i altres stablecoins, i com evitar els errors que poden costar-te milers d'euros en sancions.\n\n---\n\n## Què són les stablecoins i per què semblen diferents\n\nLes **stablecoins** són criptomonedes dissenyades per mantenir un valor estable respecte a un actiu de referència, generalment el dòlar nord-americà o l'euro. A diferència de Bitcoin o Ethereum, el preu dels quals fluctua constantment, una stablecoin com USDT manté teòricament una paritat 1:1 amb el dòlar.\n\nLes stablecoins més populars el 2025 inclouen Tether (USDT), USD Coin (USDC), DAI, BUSD, USDD, TrueUSD i desenes més. Totes comparteixen el mateix objectiu: oferir l'estabilitat d'una moneda fiat amb la flexibilitat operativa d'una criptomoneda.\n\nPer als traders i inversors, les stablecoins ofereixen avantatges operatius innegables. Permeten moure's ràpidament entre posicions sense necessitat de tornar a euros, faciliten el trading en exchanges que no operen amb fiat, serveixen com a refugi temporal durant caigudes del mercat, i permeten mantenir liquiditat disponible per aprofitar oportunitats sense sortir de l'ecosistema crypto.\n\nPerò aquesta utilitat operativa genera una **il·lusió perillosa**: la sensació que, en no convertir a euros, no estàs «materialitzant» guanys fiscalment. Aquesta percepció errònia és l'arrel de milers de declaracions fiscals incorrectes cada any a Espanya.\n\n---\n\n## La posició oficial de l'AEAT: stablecoins com a criptomonedes\n\nL'Agència Tributària espanyola no fa distincions entre criptomonedes volàtils i stablecoins. Per a l'AEAT, USDT és exactament igual que Bitcoin a efectes fiscals: un actiu digital que s'ha de declarar seguint les mateixes normes.\n\nAquesta posició s'ha manifestat en consultes vinculants, criteris interpretatius i en la pràctica d'inspeccions fiscals. L'AEAT considera que qualsevol moneda virtual, independentment del seu mecanisme d'estabilització de preu, és un actiu patrimonial subjecte a les normes generals de tributació de criptomonedes.\n\nLa raó tècnica és clara: fiscalment, el que importa no és l'estabilitat del preu, sinó la naturalesa jurídica de l'actiu. Les stablecoins no són euros, no són dipòsits bancaris garantits, no estan regulades com a diners electrònics sota normativa MiCA completa. Són tokens emesos per empreses privades que prometen mantenir una reserva equivalent, però que des del punt de vista legal espanyol són simplement una altra criptomoneda més.\n\nAquesta classificació té conseqüències fiscals directes i automàtiques. Quan converteixes Bitcoin a USDT, estàs realitzant una permuta entre dos actius diferents. El fet que un sigui estable i l'altre volàtil és irrellevant fiscalment. El rellevant és que has transmès un actiu (BTC) a canvi d'un altre (USDT), i aquesta transmissió genera una alteració patrimonial que ha de tributar.\n\n---\n\n## Per què BTC → USDT genera guany patrimonial\n\nLa fiscalitat de les criptomonedes a Espanya es basa en el principi d'alteració patrimonial. Cada vegada que transmet un actiu, ja sigui venent-lo, intercanviant-lo o permutant-lo, generes un fet imposable que s'ha de declarar a l'IRPF.\n\nQuan realitzes l'operació BTC → USDT, estàs executant tècnicament una permuta. Lliures Bitcoin i reps Tether a canvi. Aquesta operació és funcionalment idèntica a BTC → ETH o BTC → SOL. El fet que USDT tingui un preu estable no canvia la naturalesa fiscal de la transacció.\n\nEl guany o pèrdua patrimonial es calcula com la diferència entre el valor de transmissió (el preu al qual «vens» el BTC, expressat en euros) i el valor d'adquisició (el preu al qual vas comprar aquest BTC originalment). Si vas comprar 1 BTC a 30.000€ i el converteixes a USDT quan val 60.000€, el guany patrimonial és de 30.000€, independentment que hagis rebut dòlars digitals en lloc d'euros reals.\n\nAquest guany s'integra en la base imposable de l'estalvi del teu IRPF i tributa segons els tipus aplicables el 2025: 19% fins a 6.000€, 21% entre 6.000€ i 50.000€, 23% entre 50.000€ i 200.000€, 27% entre 200.000€ i 300.000€, i 28% a partir de 300.000€. Al nostre exemple, sobre un guany de 30.000€, l'impost aproximat seria de 6.090€ (19% sobre els primers 6.000€ i 21% sobre els restants 24.000€).\n\nLa conseqüència pràctica és devastadora per a qui ignora aquesta regla: pots generar desenes de milers d'euros en guanys patrimonials mitjançant conversions a stablecoins, creient que «no has venut res», i trobar-te amb una liquidació d'Hisenda anys després reclamant impostos, interessos de demora i sancions sobre operacions que ni tan sols sabies que havies de declarar.\n\n---\n\n## El mite del refugi fiscal: per què USDT no et protegeix d'Hisenda\n\nLa narrativa del «refugi fiscal» en stablecoins es basa en diversos malentesos fonamentals sobre com funciona la fiscalitat de criptomonedes.\n\nEl primer és confondre volatilitat amb tributació. Molts inversors raonen així: «Si converteixo BTC a USDT, el preu es manté estable, per tant no he guanyat ni perdut res». Aquest raonament confon la funció econòmica de les stablecoins (protegir contra volatilitat) amb la seva naturalesa fiscal (actius permutables subjectes a tributació). El moment fiscal rellevant no és quan el preu fluctua, sinó quan transmet l'actiu.\n\nEl segon malentès és pensar que «no sortir de l'ecosistema crypto» equival a «no materialitzar guanys». Fiscalment, cada conversió entre criptomonedes és una transmissió independent. No importa si els diners «surten» al teu compte bancari o es queden a Binance convertits a USDT. La transmissió del Bitcoin genera el fet imposable.\n\nEl tercer error és creure que Hisenda no pot rastrejar operacions crypto-to-crypto. La realitat és que els exchanges estan obligats a reportar informació fiscal, les transaccions blockchain són públiques i rastreables, i l'AEAT té acords d'intercanvi d'informació internacional amb exchanges estrangers. Pensar que les conversions a USDT són «invisibles» és perillosament ingenu.\n\nFinalment, existeix la fal·làcia que «com USDT val 1 dòlar, no hi ha guany». Això confon el valor d'adquisició de l'USDT amb el guany generat en vendre el BTC. Quan converteixes 1 BTC per 60.000 USDT, has obtingut un valor de 60.000 dòlars (aproximadament 60.000€ al canvi). Si aquest BTC et va costar 30.000€, has generat 30.000€ de guany, independentment que ara tinguis dòlars digitals en lloc de Bitcoin.\n\n---\n\n## Casos pràctics: el cost real de l'error de les stablecoins\n\nVeiem tres exemples reals que il·lustren com aquest error afecta diferents perfils d'inversors.\n\n**Cas 1: El trader actiu que ignora les conversions**\n\nCarlos és un trader actiu que opera principalment a Binance. Durant 2024 va realitzar desenes d'operacions, alternant entre Bitcoin, altcoins i USDT com a refugi temporal. La seva estratègia habitual era comprar BTC quan considerava que estava baix, esperar que pugés, convertir a USDT per protegir guanys, i després buscar una altra oportunitat.\n\nAl final de l'any, Carlos va calcular que havia invertit 20.000€ inicials, ara tenia 50.000 USDT al seu compte, però com «no havia tret diners a euros», va pensar que només havia de declarar si venia l'USDT. El seu raonament: «Continuo amb tot en crypto, no he materialitzat res».\n\nLa realitat fiscal era molt diferent. Cadascuna de les seves conversions BTC → USDT havia generat guanys patrimonials que havia de declarar. L'anàlisi detallada de les seves transaccions va revelar guanys acumulats de 30.000€ durant l'any. En no declarar-los, Carlos es va exposar a una liquidació tributària d'aproximadament 6.300€ en impostos, més interessos de demora del 4% anual, més una sanció del 50% al 150% segons la gravetat. En el pitjor escenari, podria enfrontar-se a una factura total superior a 15.000€.\n\n**Cas 2: L'inversor conservador que descobreix el model 721**\n\nLaura va comprar Bitcoin el 2020 per 15.000€. El 2023, amb BTC en màxims, va decidir «assegurar guanys» convertint tot a USDC per valor de 65.000€, que va mantenir a Coinbase. Com no havia venut a euros, no va declarar res a la seva renda de 2023.\n\nEl 2024, Laura va rebre un requeriment de l'AEAT. El problema no era només que hauria d'haver declarat 50.000€ de guany patrimonial el 2023 (BTC comprat a 15.000€, venut efectivament a 65.000€), sinó que a més, en tenir 65.000€ en USDC en un exchange estranger (Coinbase, amb seu a USA), estava obligada a presentar el model 721 declarant aquests actius abans del 31 de març de 2024.\n\nLa sanció per no presentar el model 721 és especialment severa: mínim 10.000€, podent arribar al 150% del saldo no declarat. Laura s'enfrontava a una sanció potencial de fins a 97.500€ (150% de 65.000€), més la liquidació tributària pel guany patrimonial no declarat (aproximadament 10.500€), més interessos de demora. Un error que podria costar-li més de 100.000€.\n\n**Cas 3: L'inversor DeFi que oblida que DAI també tributa**\n\nJavier és un usuari avançat de DeFi. Utilitza DAI (stablecoin descentralitzada) per operar en protocols com Aave i Curve. La seva estratègia: converteix ETH a DAI, diposita el DAI en pools de liquiditat per generar rendiments, i quan veu oportunitats torna a ETH.\n\nDurant 2024, Javier va realitzar múltiples cicles ETH → DAI → ETH. Al tancament de l'any, va calcular que havia generat 8.000€ en rendiments DeFi (staking, farming), que sí va declarar correctament. Però no va declarar les conversions ETH → DAI, assumint que «DAI no és una venda, és només una conversió per operar».\n\nL'anàlisi fiscal va revelar que les seves conversions ETH → DAI havien generat guanys patrimonials addicionals de 12.000€ que no havia declarat. A més, les reconversions DAI → ETH també generaven fets imposables. El resultat: una declaració incompleta que podria resultar en sancions del 50% al 100% sobre els 2.500€ d'impostos no pagats, més interessos.\n\n---\n\n## Operacions amb stablecoins que SÍ tributen\n\nPer eliminar qualsevol dubte, repassem exhaustivament totes les operacions amb stablecoins que generen obligacions fiscals a Espanya.\n\nLa conversió des de criptomoneda volàtil a stablecoin (BTC → USDT, ETH → USDC, SOL → DAI) genera guany o pèrdua patrimonial. Aquesta és l'operació més comuna i la més incompresa. Cada vegada que converteixes un actiu volàtil a un d'estable, has de calcular i declarar el resultat fiscal.\n\nLa conversió des de stablecoin a criptomoneda volàtil (USDT → BTC, USDC → ETH) també tributa. Quan uses els teus USDT per comprar Bitcoin, estàs transmetent l'USDT. Si el valor de l'USDT en aquest moment (en euros) és superior al que et va costar obtenir-lo originalment, generes guany patrimonial. Aquest cas és menys comú perquè USDT sol mantenir valor estable, però pot ocórrer si hi ha fluctuacions en el tipus de canvi USD/EUR o si vas obtenir l'USDT amb descompte.\n\nLa conversió entre diferents stablecoins (USDT → USDC, DAI → BUSD) genera un fet imposable tècnic, encara que habitualment amb guany/pèrdua propera a zero si ambdues mantenen paritat. No obstant això, fiscalment continua sent una permuta que s'ha de registrar.\n\nL'ús de stablecoins per comprar béns o serveis tributa igual que pagar amb Bitcoin. Si utilitzes 1.000 USDT per comprar un producte, i aquests USDT et van costar originalment 900€, generes un guany patrimonial de 100€.\n\nEl dipòsit de stablecoins en protocols DeFi per generar rendiments té una doble tributació: primer, si vas obtenir les stablecoins mitjançant conversió (ex. BTC → USDT), aquesta conversió tributa; segon, els interessos o rewards generats tributen com a rendiments del capital mobiliari quan els reps.\n\nLa venda de stablecoins a euros tributa evidentment, encara que en molts casos el guany serà petit (si vas comprar USDT a 1€ i vens a 1€, guany zero). Però si vas obtenir aquestes stablecoins mitjançant una operació anterior no declarada, Hisenda pot qüestionar el teu cost d'adquisició.\n\nFins i tot la simple tinença de més de 50.000€ en stablecoins en exchanges estrangers o wallets t'obliga a presentar el model 721 anualment abans del 31 de març, encara que no hagis realitzat cap operació durant l'any. Aquesta obligació informativa és independent de si has generat guanys o no.\n\n---\n\n## Com calcular correctament els guanys amb stablecoins\n\nEl càlcul fiscal correcte d'operacions amb stablecoins requereix precisió en tres elements fonamentals: valor d'adquisició, valor de transmissió, i aplicació del mètode FIFO.\n\nEl valor d'adquisició d'una stablecoin és el cost en euros d'obtenir-la. Si vas comprar 10.000 USDT amb una transferència bancària de 10.000€, aquest és el teu valor d'adquisició. Si vas obtenir 10.000 USDT convertint 0,2 BTC quan valia 50.000€/BTC, el teu valor d'adquisició de l'USDT és 10.000€, i a més vas generar un guany o pèrdua en la venda del BTC que s'ha de calcular per separat.\n\nEl valor de transmissió és el valor en euros en el moment de l'operació. Si converteixes 1 BTC a 60.000 USDT quan el tipus de canvi USDT/EUR és 1:1, el teu valor de transmissió és 60.000€. Si ho fas quan el dòlar està més fort i 60.000 USDT equivalen a 55.000€, aquest és el teu valor de transmissió.\n\nL'aplicació del mètode FIFO (First In, First Out) és obligatòria a Espanya. Si has comprat USDT en diverses ocasions a diferents preus, quan els usis o converteixis, has de considerar que estàs utilitzant els USDT més antics primer. Aquest mètode pot generar resultats contraintuitius si no portes un registre detallat.\n\nVeiem un exemple complet. Vas comprar 0,5 BTC a 40.000€ al gener de 2024. Al març, quan BTC val 55.000€, converteixes a 27.500 USDT. Guany patrimonial: 27.500€ - 20.000€ = 7.500€ (tributa a la renda 2024). Al maig, compres altres 0,3 BTC amb aquests 27.500 USDT quan BTC val 50.000€. Cost d'adquisició del nou BTC: 27.500€. A l'octubre, BTC puja a 65.000€ i vens els 0,3 BTC a euros per 19.500€. Guany patrimonial: 19.500€ - 15.000€ = 4.500€ (tributa a la renda 2024).\n\nL'error comú seria pensar que només tributa l'última venda (0,3 BTC → EUR). La realitat és que vas tributar dues vegades: una en la conversió BTC → USDT (7.500€) i una altra en la venda final (4.500€), amb un guany total declarable de 12.000€ l'any 2024.\n\n---\n\n## El model 721 i les stablecoins: la trampa dels 50.000€\n\nEl model 721 (antic 720) és potser l'obligació fiscal més desconeguda i potencialment més costosa relacionada amb stablecoins.\n\nSi a 31 de desembre tens més de 50.000€ en criptomonedes en exchanges estrangers o wallets, estàs obligat a declarar-ho mitjançant el model 721 abans del 31 de març de l'any següent. Aquesta obligació és informativa, no pagues impostos per presentar-la, però les sancions per no fer-ho són les més severes del sistema fiscal espanyol.\n\nLa sanció mínima és de 10.000€ per cada bloc d'informació omès. La sanció màxima pot arribar al 150% del saldo no declarat. Si no presentes el model 721, el termini de prescripció de les teves obligacions fiscals s'estén de 4 a 10 anys, permetent a Hisenda revisar operacions molt antigues.\n\nLes stablecoins generen una trampa específica perquè el seu valor és predictible. Un inversor pot pensar: «Només tinc 40.000€ en BTC, no arribo al llindar de 50.000€». Però si converteix aquest BTC a USDT i el mercat puja, de sobte pot tenir 60.000€ en USDT sense adonar-se'n, activant l'obligació del model 721 que desconeixia.\n\nPitjor encara, si tens 55.000 USDT a Binance a 31 de desembre, has de presentar el model 721 fins i tot si durant tot l'any no has fet cap operació. La mera tinença ja genera l'obligació informativa.\n\nPer a l'AEAT, les stablecoins en exchanges estrangers (Binance, Coinbase, Kraken, etc.) o en wallets no custodiades (MetaMask, Ledger, etc.) es consideren actius a l'estranger. El criteri és que la blockchain no està físicament a Espanya, per tant l'actiu està «a l'estranger» a efectes del model 721.\n\nAquesta interpretació genera situacions absurdes però legalment vinculants. Si tens 60.000 USDC al teu Ledger (hardware wallet que controles completament), tècnicament has de declarar-ho en el model 721 perquè l'AEAT considera que aquests USDC «estan» a la blockchain d'Ethereum, que no és espanyola.\n\n---\n\n## Errors freqüents i com evitar-los\n\nEl primer gran error és no declarar les conversions crypto-to-stable pensant que no són vendes. Aquest és l'error més estès i costós. La solució és simple però requereix disciplina: tracta cada conversió a stablecoin exactament igual que una venda a euros. Si converteixes BTC a USDT, calcula i registra el guany patrimonial en aquest moment.\n\nEl segon error és usar el valor actual de l'USDT en lloc del valor en el moment de l'operació. Quan calcules guanys, has d'usar el tipus de canvi USDT/EUR del dia exacte de la transacció, no el tipus actual. Aquest error pot generar diferències significatives si el dòlar ha fluctuat.\n\nEl tercer error és no reconciliar transferències de stablecoins entre exchanges. Si transfereixes 10.000 USDT de Binance a Coinbase, això NO és una venda (no tributa). Però els software automàtics sovint ho registren com venda a Binance + compra a Coinbase, creant guanys fantasma. Has d'etiquetar manualment aquestes transferències internes.\n\nEl quart error és oblidar que les stablecoins compten per al llindar de 50.000€ del model 721. Molts inversors vigilen el seu BTC i ETH, però obliden que els seus 40.000 USDT «de seguretat» també compten. Si el teu portfolio total a l'estranger (BTC + ETH + USDT + qualsevol altra crypto) supera 50.000€ a 31 de desembre, has de presentar el model 721.\n\nEl cinquè error és pensar que operar en un exchange descentralitzat (DEX) com Uniswap et fa invisible fiscalment. Les transaccions on-chain són públiques i permanents. L'AEAT pot rastrejar qualsevol operació realitzada en un DEX mitjançant anàlisi blockchain. Que no hi hagi un intermediari centralitzat no significa que l'operació sigui invisible.\n\nEl sisè error és confiar cegament en eines automàtiques com CoinTracking o Koinly per a operacions amb stablecoins. Aquestes eines no estan adaptades als criteris específics de l'AEAT espanyola i freqüentment classifiquen malament les operacions amb stablecoins. Has de revisar manualment cada conversió.\n\n---\n\n## Estratègies fiscals legals amb stablecoins\n\nEncara que les stablecoins no són un refugi fiscal, sí tenen usos legítims dins d'una estratègia d'optimització fiscal ben planificada.\n\nUna estratègia vàlida és usar stablecoins per diferir fiscalment dins del mateix any. Si generes guanys importants al gener i converteixes a USDT, ja has generat el fet imposable. Però si després reinverteixes aquest USDT en una altra crypto que cau durant l'any, pots generar pèrdues que compensin els guanys anteriors. Això és tax-loss harvesting, completament legal si es fa correctament.\n\nUna altra estratègia és usar stablecoins per mantenir liquiditat operativa sense sortir de l'ecosistema crypto. Si planifiques operar activament, mantenir un percentatge en USDT et permet aprofitar oportunitats ràpidament. Fiscalment, les conversions tributen, però almenys optimitza la teva operativa trading.\n\nLes stablecoins també són útils per calcular amb precisió el resultat d'operacions complexes. En convertir a USDT després de cada operació guanyadora, estableixes un valor d'adquisició clar per a la següent operació, facilitant el càlcul FIFO posterior.\n\nEn l'àmbit DeFi, les stablecoins permeten generar rendiments passius (staking, lending) que tributen com a rendiments del capital mobiliari, generalment a tipus més baixos que els guanys patrimonials si el teu nivell de renda és moderat. Dipositar USDC a Aave pot ser fiscalment més eficient que fer trading actiu, sempre que declareu correctament.\n\nFinalment, per a inversors que superen el llindar de 50.000€ i ja han de presentar model 721, mantenir una part del portfolio en stablecoins pot facilitar el càlcul del valor a declarar, ja que USDT té un preu estable i predictible, a diferència de BTC que pot fluctuar significativament entre el 31 de desembre i la data de presentació del model.\n\n---\n\n## Què fer si no has declarat conversions a stablecoins\n\nSi has realitzat conversions a stablecoins en anys anteriors i no les vas declarar, tens diverses opcions, cadascuna amb diferents conseqüències.\n\nLa primera opció és presentar una declaració complementària. Si el termini de presentació de la renda encara no ha tancat (fins al 30 de juny de l'any següent), pots presentar una declaració complementària que substitueix l'anterior. Només pagues la diferència d'impostos més interessos de demora del 4% anual des de la data límit de presentació. No hi ha sanció si ho fas voluntàriament dins del termini.\n\nLa segona opció és presentar una declaració extemporània sense requeriment previ. Si el termini ja va passar però Hisenda encara no t'ha enviat un requeriment, pots presentar voluntàriament la declaració corregida. Pagues l'impost més interessos de demora més un recàrrec que va del 5% (si presentes en els 3 mesos següents al termini) fins al 20% (si presentes després de 12 mesos). Però evites la sanció formal.\n\nLa tercera opció, la pitjor, és esperar que Hisenda et requereixi. En aquest cas, a més de l'impost i interessos, enfronton sancions que van del 50% al 150% de la quota no ingressada, depenent de si es considera infracció lleu (oblit), greu (negligència) o molt greu (ocultació). Si Hisenda considera que intencionalment vas ocultar les operacions, la sanció pot ser devastadora.\n\nPer al model 721, si vas oblidar presentar-lo, la recomanació és presentar una declaració extemporània immediatament. La sanció mínima és de 10.000€, però si presentes voluntàriament abans del requeriment i reconeixes els fets, pots obtenir reduccions significatives (fins al 50% de reducció si no recurres). Esperar només empitjora la situació.\n\nÉs fonamental consultar amb un professional especialitzat abans de decidir quina opció prendre. Un assessor fiscal expert en crypto pot avaluar la teva situació específica, calcular exactament quant hauries d'haver declarat, estimar les sancions potencials, i dissenyar l'estratègia de regularització que minimitzi el cost total.\n\n---\n\n## El futur: regulació MiCA i stablecoins a Europa\n\nEl panorama regulatori de les stablecoins està canviant radicalment a Europa amb la implementació del reglament MiCA (Markets in Crypto-Assets), que entrarà en plena vigència el 2025.\n\nMiCA estableix requisits estrictes per a emissors de stablecoins, incloent reserves mínimes, auditories regulars, llicències bancàries en alguns casos, i mecanismes de reemborsament garantit. Stablecoins com USDT i USDC hauran d'adaptar-se o deixar d'operar a Europa.\n\nAquesta regulació pot tenir implicacions fiscals indirectes. Si les stablecoins es regulen com a diners electrònics sota MiCA, alguns estats podrien considerar tractar-les fiscalment més com a moneda que com a actiu. No obstant això, fins ara no hi ha indicis que Espanya vagi a canviar el seu criteri actual: mentre siguin tokens blockchain, tributaran com a criptomonedes.\n\nMiCA també establirà obligacions de report per a exchanges i custodis, similar a la directiva DAC8. Això significa que els exchanges estaran obligats a reportar automàticament a les autoritats fiscals les operacions dels seus usuaris, incloent conversions crypto-to-stable. La capacitat d'Hisenda per detectar operacions no declarades es multiplicarà.\n\nPer a inversors, això significa que l'espai per a «errors» fiscals es reduirà dràsticament. Si el 2023-2024 era possible que Hisenda no detectés les teves conversions BTC → USDT, el 2025-2026 serà pràcticament impossible. Els exchanges reportaran automàticament cada operació.\n\nLa recomanació és clara: no comptis amb l'opacitat o la ignorància d'Hisenda. Declara correctament des d'ara, perquè el futur serà de total transparència.\n\n---\n\n## Conclusió: declarar stablecoins correctament per evitar sancions de milers d'euros\n\nLa creença que les stablecoins són un refugi fiscal és un dels mites més perillosos i costosos del món crypto espanyol. Milers d'inversors han generat desenes de milers d'euros en guanys no declarats mitjançant conversions BTC → USDT, creient honestament que «no havien venut res».\n\nLa realitat fiscal és inequívoca: cada conversió a stablecoin tributa exactament igual que una venda a euros. L'AEAT no fa distincions entre USDT i Bitcoin. Ambdós són criptomonedes, ambdós generen guanys patrimonials en transmetre's, ambdós s'han de declarar al model 100, i ambdós compten per al llindar de 50.000€ del model 721.\n\nLes conseqüències d'ignorar aquestes obligacions poden ser devastadores: sancions del 50% al 150% sobre impostos no pagats, liquidacions tributàries que es remunten fins a 10 anys enrere si no vas presentar model 721, interessos de demora acumulats, i en casos extrems, possible delicte fiscal si l'import supera 120.000€.\n\nPerò més enllà de la por a les sancions, existeix una raó positiva per declarar correctament: establir un historial fiscal clar et protegeix en el futur. Si algun dia necessites justificar l'origen de 200.000€ al teu compte bancari procedents de crypto, tenir declaracions històriques correctes és la teva millor defensa. La transparència fiscal és també protecció patrimonial.\n\nSi has operat amb stablecoins i no estàs segur d'haver declarat correctament, actua ara. Com més aviat regularitzis, menors seran les conseqüències. No esperis el requeriment d'Hisenda.\n\n---\n\n## Cleriontax: experts en fiscalitat de stablecoins i operacions complexes crypto\n\nHas operat amb USDT, USDC, DAI o altres stablecoins i no saps si vas declarar correctament? Vas superar els 50.000€ en exchanges estrangers i no vas presentar el model 721? A **Cleriontax** som especialistes en fiscalitat de criptomonedes i casos complexos amb stablecoins.\n\nEl nostre equip combina experiència en fiscalitat espanyola amb anàlisi de dades blockchain per reconstruir el teu historial complet d'operacions, identificar cada conversió crypto-to-stable, calcular els guanys patrimonials correctes aplicant FIFO segons criteris AEAT, i preparar declaracions complementàries o extemporànies que minimitzin sancions.\n\nEls nostres serveis inclouen auditoria completa de les teves operacions amb stablecoins, càlcul de guanys no declarats en anys anteriors, preparació del model 721 si superes els llindars, estratègia de regularització voluntària per minimitzar sancions, preparació del model 100 amb totes les conversions correctament classificades, i defensa davant requeriments d'Hisenda relacionats amb operacions crypto.\n\nNo deixis la teva situació fiscal a l'atzar. Una anàlisi professional pot ser la diferència entre regularitzar voluntàriament amb un cost controlat o enfrontar sancions de desenes de milers d'euros després d'un requeriment.\n\n**[Sol·licita la teva anàlisi fiscal personalitzada →](/ca/contacte)**\n\nEl nostre equip d'experts en fiscalitat crypto t'ajudarà a complir amb totes les teves obligacions fiscals de forma segura, professional i optimitzada. Si has comès errors en el passat, t'ajudem a corregir-los amb el mínim cost possible.\n\n---\n\n**Descàrrec de responsabilitat:** Aquest article té finalitat informativa i educativa exclusivament. No constitueix assessorament fiscal personalitzat. La normativa fiscal està subjecta a canvis i cada situació personal és única. Consulta sempre amb un assessor fiscal professional col·legiat abans de prendre decisions fiscals relacionades amb criptomonedes.\n\n---\n\n*Última actualització: Gener 2025*\n\n*Publicat per: Equip Cleriontax - Experts en Fiscalitat de Criptomonedes i Anàlisi de Dades*"
}