{
  "title": "How to Declare Your Cryptocurrencies in the 2025 Tax Return Step by Step",
  "excerpt": "Complete guide to declaring cryptocurrencies in your 2025 tax return according to AEAT regulations. Learn what to declare, how to do it, and how to avoid common mistakes.",
  "content": "Each year, the **Spanish Tax Agency (AEAT)** increases its control over digital assets and demands greater transparency from investors. Declaring your cryptocurrencies is not only a legal obligation but also a guarantee of financial and tax security.\n\nThe **AEAT** has access to information provided by both national and international exchanges, meaning that operations carried out on centralized or decentralized platforms can be easily detected. Therefore, failing to declare your crypto assets can result in **penalties, surcharges, or even tax audits**.\n\n---\n\n## Why It’s Important to Declare Your Cryptocurrencies\n\nCorrectly declaring your cryptocurrencies not only protects you from penalties but also allows you to:\n\n- **Optimize your tax situation** and pay exactly what is legally required\n- **Avoid financial penalties** that can reach up to 150% of undeclared amounts\n- **Prevent tax audits** and AEAT sanctions procedures\n- **Ensure financial security** with complete and traceable documentation\n\n> **Important:** The AEAT has access to information from both domestic and foreign exchanges. Operations carried out on centralized and decentralized platforms can be easily tracked.\n\n---\n\n## When You Must Declare Your Cryptocurrencies\n\nCryptocurrencies must be declared when there is a **capital gain or loss** resulting from:\n\n- **Selling cryptocurrencies** for euros or another fiat currency\n- **Exchanging cryptocurrencies** (for example, BTC for ETH)\n- **Using cryptocurrencies** to purchase goods or services\n- **Earning income** from staking, farming, airdrops, or crypto lending\n\n### What If You Just Hold Your Cryptocurrencies?\n\nEven if you hold your cryptocurrencies without selling (the **HODL** strategy), you may still need to report their value and custodian through certain informational tax forms, especially if they exceed specific thresholds set by Spanish tax law.\n\n**Relevant informational forms:**\n\n- **Form 720:** If the total value of your crypto holdings on foreign exchanges exceeds €50,000 as of December 31\n- **Form 721:** Required for crypto custody service providers (not for individual investors)\n\n---\n\n## How to Calculate Gains or Losses\n\nThe **AEAT** requires the **FIFO** (First In, First Out) method to determine which cryptocurrency units are sold first. This method means the first coins you purchased are considered the first to be sold.\n\n### FIFO Method Step by Step\n\n**Example:**\n\nImagine you perform the following Bitcoin operations:\n\n**Purchases:**\n\n- January 2024: 0.5 BTC at €40,000 (cost: €20,000)\n- March 2024: 0.3 BTC at €50,000 (cost: €15,000)\n\n**Sale:**\n\n- June 2024: 0.6 BTC at €60,000 (income: €36,000)\n\n**Applying FIFO:**\n\n1. The first 0.5 BTC from January are sold:\n   - Income: 0.5 × 60,000 = €30,000\n   - Cost: €20,000\n   - Gain: €10,000\n\n2. Then 0.1 BTC from March are sold:\n   - Income: 0.1 × 60,000 = €6,000\n   - Cost: 0.1 × 50,000 = €5,000\n   - Gain: €1,000\n\n**Total capital gain: €11,000**\n\n### Why FIFO Calculations Are Complex\n\nAccurately calculating gains and losses is one of the most challenging steps because it requires:\n\n- Analyzing the full transaction history since acquisition\n- Reconciling movements across multiple wallets and exchanges\n- Tracking operations across several blockchains\n- Applying historical exchange rates for each transaction\n\nAt **Cleriontax**, we automate this process and validate every transaction to ensure accurate and traceable reports.\n\n---\n\n## Tax Forms You Must Submit\n\n### Form 100: Personal Income Tax (IRPF)\n\nThe **main tax form** where capital gains or losses from cryptocurrency transactions are reported.\n\n**Include in Form 100:**\n\n- Capital gains and losses from selling or exchanging cryptocurrencies\n- Investment income from staking, lending, and other passive earnings\n- Employment income if you receive cryptocurrencies as salary\n\n### Form 721: Crypto Assets and Rights Abroad\n\nMandatory for **service providers** offering cryptocurrency custody, Spanish exchanges, and platforms facilitating crypto transactions.\n\n**Important:** Individual investors **do not need to submit** Form 721.\n\n### Form 714: Wealth Tax\n\nYou may need to submit it depending on your **assets, tax residency, and transaction volume**.\n\n> **Tip:** Correctly identifying which forms apply to your situation is crucial to avoid mistakes and penalties. Consulting a crypto tax specialist is highly recommended.\n\n---\n\n## Common Mistakes When Declaring Cryptocurrencies\n\nSome of the most frequent errors include:\n\n### 1. Not Including Crypto-to-Crypto Exchanges\n\nMany investors believe they only need to declare when converting crypto to euros. **Wrong:** Crypto-to-crypto exchanges (e.g., BTC for ETH) also generate capital gains or losses that must be declared.\n\n### 2. Confusing Internal Transfers with Sales\n\nTransferring cryptocurrencies between wallets you own **does not create** a taxable event. However, many people mistake these transfers for sales.\n\n**Examples of Non-Taxable Events:**\n\n- Transferring Bitcoin from Binance to your Ledger hardware wallet\n- Moving Ethereum from MetaMask to Trezor\n- Consolidating multiple wallets into one\n\n### 3. Relying on Faulty Automatic Reports\n\nSome exchanges provide automatic tax reports that may contain errors in:\n\n- Incorrect application of the FIFO method\n- Inaccurate historical exchange rates\n- Missing or duplicated transactions\n- Misclassified operations\n\n### 4. Failing to Declare Staking or Lending Rewards\n\nPassive income earned through staking, lending, or farming must be declared as **investment income**, not capital gains.\n\n> **Solution:** At Cleriontax, we review and clean all data before generating the final tax report, applying up-to-date tax criteria and verifying compliance with AEAT regulations.\n\n---\n\n## Tax Rates for 2025\n\nCryptocurrency capital gains are taxed under the **Savings Base** as follows:\n\n| Taxable Base | Applicable Rate |\n|---|---|\n| Up to €6,000 | 19% |\n| €6,000 – €50,000 | 21% |\n| €50,000 – €200,000 | 23% |\n| €200,000 – €300,000 | 27% |\n| Over €300,000 | 28% |\n\n**Example:**\n\nIf you earned a €15,000 capital gain from crypto sales:\n\n- First €6,000 at 19% = €1,140\n- Next €9,000 at 21% = €1,890\n- **Total tax due: €3,030**\n\n---\n\n## Key Dates and Deadlines for 2025\n\n**Form 100 (IRPF):**\n\n- From **April 11 to June 30, 2025**\n- Direct debit deadline: June 25\n\n**Form 720 (Assets Abroad):**\n\n- From **January 1 to March 31, 2025**\n- Only required if you exceed €50,000 on foreign exchanges as of December 31, 2024\n\n> **Reminder:** Late filing incurs surcharges from 5% to 20% depending on the delay, plus interest charges.\n\n---\n\n## Conclusion: Order, Traceability, and Tax Security\n\nThe key to correctly declaring your cryptocurrencies is having:\n\n- **Organized data:** Complete transaction history across all exchanges and wallets\n- **Clear tax criteria:** Proper application of FIFO and correct operation classification\n- **Full traceability:** Reconciliation of movements across platforms and blockchains\n- **Specialized advice:** Crypto tax experts familiar with AEAT’s current regulations\n\nCrypto taxation is constantly evolving, and having a specialized team makes the difference between a safe report and an unnecessary risk.\n\n---\n\n## Cleriontax: Experts in Cryptocurrency Taxation\n\nAt **Cleriontax**, we help you turn the chaos of your wallet and exchange data into an **accurate, verified tax report ready for submission** to the AEAT.\n\n**Our automated process:**\n\n- Automatic import from over 50 exchanges and wallets\n- Data reconciliation and cleaning using proprietary algorithms\n- Accurate FIFO application for each transaction\n- Precise classification of capital gains vs. income\n- Reports ready to include in your tax return\n- Review by certified tax advisors specializing in crypto\n\n**[Request Your Tax Report →](/contact)**\n\nContact our team for a free initial assessment. We’ll explain exactly what you need to do and how we can help you correctly declare your cryptocurrencies.\n\n---\n\n**Disclaimer:** This article is for informational and educational purposes only. It does not constitute personalized tax advice or investment recommendations. Tax laws are subject to change, and each situation is unique. Always consult a certified tax advisor for your specific case.\n\n---\n\n*Last updated: October 2025*\n\n*Published by: Cleriontax Team – Experts in Cryptocurrency Taxation and Data Analysis*"
}
