{
  "title": "DeFi Taxation in Spain: How Your Earnings Are Taxed in 2025",
  "excerpt": "Discover how DeFi operations are taxed in Spain in 2025. We explain the taxation of staking, yield farming, airdrops, and other rewards according to the AEAT.",
  "content": "**DeFi** (Decentralized Finance) has revolutionized how we invest in cryptocurrencies, but it has also introduced new tax challenges. Unlike centralized operations, DeFi platforms operate without intermediaries and generate returns that the **AEAT** (Spanish Tax Agency) considers as either capital income or capital gains, depending on the case.\n\nThis means that every action — from staking to providing liquidity — can have different tax consequences. Understanding those distinctions is key to avoiding errors and maintaining complete traceability of your operations.\n\n---\n\n## What DeFi Taxation Is and Why It’s Different\n\n**DeFi taxation** refers to the tax treatment applied to operations carried out on decentralized protocols. These protocols allow lending, trading, liquidity provision, and earning rewards without the need for traditional intermediaries such as banks or centralized exchanges.\n\nThe main differences are:\n\n- Transactions are recorded on the **blockchain**, which enhances traceability but makes it harder to identify the nature of each operation\n- Returns can be generated in multiple ways: **staking, lending, farming, airdrops, NFTs**\n- The AEAT requires each type of return to be classified differently\n- There is no intermediary issuing a tax certificate, so the taxpayer must build their own report\n\n---\n\n## How Interest, Fees, and Rewards Are Taxed\n\nInterest earned through **staking or lending** is considered **investment income** (“rendimientos de capital mobiliario”) and is taxed under the savings base at rates ranging from **19% to 28%**, depending on the total amount.\n\nOn the other hand, rewards from **farming, airdrops, or liquidity pools** may be treated as **capital gains**.\n\n### 2025 Tax Rates\n\n| Taxable Base | Applicable Rate |\n|---|---|\n| Up to €6,000 | 19% |\n| €6,000 to €50,000 | 21% |\n| €50,000 to €200,000 | 23% |\n| €200,000 to €300,000 | 27% |\n| Over €300,000 | 28% |\n\n**Practical example:**\n\nImagine you earn:\n\n- €2,000 in interest from ETH staking\n- €1,500 in rewards for providing liquidity on Uniswap\n- €500 in airdropped tokens\n\n**Tax classification:**\n\n- The €2,000 from staking: **investment income** at 19%\n- The €1,500 from farming: **capital gains** at 19% (if sold)\n- The €500 from airdrops: **not taxed until sold or exchanged**\n\nEach protocol may imply different tax treatment. For example, tokens received as incentives for providing liquidity are not declared until they are sold or exchanged, while interest generated from staking must be declared annually.\n\n---\n\n## How to Declare DeFi Operations Step by Step\n\nThe first step to correctly declaring your DeFi activity is to **identify the nature of each transaction** — investment, yield, or exchange. To do this, you must analyze the transactions recorded on the blockchain and classify them according to current tax criteria.\n\n**Declaration process:**\n\n1. **Collect all transactions** from your wallets on each blockchain (Ethereum, Polygon, BSC, etc.)\n2. **Classify each transaction** according to its tax nature\n3. **Obtain the market value** in euros at the time of each operation\n4. **Apply the FIFO method** to calculate gains and losses\n5. **Generate the tax report** with all yields and capital gains\n6. **Include the data** in your income tax return (Form 100)\n\nAt **Cleriontax**, we apply a detailed classification process combining automated analysis with professional review to ensure every yield or gain is declared correctly in accordance with Spanish regulations.\n\n> **Important:** The AEAT may request documentation for each transaction. It’s essential to maintain complete records of all your DeFi operations.\n\n---\n\n## Taxation and Traceability in Multichain Environments\n\nMost DeFi investors operate across multiple networks — **Ethereum, Polygon, BSC, Solana, Cosmos** — which makes transaction traceability more complex. The AEAT requires proof of the origin and destination of funds, as well as the market value at each moment.\n\n**Multichain taxation challenges:**\n\n- **Liquidity bridges:** Transferring assets between blockchains may trigger taxable events\n- **Wrapped tokens:** Converting ETH to WETH or BTC to WBTC may be considered an exchange\n- **Different decentralized exchanges:** Each DEX records transactions differently\n- **Gas fees:** Fees paid in native tokens must be valued in euros\n\nOur team consolidates all that information to produce a **single, consistent tax report compliant with Spanish tax requirements**. This includes identifying cross-chain transactions, liquidity bridges, and token conversions across networks.\n\n---\n\n## Keys to Avoid Errors in Your DeFi Tax Return\n\nThe most common DeFi tax mistakes come from:\n\n- **Incomplete reports:** Failing to include all wallets or blockchains used\n- **Missing price data:** Not having historical market values for each token\n- **Incorrect classification:** Confusing yields with capital gains\n- **Airdrop omission:** Forgetting to declare free tokens when sold\n- **Incorrect FIFO application:** Errors in acquisition cost calculations\n\nIn many cases, automated tools fail to detect movements between protocols or tokens without market value.\n\n**That’s why at Cleriontax we perform a thorough validation** before generating the final tax report, ensuring every transaction reflects its correct tax impact. Our goal is for you to declare your DeFi earnings safely and in full compliance with the law.\n\n---\n\n## Conclusion: Tax Clarity in the DeFi Ecosystem\n\n**DeFi taxation** is complex but can be managed accurately with clean, classified data reviewed by experts. Every transaction counts, and proper traceability helps you avoid penalties and ensures confidence before the AEAT.\n\nThe key lies in:\n\n- **Complete traceability** of all your operations\n- **Accurate classification** of each type of income\n- **Precise valuation** of every transaction in euros\n- **Specialized crypto tax advice**\n\nAt **Cleriontax**, we help you turn your DeFi earnings into a clear, complete, and verified tax report ready for your 2025 income tax filing.\n\n---\n\n## Cleriontax: DeFi Taxation Experts\n\nAt **Cleriontax**, we specialize in the taxation of DeFi operations. Our team combines blockchain expertise, data analysis, and tax advisory experience to offer:\n\n- Comprehensive analysis of your activity across all DeFi protocols\n- Automatic classification and manual review of each transaction\n- Tax reports ready to include in your income tax return\n- Personalized assistance throughout the entire process\n\n**[Request your tax report →](/contact)**\n\nContact our team for a free initial evaluation. We’ll explain exactly what you need to do and how we can help you correctly declare your DeFi operations.\n\n---\n\n**Disclaimer:** This article is for informational and educational purposes only. It does not constitute personalized tax advice or investment recommendations. Tax laws are subject to change, and each individual situation is unique. Always consult a certified tax professional for your specific case.\n\n---\n\n*Last updated: November 2025*\n\n*Published by: Cleriontax Team – Experts in Cryptocurrency Taxation and Data Analysis*"
}
