{
  "title": "Stablecoins and Taxation in Spain 2025: Why Converting BTC to USDT Does Trigger Taxes with AEAT",
  "excerpt": "Thousands of investors believe that converting their cryptocurrencies to stablecoins like USDT or USDC protects them from taxes. Discover why this is one of the most costly mistakes you can make with the Spanish Tax Authority and how to avoid penalties of up to 150%.",
  "content": "Imagine this situation: You bought Bitcoin at €30,000 and it's now worth €60,000. The market seems unstable and you decide to 'protect' your gains by converting them to USDT. You haven't sold to euros, you've just moved to a stable coin. In your mind, you haven't realized any taxable gain. You're still in the crypto ecosystem.\n\n**Wrong.** You've just generated a capital gain of €30,000 that you must declare to the Tax Authority.\n\nThis is probably the **most widespread tax mistake** among cryptocurrency investors in Spain. The belief that stablecoins are a 'tax haven' where you can park your gains without AEAT finding out has led thousands of taxpayers to incorrect declarations, Tax Authority requirements, and penalties that can exceed 150% of undeclared amounts.\n\nIn this comprehensive guide, we'll analyze why stablecoins are taxed exactly the same as any other cryptocurrency, how operating with them affects you tax-wise, what AEAT actually says about USDT, USDC, DAI and other stablecoins, and how to avoid mistakes that could cost you thousands of euros in penalties.\n\n---\n\n## What are stablecoins and why they seem different\n\n**Stablecoins** are cryptocurrencies designed to maintain a stable value relative to a reference asset, usually the US dollar or euro. Unlike Bitcoin or Ethereum, whose prices constantly fluctuate, a stablecoin like USDT theoretically maintains a 1:1 parity with the dollar.\n\nThe most popular stablecoins in 2025 include Tether (USDT), USD Coin (USDC), DAI, BUSD, USDD, TrueUSD and dozens more. They all share the same objective: to offer the stability of a fiat currency with the operational flexibility of a cryptocurrency.\n\nFor traders and investors, stablecoins offer undeniable operational advantages. They allow quick movement between positions without needing to return to euros, facilitate trading on exchanges that don't operate with fiat, serve as temporary refuge during market drops, and allow maintaining available liquidity to seize opportunities without leaving the crypto ecosystem.\n\nBut this operational utility generates a **dangerous illusion**: the feeling that by not converting to euros, you're not 'materializing' gains tax-wise. This mistaken perception is the root of thousands of incorrect tax declarations each year in Spain.\n\n---\n\n## AEAT's official position: stablecoins as cryptocurrencies\n\nThe Spanish Tax Agency makes no distinctions between volatile cryptocurrencies and stablecoins. For AEAT, USDT is exactly the same as Bitcoin for tax purposes: a digital asset that must be declared following the same rules.\n\nThis position has been manifested in binding consultations, interpretative criteria, and in tax inspection practice. AEAT considers that any virtual currency, regardless of its price stabilization mechanism, is a patrimonial asset subject to general cryptocurrency taxation rules.\n\nThe technical reason is clear: tax-wise, what matters is not price stability, but the legal nature of the asset. Stablecoins are not euros, they're not guaranteed bank deposits, they're not regulated as electronic money under full MiCA regulations. They're tokens issued by private companies that promise to maintain an equivalent reserve, but from a Spanish legal standpoint are simply another cryptocurrency.\n\nThis classification has direct and automatic tax consequences. When you convert Bitcoin to USDT, you're performing an exchange between two different assets. The fact that one is stable and the other volatile is fiscally irrelevant. What's relevant is that you've transmitted an asset (BTC) in exchange for another (USDT), and that transmission generates a patrimonial alteration that must be taxed.\n\n---\n\n## Why BTC → USDT generates capital gains\n\nCryptocurrency taxation in Spain is based on the principle of patrimonial alteration. Every time you transmit an asset, whether selling it, exchanging it or bartering it, you generate a taxable event that must be declared in personal income tax.\n\nWhen you perform the BTC → USDT operation, you're technically executing a barter. You deliver Bitcoin and receive Tether in exchange. This operation is functionally identical to BTC → ETH or BTC → SOL. The fact that USDT has a stable price doesn't change the tax nature of the transaction.\n\nThe capital gain or loss is calculated as the difference between the transmission value (the price at which you 'sell' the BTC, expressed in euros) and the acquisition value (the price at which you originally bought that BTC). If you bought 1 BTC at €30,000 and convert it to USDT when it's worth €60,000, the capital gain is €30,000, regardless of whether you received digital dollars instead of real euros.\n\nThis gain is integrated into the savings tax base of your personal income tax and is taxed according to applicable rates in 2025: 19% up to €6,000, 21% between €6,000 and €50,000, 23% between €50,000 and €200,000, 27% between €200,000 and €300,000, and 28% above €300,000. In our example, on a gain of €30,000, the approximate tax would be €6,090 (19% on the first €6,000 and 21% on the remaining €24,000).\n\nThe practical consequence is devastating for those who ignore this rule: you can generate tens of thousands of euros in capital gains through conversions to stablecoins, believing you 'haven't sold anything', and face a Tax Authority settlement years later claiming taxes, late payment interest, and penalties on operations you didn't even know you had to declare.\n\n---\n\n## The tax haven myth: why USDT doesn't protect you from Tax Authority\n\nThe 'tax haven' narrative in stablecoins is based on several fundamental misunderstandings about how cryptocurrency taxation works.\n\nThe first is confusing volatility with taxation. Many investors reason thus: 'If I convert BTC to USDT, the price stays stable, therefore I haven't gained or lost anything'. This reasoning confuses the economic function of stablecoins (protecting against volatility) with their tax nature (exchangeable assets subject to taxation). The relevant tax moment is not when the price fluctuates, but when you transmit the asset.\n\nThe second misunderstanding is thinking that 'not leaving the crypto ecosystem' equals 'not realizing gains'. Tax-wise, each conversion between cryptocurrencies is an independent transmission. It doesn't matter if the money 'exits' to your bank account or stays in Binance converted to USDT. The transmission of Bitcoin generates the taxable event.\n\nThe third error is believing that the Tax Authority can't track crypto-to-crypto operations. The reality is that exchanges are obliged to report tax information, blockchain transactions are public and traceable, and AEAT has international information exchange agreements with foreign exchanges. Thinking that conversions to USDT are 'invisible' is dangerously naive.\n\nFinally, there's the fallacy that 'since USDT is worth 1 dollar, there's no gain'. This confuses the acquisition value of USDT with the gain generated by selling BTC. When you convert 1 BTC for 60,000 USDT, you've obtained a value of 60,000 dollars (approximately €60,000 at exchange). If that BTC cost you €30,000, you've generated a €30,000 gain, regardless of whether you now have digital dollars instead of Bitcoin.\n\n---\n\n## Practical cases: the real cost of the stablecoin mistake\n\nLet's look at three real examples that illustrate how this error affects different investor profiles.\n\n**Case 1: The active trader who ignores conversions**\n\nCarlos is an active trader who operates mainly on Binance. During 2024 he made dozens of operations, alternating between Bitcoin, altcoins and USDT as temporary refuge. His usual strategy was to buy BTC when he considered it low, wait for it to rise, convert to USDT to protect gains, and then look for another opportunity.\n\nAt year's end, Carlos calculated that he had invested €20,000 initially, now had 50,000 USDT in his account, but since he 'hadn't withdrawn money to euros', he thought he only needed to declare if he sold the USDT. His reasoning: 'I'm still with everything in crypto, I haven't materialized anything'.\n\nThe tax reality was very different. Each of his BTC → USDT conversions had generated capital gains he should have declared. Detailed analysis of his transactions revealed accumulated gains of €30,000 during the year. By not declaring them, Carlos exposed himself to a tax settlement of approximately €6,300 in taxes, plus late payment interest of 4% annually, plus a penalty of 50% to 150% depending on severity. In the worst scenario, he could face a total bill exceeding €15,000.\n\n**Case 2: The conservative investor who discovers form 721**\n\nLaura bought Bitcoin in 2020 for €15,000. In 2023, with BTC at highs, she decided to 'secure gains' by converting everything to USDC worth €65,000, which she kept in Coinbase. Since she hadn't sold to euros, she didn't declare anything in her 2023 tax return.\n\nIn 2024, Laura received a requirement from AEAT. The problem wasn't just that she should have declared €50,000 of capital gain in 2023 (BTC bought at €15,000, effectively sold at €65,000), but additionally, having €65,000 in USDC on a foreign exchange (Coinbase, based in USA), she was obliged to file form 721 declaring those assets before March 31, 2024.\n\nThe penalty for not filing form 721 is especially severe: minimum €10,000, potentially reaching 150% of the undeclared balance. Laura faced a potential penalty of up to €97,500 (150% of €65,000), plus the tax settlement for undeclared capital gain (approximately €10,500), plus late payment interest. A mistake that could cost her over €100,000.\n\n**Case 3: The DeFi investor who forgets DAI also gets taxed**\n\nJavier is an advanced DeFi user. He uses DAI (decentralized stablecoin) to operate in protocols like Aave and Curve. His strategy: convert ETH to DAI, deposit DAI in liquidity pools to generate yields, and when he sees opportunities return to ETH.\n\nDuring 2024, Javier performed multiple ETH → DAI → ETH cycles. At year's end, he calculated he had generated €8,000 in DeFi yields (staking, farming), which he did correctly declare. But he didn't declare ETH → DAI conversions, assuming 'DAI isn't a sale, it's just a conversion to operate'.\n\nTax analysis revealed that his ETH → DAI conversions had generated additional capital gains of €12,000 he hadn't declared. Additionally, DAI → ETH reconversions also generated taxable events. The result: an incomplete declaration that could result in penalties of 50% to 100% on the €2,500 of unpaid taxes, plus interest.\n\n---\n\n## Stablecoin operations that DO get taxed\n\nTo eliminate any doubt, let's exhaustively review all stablecoin operations that generate tax obligations in Spain.\n\nConversion from volatile cryptocurrency to stablecoin (BTC → USDT, ETH → USDC, SOL → DAI) generates capital gain or loss. This is the most common operation and the most misunderstood. Every time you convert a volatile asset to a stable one, you must calculate and declare the tax result.\n\nConversion from stablecoin to volatile cryptocurrency (USDT → BTC, USDC → ETH) also gets taxed. When you use your USDT to buy Bitcoin, you're transmitting the USDT. If the value of USDT at that moment (in euros) is higher than what it originally cost you to obtain it, you generate capital gain. This case is less common because USDT usually maintains stable value, but can occur if there are fluctuations in the USD/EUR exchange rate or if you obtained USDT at a discount.\n\nConversion between different stablecoins (USDT → USDC, DAI → BUSD) generates a technical taxable event, although usually with gain/loss close to zero if both maintain parity. However, tax-wise it's still a barter that must be recorded.\n\nUsing stablecoins to buy goods or services is taxed just like paying with Bitcoin. If you use 1,000 USDT to buy a product, and that USDT originally cost you €900, you generate a €100 capital gain.\n\nDepositing stablecoins in DeFi protocols to generate yields has double taxation: first, if you obtained the stablecoins through conversion (e.g. BTC → USDT), that conversion gets taxed; second, the interest or rewards generated are taxed as capital income when you receive them.\n\nSelling stablecoins to euros obviously gets taxed, although in many cases the gain will be small (if you bought USDT at €1 and sell at €1, zero gain). But if you obtained those stablecoins through a previous undeclared operation, the Tax Authority can question your acquisition cost.\n\nEven simply holding more than €50,000 in stablecoins on foreign exchanges or wallets obliges you to file form 721 annually before March 31, even if you haven't performed any operations during the year. This informative obligation is independent of whether you've generated gains or not.\n\n---\n\n## How to correctly calculate gains with stablecoins\n\nCorrect tax calculation of operations with stablecoins requires precision in three fundamental elements: acquisition value, transmission value, and application of the FIFO method.\n\nThe acquisition value of a stablecoin is the cost in euros of obtaining it. If you bought 10,000 USDT with a bank transfer of €10,000, that's your acquisition value. If you obtained 10,000 USDT by converting 0.2 BTC when it was worth €50,000/BTC, your acquisition value of USDT is €10,000, and additionally you generated a gain or loss on the BTC sale that must be calculated separately.\n\nThe transmission value is the value in euros at the moment of operation. If you convert 1 BTC to 60,000 USDT when the USDT/EUR exchange rate is 1:1, your transmission value is €60,000. If you do it when the dollar is stronger and 60,000 USDT equals €55,000, that's your transmission value.\n\nApplication of the FIFO (First In, First Out) method is mandatory in Spain. If you've bought USDT on various occasions at different prices, when you use or convert them, you must consider that you're using the oldest USDT first. This method can generate counterintuitive results if you don't keep detailed records.\n\nLet's see a complete example. You bought 0.5 BTC at €40,000 in January 2024. In March, when BTC is worth €55,000, you convert to 27,500 USDT. Capital gain: €27,500 - €20,000 = €7,500 (taxed in 2024 tax return). In May, you buy another 0.3 BTC with those 27,500 USDT when BTC is worth €50,000. Acquisition cost of new BTC: €27,500. In October, BTC rises to €65,000 and you sell the 0.3 BTC to euros for €19,500. Capital gain: €19,500 - €15,000 = €4,500 (taxed in 2024 tax return).\n\nThe common mistake would be thinking that only the last sale gets taxed (0.3 BTC → EUR). The reality is you were taxed twice: once in the BTC → USDT conversion (€7,500) and again in the final sale (€4,500), with a total declarable gain of €12,000 in year 2024.\n\n---\n\n## Form 721 and stablecoins: the €50,000 trap\n\nForm 721 (formerly 720) is perhaps the most unknown and potentially most costly tax obligation related to stablecoins.\n\nIf on December 31 you have more than €50,000 in cryptocurrencies on foreign exchanges or wallets, you're obliged to declare it through form 721 before March 31 of the following year. This obligation is informative, you don't pay taxes for filing it, but the penalties for not doing so are the most severe in the Spanish tax system.\n\nThe minimum penalty is €10,000 for each omitted block of information. The maximum penalty can reach 150% of the undeclared balance. If you don't file form 721, the statute of limitations for your tax obligations extends from 4 to 10 years, allowing the Tax Authority to review very old operations.\n\nStablecoins generate a specific trap because their value is predictable. An investor might think: 'I only have €40,000 in BTC, I don't reach the €50,000 threshold'. But if he converts that BTC to USDT and the market rises, he can suddenly have €60,000 in USDT without realizing it, activating the form 721 obligation he was unaware of.\n\nWorse still, if you have 55,000 USDT in Binance on December 31, you must file form 721 even if during the entire year you haven't made any operation. The mere holding already generates the informative obligation.\n\nFor AEAT, stablecoins on foreign exchanges (Binance, Coinbase, Kraken, etc.) or in non-custodial wallets (MetaMask, Ledger, etc.) are considered foreign assets. The criterion is that the blockchain is not physically in Spain, therefore the asset is 'abroad' for form 721 purposes.\n\nThis interpretation generates absurd but legally binding situations. If you have 60,000 USDC in your Ledger (hardware wallet you completely control), technically you must declare it in form 721 because AEAT considers those USDC 'are' on the Ethereum blockchain, which is not Spanish.\n\n---\n\n## Common mistakes and how to avoid them\n\nThe first big mistake is not declaring crypto-to-stable conversions thinking they're not sales. This is the most widespread and costly error. The solution is simple but requires discipline: treat each conversion to stablecoin exactly like a sale to euros. If you convert BTC to USDT, calculate and record the capital gain at that moment.\n\nThe second mistake is using current USDT value instead of the value at the moment of operation. When you calculate gains, you must use the USDT/EUR exchange rate of the exact day of the transaction, not the current rate. This error can generate significant differences if the dollar has fluctuated.\n\nThe third mistake is not reconciling stablecoin transfers between exchanges. If you transfer 10,000 USDT from Binance to Coinbase, that's NOT a sale (not taxed). But automatic software often records it as sale in Binance + purchase in Coinbase, creating phantom gains. You must manually tag these internal transfers.\n\nThe fourth mistake is forgetting that stablecoins count toward the €50,000 threshold of form 721. Many investors watch their BTC and ETH, but forget their 40,000 USDT 'for safety' also count. If your total portfolio abroad (BTC + ETH + USDT + any other crypto) exceeds €50,000 on December 31, you must file form 721.\n\nThe fifth mistake is thinking that operating on a decentralized exchange (DEX) like Uniswap makes you fiscally invisible. On-chain transactions are public and permanent. AEAT can track any operation performed on a DEX through blockchain analysis. That there's no centralized intermediary doesn't mean the operation is invisible.\n\nThe sixth mistake is blindly trusting automatic tools like CoinTracking or Koinly for stablecoin operations. These tools are not adapted to the specific criteria of Spanish AEAT and frequently misclassify operations with stablecoins. You must manually review each conversion.\n\n---\n\n## Legal tax strategies with stablecoins\n\nAlthough stablecoins are not a tax haven, they do have legitimate uses within a well-planned tax optimization strategy.\n\nA valid strategy is using stablecoins to defer taxes within the same year. If you generate significant gains in January and convert to USDT, you've already generated the taxable event. But if you then reinvest that USDT in another crypto that falls during the year, you can generate losses that offset previous gains. This is tax-loss harvesting, completely legal if done correctly.\n\nAnother strategy is using stablecoins to maintain operational liquidity without leaving the crypto ecosystem. If you plan to trade actively, maintaining a percentage in USDT allows you to seize opportunities quickly. Tax-wise, conversions get taxed, but at least you optimize your trading operations.\n\nStablecoins are also useful for accurately calculating the result of complex operations. By converting to USDT after each winning operation, you establish a clear acquisition value for the next operation, facilitating subsequent FIFO calculation.\n\nIn the DeFi realm, stablecoins allow generating passive yields (staking, lending) that are taxed as capital income, generally at lower rates than capital gains if your income level is moderate. Depositing USDC in Aave can be more tax-efficient than active trading, as long as you declare correctly.\n\nFinally, for investors who exceed the €50,000 threshold and must already file form 721, keeping part of the portfolio in stablecoins can facilitate calculating the value to declare, since USDT has a stable and predictable price, unlike BTC which can fluctuate significantly between December 31 and the filing date.\n\n---\n\n## What to do if you haven't declared conversions to stablecoins\n\nIf you've made conversions to stablecoins in previous years and didn't declare them, you have several options, each with different consequences.\n\nThe first option is filing a supplementary declaration. If the tax return filing deadline hasn't closed yet (until June 30 of the following year), you can file a supplementary declaration that replaces the previous one. You only pay the tax difference plus late payment interest of 4% annually from the filing deadline. There's no penalty if you do it voluntarily within the deadline.\n\nThe second option is filing a late declaration without prior requirement. If the deadline has passed but the Tax Authority hasn't sent you a requirement yet, you can voluntarily file the corrected declaration. You pay the tax plus late payment interest plus a surcharge ranging from 5% (if you file within 3 months after deadline) to 20% (if you file after 12 months). But you avoid the formal penalty.\n\nThe third option, the worst, is waiting for the Tax Authority to require you. In this case, in addition to tax and interest, you face penalties ranging from 50% to 150% of the unpaid amount, depending on whether it's considered minor (oversight), serious (negligence) or very serious (concealment) infraction. If the Tax Authority considers you intentionally concealed operations, the penalty can be devastating.\n\nFor form 721, if you forgot to file it, the recommendation is to file a late declaration immediately. The minimum penalty is €10,000, but if you file voluntarily before requirement and acknowledge the facts, you can obtain significant reductions (up to 50% reduction if you don't appeal). Waiting only worsens the situation.\n\nIt's essential to consult with a specialized professional before deciding which option to take. A tax advisor expert in crypto can evaluate your specific situation, calculate exactly how much you should have declared, estimate potential penalties, and design the regularization strategy that minimizes total cost.\n\n---\n\n## The future: MiCA regulation and stablecoins in Europe\n\nThe regulatory landscape for stablecoins is changing radically in Europe with implementation of the MiCA (Markets in Crypto-Assets) regulation, which will come into full effect in 2025.\n\nMiCA establishes strict requirements for stablecoin issuers, including minimum reserves, regular audits, banking licenses in some cases, and guaranteed redemption mechanisms. Stablecoins like USDT and USDC must adapt or stop operating in Europe.\n\nThis regulation may have indirect tax implications. If stablecoins are regulated as electronic money under MiCA, some states might consider treating them tax-wise more as currency than as asset. However, so far there's no indication that Spain will change its current criterion: as long as they're blockchain tokens, they'll be taxed as cryptocurrencies.\n\nMiCA will also establish reporting obligations for exchanges and custodians, similar to DAC8 directive. This means exchanges will be obliged to automatically report to tax authorities their users' operations, including crypto-to-stable conversions. The Tax Authority's ability to detect undeclared operations will multiply.\n\nFor investors, this means the space for tax 'mistakes' will drastically reduce. If in 2023-2024 it was possible that the Tax Authority wouldn't detect your BTC → USDT conversions, in 2025-2026 it will be virtually impossible. Exchanges will automatically report every operation.\n\nThe recommendation is clear: don't count on opacity or Tax Authority ignorance. Declare correctly from now, because the future will be one of total transparency.\n\n---\n\n## Conclusion: declare stablecoins correctly to avoid penalties of thousands of euros\n\nThe belief that stablecoins are a tax haven is one of the most dangerous and costly myths in the Spanish crypto world. Thousands of investors have generated tens of thousands of euros in undeclared gains through BTC → USDT conversions, honestly believing they 'hadn't sold anything'.\n\nThe tax reality is unequivocal: every conversion to stablecoin is taxed exactly like a sale to euros. AEAT makes no distinctions between USDT and Bitcoin. Both are cryptocurrencies, both generate capital gains when transmitted, both must be declared in form 100, and both count toward the €50,000 threshold of form 721.\n\nThe consequences of ignoring these obligations can be devastating: penalties of 50% to 150% on unpaid taxes, tax settlements going back up to 10 years if you didn't file form 721, accumulated late payment interest, and in extreme cases, possible tax crime if the amount exceeds €120,000.\n\nBut beyond fear of penalties, there's a positive reason to declare correctly: establishing a clear tax history protects you in the future. If someday you need to justify the origin of €200,000 in your bank account from crypto, having correct historical declarations is your best defense. Tax transparency is also patrimonial protection.\n\nIf you've operated with stablecoins and aren't sure you declared correctly, act now. The sooner you regularize, the lesser the consequences. Don't wait for Tax Authority requirement.\n\n---\n\n## Cleriontax: experts in stablecoin taxation and complex crypto operations\n\nHave you operated with USDT, USDC, DAI or other stablecoins and don't know if you declared correctly? Did you exceed €50,000 on foreign exchanges and didn't file form 721? At **Cleriontax** we're specialists in cryptocurrency taxation and complex cases with stablecoins.\n\nOur team combines experience in Spanish taxation with blockchain data analysis to reconstruct your complete operation history, identify each crypto-to-stable conversion, calculate correct capital gains applying FIFO according to AEAT criteria, and prepare supplementary or late declarations that minimize penalties.\n\nOur services include complete audit of your stablecoin operations, calculation of undeclared gains in previous years, preparation of form 721 if you exceed thresholds, voluntary regularization strategy to minimize penalties, preparation of form 100 with all conversions correctly classified, and defense before Tax Authority requirements related to crypto operations.\n\nDon't leave your tax situation to chance. A professional analysis can be the difference between regularizing voluntarily with controlled cost or facing penalties of tens of thousands of euros after a requirement.\n\n**[Request your personalized tax analysis →](/contact)**\n\nOur team of crypto taxation experts will help you comply with all your tax obligations safely, professionally and optimized. If you've made mistakes in the past, we help you correct them with the minimum possible cost.\n\n---\n\n**Disclaimer:** This article is for informational and educational purposes only. It does not constitute personalized tax advice. Tax regulations are subject to change and each personal situation is unique. Always consult with a licensed professional tax advisor before making tax decisions related to cryptocurrencies.\n\n---\n\n*Last updated: January 2025*\n\n*Published by: Cleriontax Team - Experts in Cryptocurrency Taxation and Data Analysis*"
}